{"url": "http://www.brain-sharper.com/entertainment/wwe-wives-yh/", "text": "Professional wrestlers are known for their strength, fearlessness, and ego. These days, it seems that every great wrestler has a beautiful woman supporting them whether they win or lose. Here are some of our favorite wives in the wrestling world.\n\nStephanie McMahon – Triple H What initially began as a scripted relationship blossomed into something real when Hunter Hurst Hemsley, aka Triple H, started a relationship with Stephanie McMahon. The couple first started dating in 2000 and were married by 2003. McMahon and Triple H have now had three daughters together.\n\nAJ Lee – CM Punk We all know the classic WWE love story: Big successful male wrestler meets equally successful female wrestler. The two become an unstoppable wrestling power-couple, get married, retire and have children who also go on to become wrestlers. AJ Lee and CM Punk are well on their way to completing this wrestling love story. The only thing they still need to check off the list is children. Punk and Lee now reside in Chicago, so we figure their house will be full of little wrestlers soon enough!\n\nRebecca Curci – Sean Michaels Prior to tying the knot with WWE legend Sean Michaels, Rebecca Curci was a wrestler in her own right, taking the wrestling alias Nitro Girl. Michaels spotted Nitro Girl and knew he wanted to be with her, despite his reputation as one of the most desirable heartthrobs in all of wrestling. In 1999, the couple eloped to Las Vegas and promptly got married. Since their Vegas marriage, Michaels and Curci have been living a happily married life with two children\n\nBrandi Rhodes – Cody Rhodes Before becoming the female wrestler known as Eden Stiles, Brandi Rhodes was pursuing a career in broadcast journalism. She worked her way up from a news reporter to anchor and eventually became an announcer for the WWE. She first met Cody Rhodes through her job. While she was hesitant at first, not wanting to get involved with a co-worker early in her career, eventually she caved and accepted an invitation to hang out Rhodes. The two have been inseparable ever since.\n\nMaryse Ouellet – The Miz The Miz and WWE Diva Maryse Ouellet are in love and they want the whole world to know! Maryse and the WWE superstar tied the knot back in February 2014 and have since then loved sharing their romance with the world, constantly posting photos and videos on Instagram, Twitter, and Facebook. After retiring from wrestling in 2011, Maryse now spends most of her time ringside, cheering on her man, coaching him up, and watching The Miz take care of the biz.\n\nKristin Austin – Stone Cold Steve Austin Stone Cold Steve Austin, aka The Texas Rattlesnake, is credited by many for pioneering the golden age of WWE- The Attitude Era. Since beginning his wrestling career in the early 1990s, Stone Cold Steve Austin has had plenty of love interests, relationships, and even three failed marriages. He finally found his stone cold soulmate when he met Kristen Feres. The two have been happily married since 2009 and now split time residing in Marina Del Rey, California, and Tilden, Texas.\n\nMarissa Mazzola – Shane McMahon Shane McMahon boasts an impressive resume as the WWE’s Executive Vice President of Global Media. He is also the son of WWE CEO Vince McMahon, brother of Diva Stephanie, and happens to be in one of the longest standing marriages on our list. McMahon tied the knot with Marissa Mazzola way back on September 14th, 1996 but the couple have been together since high school. They are now happily married, living in New York City with their three sons- Declan, Kenyon, and Rogan.\n\nReby Sky – Matt Hardy Time heals all, and that’s exactly what Matt Hardy needed following his breakup with on again off again ex-girlfriend and WWE Diva, Lita. Eventually, Hardy moved on and found Reby Sky, an aspiring female wrestler who Hardy once trained before the two decided to get married. Their love story has not been simple, however, and involves a couple of domestic disputes and restraining orders. Hardy and Sky have since reconciled and moved on from these issues, realizing what truly matters.\n\nLauryn Laine McBride – Jerry “The King” Lawler Jerry “The King” Lawler has typically used his sense of humor to charm the long list of women he has dated in his lifetime. But none of them stuck with WWE personality until he met Lauryn Laine McBride, who was smitten at the Lawler’s attempts to whoo her. Despite the age difference, McBride said yes to Lawler’s proposal and the two are currently engaged. After three failed marriages, Lawler is hoping this will be the last time he says “I do.”\n\nJackie Gayda-Haas – Charlie Haas The ultimate wrestling power couple, Jackie Gayda and Charlie Haas, tied the knot back in 2005 and have since then added four children to their wrestling squad. Aside from their frequent cameos and appearances in the ring, Haas and Gayda run and operate their own nutrition store in Texas called Custom Muscle Nutrition and Smoothies. Using their remarkable physiques as marketing tools, proving to customers that their products work, it’s no wonder their business is thriving.\n\nNaomi – Jimmy Uso As a talented female wrestler herself, SmackDown Women’s Champion, Naomi, got together with Jimmy Uso, and formed one scary and intimidating couple. Prior to marrying the SmackDown superstar, Naomi starred on the E! reality show, Total Divas. Naomi was unfortunately removed from the show following the news that she married Uso. Naomi is now on the comeback trail following her recovery from some serious injuries she sustained during a battle with the Riott Squad in November 2017.\n\nLaurel Van Ness – Zack Ryder Up and coming superstar, Zack Ryder has recently taken the WWE by storm, with his girlfriend Chelsea Anne Green by his side every step of the way. Green is also a wrestler, currently trying to make a name for herself in the Global Force Wrestling organization, wrestling under the alias ‘Laurel Van Ness’. The couple have been dating since 2016 with no signs of slowing anytime soon. Ryder has recently been included on the SmackDown roster, giving the couple something to celebrate.\n\nLana – Rusev The WWE’s Lana is actually named Catherine Perry. Before she was slamming opponents in the ring herself, Lana was the manager of Bulgerian wrestler Rusev. While Lana has often taken background role in the double act, with Rusev himself providing the muscle, in recent years she has begun a career of her own inside the ring as a talented and dynamic wrestler. After some time, the pair became more than just business partners and got married in 2016.\n\nSarah Backman – Bo Dallas While Bo Dallas may have spent endless hours in the gym working on his impressive physique, Sarah Backman, the wife of the WWE Raw superstar, is certainly giving him a run for his money. The blonde Swede has also put in some serious work in the weight room and is seeing results. Backman, an eight-time World Arm Wrestling Champion, was recruited to the NXT institution and was on track to becoming a professional wrestler herself. But ultimately, it wasn’t meant to be.\n\nMeredith Whitney – John Layfield While most wrestlers choose to couple up with other wrestlers, announcers, or wrestling managers, John Layfield chose to marry a financial analyst. Meredith Whitney met Layfield back when he went by wrestling aliases Bradshaw and JBL. The two were co-workers on Fox when they began dating one another. It didn’t take long for sparks to fly between the two and they were married by 2005. In 2015, Whitney shut down her business and moved with Layfield to their private residence in Bermuda.\n\nKaren Jarrett – Jeff Jarrett Karen Smedley was, at one point, the wife of the great Olympic medalist, Kurt Angle. Karen left Angle in 2008, and by 2010 she was married to Jeff Jarrett. She took the Jarrett name not only legally but in the ring as well. Today, Jeff and Karen are still happily married with two children. Although she has had a couple of kids, at 45 years young, Karen has somehow maintained the stunning physique she obtained from her days as an exotic dancer.\n\nRenee Young – Dean Ambrose While Dean Ambrose may be the longest running WWE United States Champion of all time, his greater accomplishment is most likely putting a ring on the finger of his dream girl, Renee Young. Renee Young was a journalist when she met Ambrose for an interview. Sparks flew, and the couple instantly wanted more of each other. For the rugged wrestler, it was more that Renee Young’s looks that roped him in. She also has a great sense of humor as an aspiring comedian.\n\nKori Campfield – Kofi Kingston Kofi Kingston is considered by many to be the King of Royal Rumble saves. In 2010 he also became the husband of the beautiful Kori Campfield. The athletic Ghanaian wrestler loves to show off his wife every chance he gets, whether it’s at a WWE event or simply a night out on the town. The married couple share two children together and spend their time between Smackdown events in Tampa, Florida. It seems to be smooth sailing ahead for these lovebirds!\n\nSharmell Sullivan-Huffman – Booker T Following a five-year courtship, Sharmell Sullivan and Booker T got married and decided to assign themselves the titles of King Booker and Queen Sharmell. This duo of wrestling royalty began building a family together in 2005 and retired from wrestling soon after. While their “reign” in the WWE ring may be over, Sullivan and Booker T now rule a whole new domain as parents of twins. Booker T is now attempting to suplex his way into politics, running in the 2019 election for mayor of Houston.\n\nSamantha Rotunda – Bray Wyatt Wingham Lawrence Rotunda, aka Bray Wyatt, married Samantha back in 2012. Their lives seemed to be going according to plan. The couple had been happily married for five years with two children. Everything came crashing to a halt when Samantha found out that Bray had reportedly cheated on her with WWE announcer Jojo Offerman. Feeling abused by his infidelity, Samantha filed for divorce in June 2017. While his personal life may be unstable, Bray Wyatt has remained relevant on WWE Raw.\n\nBrie Bella – Daniel Bryan As half of the Bella Twins duo, Brie Bella chose to marry a fellow professional wrestler in Bryan Danielson, aka Daniel Bryan. Brie didn’t think for a second when Bryan popped the question in 2014. While the Bella Twins may have a reputation as villains inside the ring, its seems as though Bryan brings out the best in Brie. Fans of the Bella Twins also seem to support the wresting couple. In 2017, Brie gave birth to a baby girl named Birdie Joe Danielson.\n\nCatalina Hager – Jack Swagger It came as no surprise to us when Jack Swagger fell in love with Catalina Hager, formerly known as Catalina White. What’s not to love? The beautiful model has been featured in numerous magazines including Maxim, FHM, and Complex Magazine. Meanwhile, Swagger has been signed as a heavyweight to the Bellator MMA promotion in addition to wrestling in the WWE. The couple got married in 2010 and now share two children- a son, Knox Stribling, and a daughter, Presley Pearl.\n\nGiovanna Yannotti – Kurt Angle As one of the biggest household names in all of wrestling, there isn’t a lot that Kurt Angle hasn’t achieved. Angle, a former Olympic gold medalist, came on the WWE scene in 1998. He’s been through two marriages, and his first wife is now married to Jeff Jarrett, another pro wrestler. You won’t see Angle throwing his own pity party, however. He also moved on as well to the beautiful Giovanna Yannotti, marrying the actress in 2012. The two now share three daughters together.\n\nGalina Becker – Roman Reigns Back in his glory days, Roman Reigns, born Leati Joseph Anoa’i, was a king of the campus as a division 1 college football player at Georgia Tech. This is where he met his future wife, Galina Joelle Becker. The couple were engaged for two years before tying the knot in 2014. Not long after their marriage, the couple had a daughter named Joelle and the college sweethearts are still going strong to this day. It truly warms the heart to see such a devoted couple!\n\nWanda Ferraton – Bill Goldberg Back in his prime, there was no name bigger than Goldberg in the WCW. Goldberg dominated anyone and everyone that stood in his way. Following his WCW success, Goldberg wrestled in the WWE for a bit. Goldberg met the woman of his dreams while he was dressed as a twisted version of Santa during filming of the 2005 black comedy horror Christmas film, Santa’s Slay. Wanda Ferraton was a stunt double. The couple now have a son named Gage and reside in California.\n\nPaige – Alberto Del Rio Following rumors of adultery and the bitter, abrupt end of Alberto Del Rio’s marriage to Angela Velkei, the Mexican professional wrestler found a rebound in Saraya-Jade Bevis, also known as the British two-time Divas Champion, Paige. Things seemed to be going great for Paige and Del Rio following the announcement of their engagement in 2016. Unfortunately, the couple called off the engagement in late 2017. We hope the former couple can reconcile and that the break-up won’t shake up their working relationship.\n\nLauren Hashian – The Rock Can you smell what The Rock is cooking? Lauran Hashian sure can. Most likely “The People’s Champion” is cooking up some Sunday morning pancakes for his family. The couple have been together since 2007 and even have a baby girl together, with another on the way. Dwayne Johnson met Hashian during filming of his 2007 film, The Game Plan. As the daughter of the late drummer for the famous band, Boston, Hashian is a talented singer in her own right.\n\nJessica Lockhart – Chris Jericho Chris Jericho is definitely one of the bigger names on our list. The “Ayatolla of Rock N’ Rollah” has been married to Jessica Lockhart since 2000. Jericho met Lockhart back in high school and together they have certainly dealt with their fair share of rumors and drama, with speculations of infidelity on both sides. Fortunately, both Jericho and Lockhart have denounced any rumors of this kind and have reassured fans that nothing will separate these high school sweethearts. They have three kids together.\n\nMichelle McCool – The Undertaker Since coming onto the scene, The Undertaker has always been a wrestler who remains quiet and takes pride in his mysterious persona. This all changed when his relationship with former Diva Michelle McCool went public. It seems as though McCool has put pressure on the Phenom to share more and more photos of their holidays together in addition to nights out to sports events. In 2010, the couple tied the knot and are now parents to a daughter named Kaia Faith Calaway.\n\nWendy Jones – AJ Styles AJ Styles is another one of the few wrestlers on our list to marry outside of the industry, tying the knot with schoolteacher Wendy Jones in 2000. The happily married couple have four children together and Styles has each of their birth dates tattooed on his torso. Styles also ensured that each of his children would share his A.J. initials naming them Ajay, Avery, Albey and Anney. As a devout Christian, AJ has also passed along his faith to his children.\n\nDenise Hartmann – Christian Cage Sometimes you just have to trust that fate will sort things out. In the case of German Model Denise Hartmann, fate worked in her favor when she met WWE star Christian Cage while on vacation in England. Hartmann just happened to be in the right place at the right time and somehow spotted Cage in a crowd and its been nothing but smiles ever since. The couple tied the knot in December 2001 and have since had a daughter together named Isla.\n\nCandice LeRae – Johnny Gargano Let’s face it, Johnny Gargano and Candice LeRae aren’t the first pair of wrestlers to fall in love. AJ Lee and CM Punk immediately come to mind. They had already come a long way together before making their relationship official, with many encounters both in the ring and behind the scenes. Then, the couple made their bond eternal when they got married in 2016. Despite having lots of drama in the WWE, they are pretty stable in reality.\n\nSasha Banks – Sarath Ton It seems like Sasha Banks has exceeded Sarath Ton in the wrestling department. While the latter became a costume designer, the former has gone on to win the RAW Women’s Championship. In fact, it was just a few days after they got married that she won it for the fourth time at Summerslam. Officially part of the Four Horsewomen who helped usher in the “Diva’s Revolution,” Banks is regarded these days as one of the most talented female wrestlers in the game.\n\nStephanie Washington – Bret Hart There is no denying the impact that Bret “The Hitman” Hart has had on the wrestling industry. Arguably the most well-respect wrestler to have come out of Canada, the Sharpshooter expert is best known for falling from grace, from the WWE’s ultimate face to one of its heels as a result of a staged wrestling scandal involving Vince McMahon. He married Stephanie Washington in 2010, and although he is twice her age, Brett is hoping this is third-time lucky after two unsuccessful marriages.\n\nStephanie Miller – Heath Slater Alongside teammate Rhyno, Heath Slater officially became part of the first ever Smackdown! Tag Team Champions. With excellent finishing moves such as the Jumping Neckbraker and the Corkscrew Plancha in his arsenal, Slater is so unpredictable in the ring. His private life is a bit more straightforward, having married Stephanie Jean (now Miller.) Heath Slater lives a pretty conventional life with Stephanie in Fort Mill, South Carolina and since tying the knot, the couple had two daughters together.\n\nTamara McMichael -Kevin Nash The master of the powerbomb, Kevin Nash was at his WWE peak in the early 90s under the alias Deisel. It was in the WCW though where Nash truly made a name for himself. Together with Hollywood Hulk Hogan and Scott Hall (known as Razor Ramon in the WWE), the star-studded trio create the New World Order. It seems like his private life has been just as eventful, having married Tamara McMichael in 1988, separating in 2000, and then getting back together shortly after.\n\nSabine Borden – Sting Arguably one of the most iconic wrestlers of WCW, Sting is best known for hardly ever revealing his true self beneath that black and white face paint. After a previous marriage, Sting eventually married Sabine, shortly after Wrestlemania 31. Sabine also came out of another marriage after having two children. The personal trainer fell in love with Sting at first sight, and it seems like the couple will have plenty of time to have fun together. Sting retired in 2016.\n\nAngie Gutierrez – Rey Mysterio One of the ultimate luchadors in the world of wrestling, Rey Mysterio has already done so much in his WWE career. However, you can not ignore his personal life, seeing that he has been married to Angie Gutierrez since 1997. It turns out that Rey’s real name isn’t so Mysterio after all. Angie likes to refer to him by his birth name, Oscar. He has expressed his love for her by having many tattoos of her on his body.\n\nSonia Delbeck – Rob Van Dam It made sense that Rob Van Dam went for such an awesome ring name. He was born Robert Szatkowski, which doesn’t have quite the same ring to it. Since 1998, Van Dam has been married to Sonia Delbeck, who was by his side for many years, traveling with him. This was until the couple decided to divorce after being together for 17 years. Despite citing irreconcilable differences, they have both said that they remain friends to this day.\n\nKimberly Kessler – Randy Orton Though Randy Orton might be one of the biggest and most recognizable names in all of wrestling, his wife, Kimberly Kessler, was merely a fan of the WWE superstar when the couple met back in 2014. As a huge fan of Orton, Kessler was absolutely smitten when he brought her to the WWE Hall Of Fame Induction. Her WWE fangirl dream came true when Orton popped the question in July 2015 and the two tied the knot in 2016.\n\nCaryl J. Peterson – The Iron Shiek The Iron Shiek was unique due to his unique identity. Although he was considered a heel by the fans due to his disdain for America and praise for Iran, the wrestler has remained a household name in the wrestling community since the 80s. In 1976, he married his wife, Caryl, with fellow wrestler Mean Gene Okerlund acting as his best man. His later years have been overshadowed by substance abuse, but Caryl has been by his side through thick and thin.\n\nBeth Britt – Jeff Hardy Best known for his antics with tables, ladders, and chairs, Jeff Hardy made a name for himself as one half the Hardy Boyz, with his brother, Matt. Master of the Swanton Bomb, Hardy has also had a pretty successful solo career. On one fateful night out in a club, he met the love of his life, Beth Britt. The pair hit it off and have been together ever since. They have had two children together, Ruby Claire and Nera Quinn Hardy.\n\nTracy James – Road Dogg There is no denying that Road Dogg is best known for his tag team efforts with Billy Gunn as The New Age Outlawz. These were the tag team representatives of infamous D-Generation X, which also included Sean Michaels, Triple H, X-Pac and the late Chyna. Road Dogg was something of a tag team expert, winning the title five times. He is happily married to wife Tracy, who he has had three kids with. Brian Girard James is a happy man.\n\nJess Watson – Xavier Woods Even since making his WWE debut 2010, Xavier Woods has been quietly making a name for himself even since moving from Total Nonstop Wrestling. After years of hard work, the wrestler is now a member of the New Day, which also consists of Kofi Kingston and Big E. The man from Georgia is still considered an up and coming wrestler, but Jess Watson gave him a new lease of life and together, they had a baby boy in 2017.\n\nJana Perry – Mark Henry It is quite incredible how long Mark Henry has been in the WWE. Starting off with the organization when it was still known as the WWF, Henry has been one of the heavyweights of its rings for the good part of 30 years. Sparring with the likes of Val Venus and The Undertaker, Mark Henry is still a mainstay on the roster, despite all the younger talent. He is happily married to Jana Perry and had two kids with her.\n\nMaria Kanellis – Mike Bennett As a highly charismatic WWE Diva, Maria Kanellis has moved on from major wrestling organizations, finding a home for herself within the independent wrestling industry. Kanellis now spends most of her time managing her husband, wrestler Mike Bennet. While Bennet may be one of the least recognizable names on our list, having never appeared on a major wrestling network, there is no telling what the future holds for the up and coming wrestler, especially with his leading lady by his side calling the shots.\n\nAbigail Rodriguez – Kalisto It’s safe to say that Kalisto has become the heir apparent to Rey Mysterio’s WWE luchador status. The high-flyer, who was born Emanuel Alejandro Rodriguez, is hellbent on not living in the shadows of his predecessor and wants to make a name for himself. Another luchador, Sin Cara, has formed a strong Tag Team partnership with Kalisto and the duo have even won the NXT Tag Team Championship. Since hitting the big time, Kalisto has tied the knot with Abigail Rodriguez.\n\nPamela Killings – R-Truth Many forget that Ronnie Killings, better known these days as R-Truth has had an on-and-off presence in the WWE since the Attitude era. One of his most notable achievements came when he won the Tag Team championship with Road Dogg, of all people. With other appearances in federations such as TNA, R-Truth has been something of a mainstay in the WWE since his return in 2008. In 2011, Killings married his wife Pamela and had a daughter with her in 2014.\n\nColette Christie – Mick Foley The man of many faces, Mick Foley has rarely just been himself during his impressive WWE career. Most of the time, he has either been Dude Love, Cactus Jack, or psychopathic mandible claw feeding Mankind. Despite fluctuating from one character to another, Foley has had to be himself more since marrying Colette Christie back in the 90s. Not only did Foley hit the jackpot with Colette, but they also had three sons and a daughter together.\n\nPaula Sopp – Billy Gunn The second half of the New Age Outlawz, Billy Gunn is one of the least memorable but most experienced wrestlers to have been a part of Degeneration X. Winning King of the Ring in 1999 must’ve been his biggest wrestling achievement. This was eventually followed by true love in 2009 when Gunn married his girlfriend, Paula. Gunn’s wife actually lifted some eyebrows when she took shots at the WWE, saying, “acknowledging someone after they’ve passed away doesn’t make up for how [bad] you were to them while they were alive!” she said.\n\nJennifer Hudson – David Otunga This is a fine example of a wrestler’s partner who is most certainly more famous than the wrestler. Jennifer Hudson has come on in leaps and bounds since her time on American Idol. Despite having her fair share of tragedy with her family, Hudson has managed to find some luck in her love life, meeting wrestler David Otunga. Although the couple have since had a kid and even got engaged at one point, they officially separated in 2017.\n\nNikki Bella – John Cena John Cena got together with Total Divas star Nikki Bella in 2012. Although they’ve dealt with some drama over the past few years, they weathered the storm and are now stronger than ever and even got engaged when Cena popped the question at WrestleMania 33.\n\nCrystal Jacobs – Kane It was an amazing moment when Kane burst onto the scene at WWE’s Bad Blood event in 1997. In the first Hell in a Cell match, Glen Jacobs entered the ring, initiated the pyrotechnics and gave the tombstone piledriver to his in-ring brother, The Undertaker. Despite the black and red mask, Jacobs is actually a really nice guy and has been happily married for over two decades to Crystal Jacobs. The couple had two kids and even founded an insurance company.\n\nSable – Brock Lesnar As one of the original WWE Divas, Sable is an incredibly skilled wrestler in her own right. Having played a significant role during The Attitude Era, Sable decided that only a WWE superstar was worthy of her hand in marriage. She found that in Brock Lesnar, who just happens to be ten years her junior. The couple got married back in 2006 and now share two sons, Turk and Duke. Sable is now 50 years old and as stunning as ever!\n\nBess Katramados – Big Show The Big Show may be a 7-foot-tall modern day equivalent of Andre The Giant, but don’t be fooled. His wife, Bess Katramados definitely wears the pants in their relationship. What she says goes and Big Show is perfectly fine with that. The larger-than-life couple got married on February 11, 2002 and now have two children together. Bess is now enjoying some much-needed family time with her husband and children in following the retirement of her main man in February 2018.\n\nKarina Steen – Kevin Owens On May 18, 2015, NXT champion Kevin Owens delivered a Powerbomb that shook the wrestling world, slamming the legendary John Cena into the canvas like a rag doll. As Cena lied lifeless on the mat, Owens stomped on the WWE superstar’s belt, delivering the message that he’s not going anywhere. While this was definitely a defining moment in the career of Owens, it hails in comparison to the day he met his beautiful wife, Karina Steen, with whom he now shares two children.\n\nNattie Neidhart – Tyson Kidd Nattie Neidhart and Tyson Kiss have had their fair share of drama since getting together way back in 2001. Nattie “Natalya” Neidhart made her mark on the reality show, Total Divas, by providing the show with endless juicy material due to her turbulent personal life. While their relationship certainly hasn’t been a walk in the park, Neidhart and Kidd have always been there for each other, proving that, with a bit of work, true love can withstand anything and everything.\n\nBeth Phoenix – Edge Former WWE Diva Beth Phoenix started dating Adam Copeland, aka Edge, in December 2013. The incredibly strong and beautiful Phoenix was one of the most popular and well-known female wrestlers when she was in her prime, winning a WWE Divas Championship, three WWE Women’s Championships, and becoming the youngest person to ever be inducted into the WWE Hall of Fame. Since starting their romance, Phoenix and Edge have had two daughters together and married in 2016, on Edge’s 43rd birthday.\n\nSarah Jade – Dave Bautista It has been a long time now since Dave Bautista has graced the WWE ring. Performing under the ring name Batista, he has won many heavyweight titles and competed against the likes of The Rock and John Cena. However, Bautista has since developed a name for himself in Hollywood, playing Drax the Destroyer in Guardians of the Galaxy. He eventually tied the knot with Sarah Jade in 2015, and since then, the pole dancer has always been by Dave’s side.\n\nThe Inspiring Partners Behind Your Favorite Athletes Behind every strong athlete is an even stronger woman. While the athletes on our list may get all the glory, little credit is given to the wives and girlfriends that support them day in and day out. Ciara – Wife Of Russell Wilson Ciara became famous in 2003, after dropping her first album titled, Goodies. Ciara was previously engaged to rapper Future and gave birth to a son with him in 2014 before the two called the wedding off. She began dating Seattle Seahawks quarterback Russell Wilson in 2015 and was engaged to the NFL star by March 2016. The two got married in July of that same year at Peckforton Castle in Cheshire, England and had their first child together in April of 2017.\n\nKristin Cavallari – Wife Of Jay Cutler Kristen Cavallari started her career in television and film with a role in the 2004 MTV reality show, Laguna Beach as well as the 2009 spinoff, The Hills. Cavallari began dating NFL quarterback Jay Cutler in late 2010 and the couple got engaged the following April. Three months later, the wedding was called off but the couple reconciled in November 201l. Cavallari and Cutler married in June 2013 and went on to have three kids together, sons Camden and Jaxon, and daughter Saylor.\n\nCarrie Underwood – Wife Of Mike Fisher Country artist, Carrie Underwood, first met NHL player, Mike Fisher, at a backstage meet-and-greet after being set up by her bassist. With Underwood based in Nashville, and Fisher living in Canada, the couple began talking, despite the distance, until New Years Eve 2008, when the couple shared their first kiss. Fisher popped the question in December 2009 and the couple got married in 2010. In 2011, Fisher joined the Nashville Predators, allowing the couple to finally live in the same state. Their first child, Isaiah, was born in 2015.\n\nKate Upton – Wife Of Justin Verlander Model and actress Kate Upton first met professional baseball player Justin Verlander during a commercial shoot for the video game MLB 2K12. According to rumors, Upton began dating Verlander as early as summer 2012. The couple then briefly split in early 2013 and Upton dated Maksim Chmerkovskiy for a few months, before returning to Verlander for good. Verlander reportedly proposed numerous times before finally getting a “yes” in 2016. In 2017, the couple married in a medieval church in Tuscany, Italy.\n\nJaime Edmonson – Wife Of Evan Longoria Florida native Jaime Edmonson is the wife of MLB star Evan Longoria. Edmonson grew up in a family of police officers and would go on to fill these shoes as well, earning a degree in Criminal Justice from Florida Atlantic University in 2002. Edmonson spent two years working as a night shift police officer in Boca Raton before quitting to become a Miami Dolphins cheerleader. Edmonson has also competed in The Amazing Race 14 and was the Playmate of the Month in January 2010.\n\nSofia Balbi – Wife Of Luis Suarez Sometimes a loyal and supportive partner can make all the difference. Before Barcelona striker Luis Suarez married Sofia Balbi, he was just a kid with incredible talent and a controversial history of bad behavior. Suarez met Sofia when he was just 15 and she was 13. Sofia helped Suarez sort his life out and realize what was most important to him. With her support, Suarez went on to become one of the all-time-greats. The couple married in 2009 and now have a daughter and son together.\n\nCandace Romo – Wife Of Tony Romo Before the former Miss Missouri and Miss USA contestant took the famous Dallas Cowboys quarterback’s name, she was a reporter and anchor, covering local high school sports in Dallas, Texas. Candace Crawford began dating Tony Romo in 2009 and became engaged on her 24th birthday in 2011. Following her engagement, Crawford left her reporting job and became Candace Romo when the couple married during the 2011 NFL lockout. The couple are now proud parents of two children, Hawkins and Rivers.\n\nAnna Burns – Wife Of Wes Welker Former model and 2005 winner of Miss Hooters, Anna Burns was rumored to have met Wes Welker around 2010, while the former wide receiver was playing for the New England Patriots. Welker and Burns were engaged by January 2012 and married later that year. In 2013, following the Patriots’ AFC championship loss to the Baltimore Ravens, Burns attempted to stand up for her man and took her frustrations out on Ray Lewis via Twitter, calling the hall-of-fame linebacker out for his highly-publicized personal problems.\n\nJelena Djokavic – Wife Of Novac Djokavic Jelena Ristic first met the now world-renown Serbian tennis player, Novak Djokovic, when she was in high school. The young couple began dating in 2005 until Novak popped the question in September 2013. In July of 2014, the childhood sweethearts got married while Jelena was still pregnant with their first child. Jelena decided to take her husbands last name and now goes by Jelena Djokovic. Their son Stefan was born the following October followed by the birth of daughter Tara in September of 2017.\n\nDee Devlin – Girlfriend Of Connor McGregor As the 9-year girlfriend of UFC fighter Connor McGregor, Dee Devlin takes pride knowing she has been there since day one, before fame, money, and UFC titles. Conor certainly appreciates her steadfast support as well and has expressed his gratitude in countless ways, whether via social media posts, shopping sprees. Today, Devlin and McGregor work together both in business and life. Devlin manages McGregor’s finances, McGregor fights in the octagon, and the two have been raising Conor Jr. together since May 2017.\n\nNicole Johnson – Wife Of Michael Phelps Before she was Nicole Phelps, the former Miss California USA went by Nicole Johnson. Johnson first met Olympic swimmer Michael Phelps at the ESPY Awards in 2007 and the two started dating in 2009. With pressure on Phelps to repeat his legendary performance in the 2008 Olympics, the couple split up just prior to the 2012 Olympic games but reunited in 2014. They got engaged in 2015 and had their first son, Boomer Robert Phelps, in 2016. A month later, the couple wed in a private ceremony.\n\nSamantha Ponder – Wife Of Christian Ponder Samantha Ponder was born in Phoenix Arizona. While enrolled in The King’s College in New York City, Samantha was introduced to the world of sports broadcasting by ABC Sports Radio manager Ben Keeperman. She landed an internship with ABC and her career took off from there. After transferring, she finished up college at Liberty University and began working for Fox Sports but moved to ESPN after two years. Samantha married Vikings quarterback Christian Ponder in 2012 and they now share two kids.\n\nJessie James – Wife Of Eric Decker Jessie James hit it big as a singer when she released her first self-titled album in 2009. Before she married wide reciever Eric Decker, James was said to have been romantically involved with Reggie Bush. She married Decker in 2013 and the couple starred in their own reality TV show on the E! network called Eric & Jessie: Game On, which lasted for three seasons. The couple now have a son and daughter together and are expecting another son in March of 2018.\n\nKim DeJesus – Wife Of David DeJesus Born and raised in Wheaton, Illinois, Kim DeJesus is married to recently retired professional baseball outfielder David DeJesus. As a model, actress and former contestant on season 3 of The Amazing Race, Kim DeJesus can do it all. She even received the prestigious Kartherine K. Herberger painting scholarship to study painting and drawing at Arizona State University and continued her education with a post-graduate degree in Art Education. As far as acting goes, she’s appeared in Sullivan and Sons, and HERlarious.\n\nLilit Avagyan – Wife Of Reggie Bush World-renown dancer Lilit Avagyan is married to the retired NFL runningback and former Heisman trophy winner Reggie Bush. Avagyan and Bush share three children together- Briseis Avagyan Bush, Uriah Bush, and Agyemang Bush. Before she met Bush, Avagyan studied dance in Europe for over twelve years. She even took home the gold in the 2010 Rising Star Dance Competition in Florida and has appeared on Dancing With The Stars as the Latin American World Championships for dance in Australia back in 2013.\n\nLarisa Fraser – Wife Of Ryan Braun Larisa Fraser is married to Milwaukee Brewers left fielder Ryan Braun. In her own right, Fraser is an accomplished lingerie and fashion model. She also runs her own health-food blog called Model Eats. Braun found himself on the wrong side of a scandal back in 2013 when he came forward and confessed to the use of performance-enhancing drugs. Through all of the turmoil involved with Braun’s tarnished reputation, Larisa Fraser has stood by him and will continue to do so long into the future.\n\nTiffany Price – Wife Of David Price Tiffany Price tied the knot with Boston Red Sox pitcher David Price in 2016 and the couple welcomed their first son, Xavier into the world in 2017. Tiffany Price is a graduate of Kansas State University who is not afraid to speak her mind. Back in 2013, long before Price moved to the Red Sox, she published some aggressive tweets targeting the Boston organization along with their fans. Today, with Price wearing the Red Sox uniform, it seems that all has been forgiven.\n\nGeorgina Rodriguez – Girlfriend Of Christiano Ronaldo Georgina Rodriguez is a 22-year-old model from Spain. She met Real Madrid star, Christiano Ronaldo while working at a Gucci store in Madrid when Ronaldo spotted her from the VIP area of a Dolce & Gabbana event. The two were first spotted dating towards the end of 2016. Rodriguez gave birth the the couple’s first daughter, Alana Martina, on November 12, 2017. In addition, Rodrigues is believed to have an active role in raising Ronaldo’s son, Cristiano Jr and his two surrogate twins, Eva and Mateo.\n\nAntonella Roccuzzo – Wife Of Lionel Messi Antonella Roccuzzo, an Argentinian model, first met Lionel Messi when she was just five years old. Messi was a childhood friend of Roccuzzo’s cousin, and would frequently find an excuse to visit his childhood crush. After knowing each other for almost their whole lives, the couple went public with their relationship in 2008 and married 8 years later in an elaborate and secretive ceremony in Argentina. Roccuzzo and Messi are currently happily married with 2 sons and one more on the way.\n\nGisele Bundchen – Wife Of Tom Brady Brazilian supermodel Gisele Bundchen has been the wife of New England Patriots Quarterback Tom Brady since 2009. The couple met through a mutual friend in 2006 and it was love at first sight. Through all of the marital ups and downs, Bundchen has remained loyal to her man, even after discovering that Brady’s ex was pregnant with his son just 2 months after the couple got together. Today the couple have two children together and live happily in their $10 million home in Brookline, Massachusetts.\n\nElise Tate – Wife Of Golden Tate Golden Tate, NFL wide receiver for the Detroit Lions, got married to Elise Pollard in 2017. Elise Pollard, now known as Elise Tate, is a director of business development at Harvey Nash. Elise received a degree in Marketing and Sales from the University of Washington, where she participated in intramural soccer, softball, golf, and tennis. The Tates tied the knot on a private beach in Cabo San Lucas in front of 250 guests. Elise is also a strong advocate for pet adoption.\n\nErica Herman – Girlfriend OF Tiger Woods 15-time Major Champion Tiger Woods recently won the 2019 Masters at Augusta National, and his biggest fan and girlfriend, Erica Herman, was there to cheer him on and celebrate his win. The two have now been dating for over a year. Herman is the manager at one of the restaurants Woods own in Florida and is about 10 years his junior. The couple went public with their relationship in November 2017. So far, things seem to be going well, so hopefully, his days of cheating and scandal won’t repeat themselves in this relationship.\n\nLarsa Pippen – Wife Of Scottie Pippen The legendary Chicago Bulls star Scottie Pippen is married to Larsa Pippen, who starred on The Real Housewives of Miami. Larsa and Scottie share four children together- Sophia Pippen, Justin Pippen, Preston Pippen, and Scottie Pippen Jr. Back in 2016, after 19 years of marriage, Scottie’s marriage to Larisa was reportedly on rocky terms and the former Bull filed for divorce. Luckily, in 2017, Scottie and Larisa were able to settle their differences and the $120 million divorce was called off.\n\nKelly Hall – Wife Of Matthew Stafford As the former highest paid player in NFL history, Detroit Lions quarterback Matthew Stafford would probably be one of the world’s most eligible bachelor’s if it wasn’t for blonde beauty Kelly Hall, who intercepted his heart when the two attended college together at the University of Georgia. At the time, Hall was a cheerleader and Stafford was the quarterback. They were truly a perfect match made in heaven. The couple tied the knot in 2015 and haven’t looked back since!\n\nNessa Diab – Wife of Colin Kaepernick Nessa Diab, known to most as simply, Nessa, is a radio and TV personality and television host. In July 2015, she began dating the then quarterback of the San Fransisco 49ers, Colin Kaepernick. Following Kaepernicks famous National Anthem protest and subsequent release from the 49ers organization, a tweet from Nessa comparing Ray Lewis and Baltimore Ravens owner Steve Bisciotti to characters played by Samuel L. Jackson and Leonardo DiCaprio in the film Django Unchained, allegedly lost Kaepernick a chance to play for the Ravens.\n\nKia Proctor – Girlfriend Of Cam Newton Kia Proctor was first seen with Carolina Panthers quarterback Cam Newton in 2013 when the two were spotted together on the red carpet at the Kentucky Derby. Proctor has a daughter from a previous relationship in addition to a 1-year-old son with Newton. While Newton has always remained quiet when asked about his love life, he began speaking publicly and sharing personal details following the birth of his first son with Proctor, including an open letter to Chosen published on theplayerstribune.com.\n\nBruna Marquezine – Girlfriend Of Neymar Jr. Brazilian actress and model Bruna Marquezine in the on-and-off girlfriend of professional soccer player, Neymar Jr. The couple began dating after being introduced to one another at a carnival celebration in Rio de Janeiro in 2012. Since getting together 6 years ago, Marquezuine and Neymar have split up on several occasions but have always managed to reunite. They first split up in 2014 but rekindled in 2016. In June 2017 Neymar announced that they once again separated, only to reunite once more on New Years Eve.\n\nLauren Tannehill – Wife Of Ryan Tannehill Lauren Tannehill met her husband Ryan Tannehill in 2009 while on spring break in Panama City Florida. At the time, the two were both students at Texas A&M. The Miami Dolphins quarterback married Lauren Tannehill in January 2012 and the couple had their first child in 2016. Lauren is possibly most famous for a 2014 incident where she accidentally forgot to remove her legally-owned weapon from the back seat of a rental car before returning the car to E-Z Rent-A-Car.\n\nBrooklyn Decker – Wife Of Andy Roddick Brooklyn Decker is a model, well-known for her work in the Sports Illustrated Swimsuit Issue, as well as numerous television and film appearances. Decker began dating professional U.S. tennis player Andy Roddick in 2007 and Roddick proposed in 2008. The couple married on April 17, 2009 and moved to Austin, Texas, where they began raising their first child, Hank in 2015. With another child on the way as of July 2017, the future is looking bright for this young couple!\n\nKatherine Webb – Wife Of AJ McCarron Model, beauty queen, television personality and wife of Cincinnati Bengals quarterback AJ McCarron, Katherine Webb is most well-known for her unintentional appearance during the 2013 BCS National Championship Game broadcast. The then girlfriend of the Alabama quarterback McCarron was watching the game when the camera focused on her, prompting announcer Brent Musburger to comment on Webb’s appearance, stating, “You quarterbacks get all the good-looking women.” Musburger’s statements were widely covered by the media and the footage of Webb went viral almost immediately.\n\nVanessa Bryant – Wife of Kobe Bryant To say that basketball great Kobe Bryant and his wife Vanessa have been through hell and back would be the understatement of the century. They met back in 1999 and have been in an on-and-off relationship ever since. Just six months after meeting, the couple got engaged and married a year later. However, their relationship has been plagued by misfortunes and the couple were on the brink of divorce. Nevertheless, they are still together and had a third child in 2016.\n\nAbbey Clancy – Wife of Peter Crouch One of the most popular figures in British football, robot dancer Peter Crouch, hasn’t had a very successful career. However, he did hit the jackpot when he met Abbey Clancy. He has played for many clubs, but “Crouchy” has only had one woman on his mind, and that is the Britain’s Next Top Model runner-up. They met back in 2009 and have been together ever since. Crouch and Clancy tied the knot in 2011 and have had three kids together.\n\nAna Ivanovic – Wife of Bastian Schweinsteiger Ana Ivanovic is a fine example of an athlete’s wife who is just as a famous as her spouse. While she has been a huge figure in the world of women’s tennis in recent times, husband Bastian Schweinsteiger has also had a considerable amount of success. In 2014, he helped Germany lift the World Cup. He also had a fruitful career at Bayern Munich. They have been married since 2016 and have since had a child by the name of Luka.\n\nKim Sears – Wife of Andy Murray After struggling during the early stages of his career, British tennis player Andy Murray has finally become one of the consistently great tennis players of his generation. During that time, one person who seems to have always been by his side is Kim Sears, the daughter of player/coach Nigel Sears. After getting engaged at the end of November, the couple tied the knot in Dunblane Cathedral, Scotland. The couple now live in Oxshott, Surrey with two kids.\n\nAyesha Curry – Wife Of Stephen Curry Ayesha Curry met Stephen Curry, when they were teenagers at church youth group in Charlotte. While the future NBA player was initially turned down, Ayesha eventually said yes to a date and the couple, now married with two daughters, have been inseparable ever since.\n\nLeila Lopes – Wife Of Osi Umenyiora As an Angolan actress, TV host, model, and beauty queen who has won Miss Angola UK 2010, Miss Angola 2010, and Miss Universe 2011, Leila Lopes boasts a pretty impressive resume. It’s no wonder she attracted the likes of Osi Umeniora. Lopes was introduced to the now-retired New York Giants defensive end by publicist BJ Coleman in 2012 during fashion week. Umenyiora popped the question just one year later and the couple tied the knot on May 29, 2015 in Luanda, Angola.\n\nHannah Jeter – Wife Of Derek Jeter Hannah Jeter, born Hannah Davis, is a model from the Virgin Islands. An athlete herself, Hannah grew up playing tennis. She played on the Caribbean Tennis Circuit and was even a champion on the Caribbean National team. She began dating the now-retired Yankee, Derek Jeter, in 2012. The couple got engaged in November 2015 and married in July of 2016, just a couple years following Jeter’s retirement. As of August 17, 2017, the couple are proud parents of daughter, Bella Raine Jeter.\n\nVictoria Beckham – Wife Of David Beckham Victoria Beckham, aka Posh Spice, rose to international fame withthe Spice Girls. In 1997, she started dating soccer star, David Beckham, and they married in 1999. They have three sons Brooklyn Joseph, Romeo James, and Cruz David, and daughter, Harper Seven.\n\nSavannah Brinson – Wife Of Lebron James After having met at a football game, Savannah Brinson went on her first date to Outback Steakhouse with the now famous basketball player, Lebron James, when the two were attending rival high schools. Brinson actually had no idea of James’ incredible talent as an athlete until after she accepted his invitation to a basketball game. James proposed on New Years Eve 2011 and the couple married in San Diego two years later. Today they are still going strong with three children of their own.\n\nGabrielle Union – Wife Of Dwayne Wade Gabrielle Union, an actress famous for her breakthrough roll in the 2000 comedy, Bring It On, has been known to date professional athletes. In high school, she dated Jason Kidd long before his NBA career took off. Union was also married to NFL player Chris Howard for four years before separating in 2005 and divorcing in 2006. Union met Dwayne Wade in 2009, briefly split in 2013 due to career demands, but returned to one another and tied the knot in 2014.\n\nErica Stoll – Wife of Rory McIlroy For a while, it was tennis player Caroline Wozniacki who stole the heart of World Golf number one Rory McIlroy. The couple were together for three years before finally breaking up. However, McIlroy seems to have found “the one” in the form of Erica Stoll, who originally worked for PGA of America. They have been together since 2015, got engaged during a trip to Paris, and in April 2017, they tied the knot in Ashford Castle, County Mayo.\n\nXisca Perello – Girlfriend of Rafael Nadal Although they haven’t been the most public of couples over the years, tennis player Rafael Nadal and Xisca Perello have been attached at the hip for a long time; since 2005, actually. However, they had known each other for while before that. Not only is she an insurance worker, but Xisca also runs the RafaNadal Foundation. Despite not releasing any plans yet to get engaged or tie the knot, many have speculated that it is just a matter of time.\n\nPaulina Gretzky – Fiancee Of Dustin Johnson As the oldest daughter of NHL legend Wayne Gretzky, Paulina Gretzky is no stranger to the spotlight that comes along with having ties to big-time athletes. Paulina Gretzky has been engaged to PGA tour golfer Dustin Johnson since 2013 and the couple share two sons, Tatum Gretzky Johnson, and River Jones Johnson. Johnson and Gretzky had only been dating for seven months before getting engaged but have evidently been taking their time since, with no clear date set for the wedding.\n\nDanica Patrick And Aaron Rodgers Danica Patrick was reported to have split from fellow NASCAR driver Ricky Stenhouse Jr. in December of 2017. A month later, Patrick announced that she is now in a relationship with Aaron Rodgers, who split from Olivia Munn in November of 2017. Danica and Aaron first met at the 2012 ESPY Awards but the two remained distant friends, catching up annually at the awards show, until recently when, according to Patrick, the couple “realized how similar we were and… got the ball rolling.”\n\nLaticia Rolle – Fiance of Shaquille O’Neal Laticia Rolle graduated from Eckerd College in 2010, where she played on the women’s basketball team. She currently runs her own lifestyle blog, Bluhazl.com, along with her sister D’Ana. She began dating former NBA player, Shaquille O’Neal in 2014. In March 2016, engagement rumors surfaced following a strange exchange of Instagram comments, including Shaq reportedly popping the question, which were later reported to be a joke between the couple. In October 2017, engagement rumors yet again emerged after another Instagram post showing a ring on Rolle’s finger.\n\nYvette Prieto – Wife Of Michael Jordan Yvette Prieto is a Cuban model born in 1979. Before meeting Michael Jordan, Prieto dated Julio Iglesias Jr., older brother of famous hispanic singer/songwriter, Enrique Iglesias. Prieto met Michael Jordan at a dancing club in 2008. The couple got engaged in 2011 and married in April 2013. Musicians Usher and Robin Thicke performed at the Palm Beach wedding reception. Yvette is a stepmother to Jordan’s 3 children from his previous marriage to Juanita Vanoy, and gave birth to twin daughters in February 2014.", "images": ["https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01141603/wrestler-rewrite-dave-bautista.jpg", "https://d3m2ca683sarz5.cloudfront.net/wp-content/uploads/2018/01/25152156/athlete-wives-aj-mccarron.jpg", "https://d3m2ca683sarz5.cloudfront.net/wp-content/uploads/2018/01/28124920/athlete-wives-bruna-marquezi.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01140656/wrestler-rewrite-rey-mysterio.png", "https://d3m2ca683sarz5.cloudfront.net/wp-content/uploads/2018/01/28142532/athlete-wives-sofia-balbi.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/27140043/Screen-Shot-2018-02-27-at-15.59.36.png", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01141322/wrestler-rewrite-r-truth.jpg", "https://d3m2ca683sarz5.cloudfront.net/wp-content/uploads/2018/01/28105442/athlete-wives-hannah-jeter.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/12090021/ap-the-58th-annual-grammy-awards-arrivals.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01134739/wrestler-rewrite-daniel-bryan.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01135927/wrestler-rewrite-johnny-gargano.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/12090810/article-urn_publicid_ap.org_c4cfc067455a473384bab4196806c02c-6NK99dagb-HSK1-737_634x516-e1518426588857.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/12090202/20130722_jla_bm1_048.0.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/12091322/DBgC4P8VoAARhx5-e1518426831416.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/12090926/Savannah-Brinson-LeBron-James.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01140739/wrestler-rewrite-rob-van-dam.jpg", "https://d3m2ca683sarz5.cloudfront.net/wp-content/uploads/2018/01/28112946/athlete-wives-antonella-roccuzzo.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01135005/wrestler-rewrite-roman-reigns.jpg", "https://d3m2ca683sarz5.cloudfront.net/wp-content/uploads/2018/01/28142037/athlete-wives-nicole-johnson.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/12090349/121911welkerce001.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01134634/wrester-rewrite-bray-wyatt.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01141054/wrestler-rewrite-xavier-woods.png", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01141634/wrestler-rewrite-kane.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01140505/wrestler-rewrite-kevin-nash.jpg", "http://trc.taboola.com/1021215/log/3/unip?en=page_view", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01134218/wrester-rewrite-bo-dallas.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01134041/wrester-rewrite-rusev.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01133629/wrestler-rewrite-matt-hardy.png", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/05/16122244/wives-4.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01140824/wrester-rewrite-the-iron-shiek.jpg", "https://d3m2ca683sarz5.cloudfront.net/wp-content/uploads/2018/01/28124946/athlete-wives-shakira.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/05/16122242/wives-5-e1526473560433.jpg", "https://d3m2ca683sarz5.cloudfront.net/wp-content/uploads/2018/01/25145843/athlete-wives-colin-kaepernick.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01140912/wrestler-rewrite-jeff-hardy.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/12090550/Screen-Shot-2018-02-12-at-11.05.25-AM.png", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01131616/wrestler-rewrite-randy-orton.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01135804/wrestler-rewrite-AJ-styles.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01134300/wrester-rewrite-john-layfield.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01135718/wrestler-rewrite-brock-lesner.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01134843/wrester-rewrite-jack-swagger.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01141148/wrestler-rewrite-mark-henry.png", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01134555/wrestler-rewrite-booker-t.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01131419/wrester-rewrite-john-cena.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/05/16130123/wives-8.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01132839/wrestler-rewrite-shane-mcmahon.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01131826/wrestler-rewrite-brandi-rhodes.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01141525/wrestler-rewrite-david-otunga.jpg", "https://d3m2ca683sarz5.cloudfront.net/wp-content/uploads/2018/01/28130117/athlete-wives-kate-upton.jpg", "https://d3m2ca683sarz5.cloudfront.net/wp-content/uploads/2018/01/28134445/athlete-wives-kia-proctor.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/05/16122250/wives-1-e1526473514854.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2023/04/27141655/logo_v2_bs.png", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/27134951/athlete-wives-reggie-bush-2.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01135310/wrestler-rewrite-the-rock.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01133019/wrestler-rewrite-mike-bennet.jpg", "https://d3m2ca683sarz5.cloudfront.net/wp-content/uploads/2018/01/28140513/athlete-wives-jelena-djokovic.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01133830/wrester-rewrite-charlie-haas.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01134518/wrestler-rewrite-kofi-kingston.jpeg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/27143504/scottie-pippen-larsa-pippen-2.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01135451/wrestler-rewrite-chris-jericho.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01140406/wrestler-rewrite-heath-slater.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/27133048/athlete-wives-kim-dejesus.jpg", "https://d3m2ca683sarz5.cloudfront.net/wp-content/uploads/2018/01/28111420/athlete-wives-victoria-bekham.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01135046/wrestler-rewrite-bill-goldberg.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01141237/wrestler-rewrite-kalisto.jpg", "https://d3m2ca683sarz5.cloudfront.net/wp-content/uploads/2018/01/28102605/athlete-wives-gabrielle-union.jpg", "https://d3m2ca683sarz5.cloudfront.net/wp-content/uploads/2018/01/28103431/athlete-wives-kristen-cabilleri.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/27133513/athlete-wives-jaime-edmonson-e1519738545294.jpeg", "https://d3m2ca683sarz5.cloudfront.net/wp-content/uploads/2018/01/28103054/athlete-wives-brooklyn-decker.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/27124514/athlete-wives-samantha-ponder.jpg", "https://d3m2ca683sarz5.cloudfront.net/wp-content/uploads/2018/01/28125333/athlete-wives-paulina-gretzky.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01134348/wrestler-rewrite-jeff-jarrett.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01140155/wrestler-rewrite-bret-hart.jpeg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01134920/wrester-rewrite-kurt-angle.jpg", "https://d3m2ca683sarz5.cloudfront.net/wp-content/uploads/2018/01/29141700/athlete-wives-romo.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2023/04/27141745/logo_footer_bs.png", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01135842/wrestler-rewrite-christian-cage.jpg", "https://d3m2ca683sarz5.cloudfront.net/wp-content/uploads/2018/01/28141252/althlete-wives-aesha-curry-e1517238450584.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/05/16122248/wives-2.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/27140815/athlete-wives-golden-tate.jpg", "https://d3m2ca683sarz5.cloudfront.net/wp-content/uploads/2018/01/25143935/athlete-wives-shaq.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01133441/wrestler-rewrite-edge.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01133749/wrester-rewrite-jerry-lawlor1.jpg", "https://d3m2ca683sarz5.cloudfront.net/wp-content/uploads/2018/01/25145023/danica-patrick-aaron-rodgers.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01133538/wrester-rewrite-big-show.jpg", "https://d3m2ca683sarz5.cloudfront.net/wp-content/uploads/2018/01/25151720/athlete-wives-tom-brady-gisele.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01133910/wrestler-rewrite-jimmy-uso.jpg", "https://d3m2ca683sarz5.cloudfront.net/wp-content/uploads/2018/01/28141530/athlete-wives-dee-devlin.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01135204/wrestler-rewrite-alberto-del-rio.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01135630/wrestler-rewrite-the-undertaker.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01141004/wrestler-rewrite-road-dogg.jpeg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01132800/wrestler-rewrite-stone-cold-steve-austin.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01132931/wrestler-rewrite-kevin-owens.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01133110/wrestler-rewrite-tyson-kidd.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/05083035/wrestler-rewrite-featured-new.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/05/16122240/wives-6.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/27142040/athlete-wives-matthew-stafford-wife.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01135405/wrestler-rewrite-triple-h.jpg", "https://d3m2ca683sarz5.cloudfront.net/wp-content/uploads/2018/01/28104345/athete-wives-carrie-underwood.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01140607/wrestler-rewrite-sting.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01133957/wrestler-rewrite-zack-ryder.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01141400/wrestler-rewrite-mick-foley.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/27135548/athlete-wives-larisa-fraser-e1519809105582.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/27130156/athlete-wives-jesse-james.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01131738/wrestler-rewrite-sean-michaels.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01131520/wrester-rewrite-aj-lee.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01140058/wrester-rewrite-sarath-ton.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/11/20134112/NINTCHDBPICT0004364910681-e1537873666162.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01134438/wrestler-rewrite-dean-ambrose.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01141441/wrestler-rewrite-billy-gunn.jpg", "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/01132717/wrester-rewrite-the-miz.jpg"], "top_img": "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/05083035/wrestler-rewrite-featured-new.jpg", "keywords": [], "authors": ["David Whittaker"], "canonical_link": "https://www.brain-sharper.com/entertainment/wwe-wives-yh/", "title": "The Women Behind The Wrestlers: Meet The WWE Wives", "meta_data": {"viewport": "width=device-width, initial-scale=1", "website_version": "1.2.0", "og": {"locale": "en_US", "type": "article", "title": "The Women Behind The Wrestlers: Meet The WWE Wives", "description": "Professional wrestlers are known for their strength, fearlessness, and ego. These days, it seems that every great wrestler has a beautiful woman supporting them whether they win or lose. Here are some of our favorite wives in the wrestling world. Stephanie McMahon – Triple H What initially began as a scripted relationship blossomed into something …", "url": "https://www.brain-sharper.com/entertainment/wwe-wives-yh/", "site_name": "BrainSharper", "updated_time": "2018-04-23T10:12:14+00:00", "image": {"identifier": "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/05083035/wrestler-rewrite-featured-new.jpg", "width": 1024, "height": 628}}, "article": {"section": "Entertainment", "published_time": "2020-02-28T03:12:29+00:00", "modified_time": "2018-04-23T10:12:14+00:00"}, "twitter": {"card": "summary", "description": "Professional wrestlers are known for their strength, fearlessness, and ego. These days, it seems that every great wrestler has a beautiful woman supporting them whether they win or lose. Here are some of our favorite wives in the wrestling world. Stephanie McMahon – Triple H What initially began as a scripted relationship blossomed into something […]", "title": "The Women Behind The Wrestlers: Meet The WWE Wives", "image": "https://d1hg6wdwbisxfa.cloudfront.net/wp-content/uploads/2018/02/05083035/wrestler-rewrite-featured-new.jpg"}, "generator": "WordPress 5.3.2"}, "movies": [], "publish_date": 1582859549.0, "source": "http://www.brain-sharper.com", "summary": ""}