{"url": "https://www.grammy.com/grammys/news/shakira-wins-best-latin-pop-album-2018-grammys", "text": "The Latin Recording Academy has announced the complete list of nominees for the 2023 Latin GRAMMYs, and the race for Song Of The Year is on. The prestigious Category features this year’s most-nominated artist, Mexican American songwriter and producer Edgar Barrera, who earned an impressive 13 nods. It also includes three Colombian singers who have collaborated with Barrera — Karol G, Camilo, Shakira — the latter of whom set a record as the first artist to have three entries in Latin GRAMMYs' Song Of The Year Category. The 2023 Latin GRAMMYs show will also make history, as the Thursday, Nov. 16, ceremony will be the first-ever international telecast in the history of the organization and awards, broadcasting from the Conference and Exhibition Centre (FIBES) in Sevilla, Spain. Read on to learn more about the 10 bops nominated for Song Of The Year, and the artists and songwriters that penned them. (All lyrics noted below are translated from Spanish.) Read More: 2023 Latin GRAMMYs: See The Complete Nominations List \"Acróstico\" — Kevyn Mauricio Cruz Moreno, L.E.X.U.Z, Luis Fernando Ochoa & Shakira, songwriters (Shakira)\n\n\"Acróstico,\" the third lead single from Shakira's upcoming 12th studio album, is a heartfelt love letter to her young sons Milan and Sasha, in the wake of her split from their father Gerard Piqué. The tear-jerking ballad features her sons' vocals. The track's Spanish title translates to acrostic, which is a poem where the first letter of each line spells out a word — and in Shakira's song, the opening lyrics spell out Milan. \"This year Milan has written songs that have made me tear up, and Sasha has dedicated hours playing the piano and discovering his voice. Both have spent some time with me in the studio, and upon hearing this song, they've asked to be part of it,\" she wrote in Spanish in an Instagram post about the song. Shakira co-wrote the song with a powerhouse team of Colombian gold:Keityn and L.e.x.u.z, of La Crème collective, and longtime collaborator Luis Fernando Ochoa, who first linked with Shakira back in 1995 on Pies Descalzos. (Keityn, born Kevyn Mauricio Cruz Moreno, also worked on two of Shakira's other big 2023 hits and Song Of The Year contenders: the record-breaking \"Shakira: Bzrp Music Sessions, Vol. 53\" with Bizarrap and \"TQG\" with Karol G.) \"Amigos\" – Pablo Alborán & María Becerra, songwriters (Pablo Alborán Featuring María Becerra)\n\nSpanish singer/songwriter Pablo Alborán linked up with Argentian reggaetónera María Becerra on \"Amigos,\" a platonic love song to the friend that always has your back — and makes life a party. They wrote the sweet, vibey song together for his late-2022 album, La cuarto hoja. \"Amigos\" opens with a chilled guitar instrumental, building up to an anthemic shout-it-with-your-bestie chorus: \"I can see life in color/ the whole neighborhood looks at us/ We drink the hours as if it were liquor.\" \"De Todas Las Flores\" – Natalia Lafourcade, songwriter (Natalia Lafourcade)\n\nOn \"De Todas Las Flores,\" the title track of Natalia Lafourcade's first album of all original music in seven years, she beautifully paints the picture of a lost love. \"Of all the flowers we plant/ There are only a few left/ Every morning they wonder/ When you will arrive to sing to them,\" she sings over sparse, tenderly melancholic instrumentation. The backing vocals offer ethereal ooohs and ahhhs, like the fading memories shared with the lover no longer there. The Latin GRAMMY- and GRAMMY-winning Mexican singer/songwriter has always been a compelling storyteller, and it's a joy to hear her rich voice share new sonic poems on the project she's called an \"extremely personal musical diary.\" \"Ella Baila Sola\" – Pedro Julian Tovar Oceguera, songwriter (Eslabon Armado, Peso Pluma)\n\n\"Ella Baila Sola\" (or, she dances alone) was written by 20-year-old Pedro Tovar, lead singer of Mexican regional band Eslabon Armado. It's about two friends noticing a pretty girl at a party, and one of them winning her affection. The song features rapidly rising Mexican singer/rapper Peso Pluma, who is bringing Mexican corridos worldwide, fused with reggaetón and Latin trap. The dynamo pairing has helped \"Ella Baila Sola\" have a massive, record-breaking run; after it went viral on TikTok, it became the first regional Mexican song to reach the Top 10 on the Billboard Hot 100 (reaching No. 4) and the first performed on late-night TV. It was also the most-streamed song globally on Spotify this summer, and second-most streamed song in the U.S. \"NASA\" – Édgar Barrera, Camilo & Alejandro Sanz, songwriters (Camilo & Alejandro Sanz)\n\nOn \"NASA,\" Latin GRAMMY-winning Colombian singer/songwriter Camilo teams up with Latin GRAMMY- and GRAMMY-winning Spanish star Alejandro Sanz to ask his lover for forgiveness for what he admits is unwarranted jealousy. \"I know/ That NASA has cameras rotating in space/ They spend day and night looking up and down/ And I'm about to call and ask for a job/ To see if I relax.\" It's a tender, vulnerable love song with playful lyrics exchanged back-and-forth by the two Spanish-language crooners, who also co-wrote the song together. \"Ojos Marrones\" – Luis Jiménez, Lasso & Agustín Zubillaga, songwriters (Lasso)\n\n\"It's the first time/ I invited someone/ Since you left/ And I'm fine,\" Lasso opens on \"Ojos Marrones,\" before revealing he's only kinda sorta fine. \"Nothing is the same / Nothing is the same/ Nothing/ without your brown eyes,\" Lasso repeats empathetically in the chorus. It's a sunset-hued pop rock heater with dreamy guitar licks reminiscent of those in Chris Issak's classic \"Wicked Game.\" The Venezuelan singer/songwriter paired up Luis Jiménez and Agustín Zubillaga to pen the impactful track about trying — and failing — to get over an ex with a new lover, which is featured on his latest album, Eva. The track went viral on TikTok after a user compared its narrative to Justin Bieber's relationships, and its success spawned a remix with Sebastian Yatra. \"Shakira: Bzrp Music Sessions, Vol. 53\" – Santiago Alvarado, Bizarrap, Kevyn Mauricio Cruz & Shakira, songwriters (Bizarrap Featuring Shakira)\n\nIt's an understatement to say that Shakira has had a momentous year. As she went through a very public separation — and tabloids across the globe zeroed in on her every move and social media post — she proved yet again she's a global pop superstar at the top of her game. She started the year off with the viral \"Shakira: Bzrp Music Sessions, Vol. 53,\" a sassy, synth-pop clap back at her ex. In just 24 hours, it garnered over 15 million streams on Spotify to top the platform's Top 50 global list, and the video saw over 55 million views on YouTube, the record for a Spanish-language track. On it, she asserts herself and reclaims her power — who needs trashy gossip rags when Shakira is here to tell it like it is? \"A she-wolf like me/ isn't for guys like you,\" the Colombian queen declares. \"I was out of your league/ That's why you're/ With someone just like you,\" also coming for her ex's new girlfriend (the Casio he traded in for a Rolex, as Shaki put it). The fiery diss track came out of a session with forever-sunglassed Argentinan DJ and producer Bizarrap. They co-wrote the song with Keityn and Santiago Alvarado. \"Si Tú Me Quieres\" – Fonseca, Yadam González & Yoel Henríquez, songwriters (Fonseca & Juan Luis Guerra)\n\nIt was a dream of Latin GRAMMY-winning Colombian singer/songwriter Fonseca to collab with Latin GRAMMY- and GRAMMY-winning Dominican superstar Juan Luis Guerra. \"Si Tú Me Quieres\" is a sweet tropical pop love song, a gorgeous result of Fonseca's dream brought to life. It was co-produced by Colombian pop/rock king Juanes, and was co-written by Fonseca with two Latin GRAMMY-winning songwriter/producers: Puerto Rican Yoel Henríquez and Cuban Yadam González. When Fonseca finished the initial demo, he imagined Luis Guerra's distinctive voice on it, who quickly agreed to join in on it. They bring their voices, styles and homelands together for a joyful fiesta, with delightful touches of Colombian vallenato and Dominican bachata. \"Tqg\" – Kevyn Mauricio Cruz, Karol G, Ovy On The Drums & Shakira, songwriters (Karol G Featuring Shakira)\n\nShakira and Keityn strike again — this time alongside Colombian reggaetónera Karol G, and her regular collaborator Ovy On The Drums. On \"TQG,\" Karol G and Shakira link up for the first time and come for their exes, reminding them who's on top. \"You left and I went triple 'M'/ Much hotter, much tougher, much more class,\" Shakira sings defiantly. \"TQG\" stands for te quedó grande, which roughly means too much for you to handle, and is featured on Karol's fourth album, MAÑANA SERÁ BONITO. When Karol saw the gossip fodder about Shakira, she knew she was the perfect collaborator to add fire to the reggaetón diss track,which she wrote with Keityn and Ovy during the same session of \"Mamiii,\" her collab with Becky G. \"Un X100to\" – Bad Bunny, Édgar Barrera, Marco Daniel Borrero & Andrés Jael Correa Ríos, songwriters (Grupo Frontera Featuring Bad Bunny)", "images": ["https://i8.amplience.net/i/naras/HHM_Hero_1644x925.jpg?w=821&sm=c", "https://naras.a.bigcontent.io/v1/static/2023-new-members-class-recording-academy-announcement-Invitation-Email-header-1200-690", "https://naras.a.bigcontent.io/v1/static/youtube-icon", "https://i8.amplience.net/i/naras/2023-latin-grammys-sevilla-spain-key-art-rectangle.jpg?w=821&sm=c", "https://naras.a.bigcontent.io/v1/static/facebook-icon", "https://naras.a.bigcontent.io/v1/static/instagram-icon", "https://i8.amplience.net/i/naras/show_categoryarticles_bestlatinpopalbum.jpg", "https://naras.a.bigcontent.io/v1/static/2024-grammys-new-categories-announced-hero-image", "https://naras.a.bigcontent.io/v1/static/Banner-Pop_1500x1000", "https://naras.a.bigcontent.io/v1/static/2024-grammys-new-categories-announced-hero-purple", "https://i8.amplience.net/i/naras/show_categoryarticles_bestlatinpopalbum.jpg.jpg?w=821&sm=c", "https://naras.a.bigcontent.io/v1/static/search", "https://cdn.media.amplience.net/i/naras/ra_ga_logo.webp?w=175", "https://naras.a.bigcontent.io/v1/static/twitter-icon", "https://i8.amplience.net/i/naras/HH50_GR_Kendrick_Hero_1920x1080.jpg?w=821&sm=c", "https://cdn.media.amplience.net/i/naras/RA_Logo_black", "https://naras.a.bigcontent.io/v1/static/connected"], "top_img": "https://i8.amplience.net/i/naras/show_categoryarticles_bestlatinpopalbum.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.grammy.com/news/shakira-wins-best-latin-pop-album-2018-grammys", "title": "Shakira Wins Best Latin Pop Album", "meta_data": {"viewport": "width=device-width", "google-site-verification": "mjYJq7vX2IJfypeIqe00aJUZ98j7fzgMwjkIC_eBGto", "robots": "index,follow", "googlebot": "index,follow", "description": "As the world&#039;s leading society of music professionals, the Recording Academy is dedicated to celebrating, honoring, and sustaining music&#039;s past, present, and future.", "og": {"title": "Shakira Wins Best Latin Pop Album | 2018 GRAMMYs | GRAMMY.com", "description": "As the world&#039;s leading society of music professionals, the Recording Academy is dedicated to celebrating, honoring, and sustaining music&#039;s past, present, and future.", "url": "https://www.grammy.com/news/shakira-wins-best-latin-pop-album-2018-grammys", "type": "article", "image": {"identifier": "https://i8.amplience.net/i/naras/show_categoryarticles_bestlatinpopalbum.jpg", "alt": "GRAMMY.com", "width": 1200, "height": 630}}, "keywords": "GRAMMY, GRAMMY.COM, Shakira Wins Best Latin Pop Album | 2018 GRAMMYs | GRAMMY.com", "twitter": {"url": "https://www.grammy.com/news/shakira-wins-best-latin-pop-album-2018-grammys", "title": "Shakira Wins Best Latin Pop Album | 2018 GRAMMYs | GRAMMY.com", "description": "As the world&#039;s leading society of music professionals, the Recording Academy is dedicated to celebrating, honoring, and sustaining music&#039;s past, present, and future.", "image": "https://i8.amplience.net/i/naras/show_categoryarticles_bestlatinpopalbum.jpg", "site": {"id": 17243213}}, "bingbot": "index,follow", "next-head-count": 29}, "movies": [], "publish_date": null, "source": "https://www.grammy.com", "summary": ""}