{"url": "https://www.grammy.com/grammys/news/2018-latin-grammy-awards-complete-winners-list", "text": "Ilsey is cruising down the path to self-discovery. For the past decade, the Los Angeles-born songwriter had a major presence behind the scenes, penning hits for the likes of Beyoncé and Shawn Mendes. Now, she's the one on the mic, ready to share her journey. From The Valley details the emotional weight of a crumbling relationship and finding the courage to build yourself back up. Lead single \"No California\" pays homage to the breezy Laurel Canyon rockers Ilsey grew up listening to, the folk-inspired \"On Wrong Side\" with Justin Vernon has poetic layers of interpretation, and the somber \"Overcome\" mourns a failed love. \"The [album] title was very specific with the double meaning. It's this emotional valley, but then I'm also from the actual valley in LA. This album is almost a road trip of self-discovery, where you have to leave where you are to figure out who you are. And then you end up exactly where it's supposed to be — you end up home,\" Ilsey explains. \"That's been my process of moving through heartache and figuring out who I am as a person. You have to have these valleys in your life. Without them, there's no way to appreciate the peaks.\" Born Ilsey Juber, the singer grew up in a musical family in Los Angeles, where her father Laurence Juber (who also plays on this album) was the lead guitarist for Paul McCartney and Wings. \"My dad was playing guitar in the room when my mom was giving birth to me,\" Ilsey recalls with a chuckle.\n\nThe singer's parents introduced her to the Beatles, the Eagles, Fleetwood Mac, Joni Mitchell, Jackson Browne and Motown. She began playing the drums at age 11 — she credits that to her Hanson obsession — and began writing songs on her acoustic guitar at 15. Around 2012, Ilsey \"tripped and fell\" into songwriting professionally after signing a Sony publishing deal with her then-band. When the band broke up, she went to the publisher for advice on next steps. \"They set up a couple of sessions for me with some producers. I went in there thinking it was going to be for me. Then all of a sudden, I got this call: 'Rihanna has one of your songs on hold,'\" Ilsey recalls. \"I'm a big believer that when something is working, you can't really ignore that. It seemed really obvious that that was the path to take at that moment.\" While Rihanna didn't end up using the song, it was the gateway for Ilsey to kickstart her songwriting journey; some of her most notable credits include Miley Cyrus' \"Midnight Sky,\" Panic! at the Disco's \"High Hopes,\" Camila Cabello's \"She Loves Control,\" Christina Aguilera's \"Accelerate,\" and Beyoncé's \"All Night.\" Even as From The Valley came together, Ilsey continued working with stars, including Lil Nas X, Kacey Musgraves, The 1975 and 6lack — but her debut album is her biggest dream come true yet. Ahead of her album release, Ilsey spoke to GRAMMY.com about creating From The Valley, taking a chance on her artistry and the stories behind some of her biggest co-written hits. When did the first thought of making your own album spark? I met BJ Burton, who is the producer of the album. He was introduced to me through Mark Ronson, who I loved and have collaborated with for a long time. He had worked on a Miley [Cyrus] song that Miley and I had written, and had done some production on it. It turned out that he was moving to LA the next week. So he said, \"We should get together and try some stuff.\" I had been waiting to find the right collaborators and the people who could realize the sound that was inside of me. That was BJ. So we wrote a couple more songs, and then eventually I let him in on the fact that we were making [an album]. That was really the moment where it was like, \"Oh, this is the thing that I've been looking for.\" What was your process of shaping your own musical identity like? All the songs were written for the album, with the exception of one [her cover of Neil Young's \"Heart of Gold\"]. But it was really a matter of wanting to intentionally do something that is me, and for myself. Whereas, when I'm writing songs with other people, I'm there to serve the artist. I'm there to help them realize what it is that they're trying to say. With this, I had this very clear intention of writing the songs for myself. I'm gonna have the freedom to say what I want to say. It was pretty easy to separate the two, because I knew that I wanted this album to really express who I was.\n\nWhat was that feeling like, emotionally? I think there's a certain amount of hiding that you're able to do as a songwriter for other people. The vulnerability of stepping out in front and being the person who's actually singing the songs was definitely scary for me because I think we all have struggled with identity. That's one of the reasons I'm so grateful this is happening now and not when I was younger — I had to build that confidence over time to really feel like I deserve to be in front, and that people would actually want to hear my voice. So there was a lot of vulnerability in it, but also a lot of excitement because I've dreamt of doing this my whole life. I'm glad you mentioned that because as we get older, we learn more about ourselves. I think if you released it when you were in your mid or early 20s, maybe you would still have some questions as to who you are and what you want to express musically. But now that you've had all this experience with songwriting, you have more of a fully realized vision of what you wanted to do. Absolutely. The growth I have had as a songwriter and working with all these amazing people I learned so much from has really helped me to be a more fully realized version of a songwriter. Having all this experience is like training. I'm writing the songs I really want to write and I'm able to sing them in the way I want to sing them because I know my voice better now. It's all the things that lead you to become the most authentic version of yourself. That's the beauty of music. I read that you also went to Minnesota and Wisconsin to record the album. Did you record the bulk of it there? It was half and half because it was during the pandemic. So we had to find these windows where the world was a little more open. It actually ended up being really cool that we could put it down for a second, and then come back to it and have a whole different perspective on it. But we did a bunch in LA, and then more during the pandemic.\n\nDid that change of scenery inspire some of the music as well? Yeah, just working with Justin Vernon [of Bon Iver] and being at his place out in Wisconsin, which is gorgeous. It's almost farmland and gives you perspective on where you're from, too. So much of this album is about California. When you leave California, you have a different view of it. So that helped as well. But also musically, it's why I like coming to Nashville, London and all these places. You have a different energy, you're in touch with the place that you're in, and it leads you to other places that you wouldn't normally go to. I would love to know your experience working with Justin and BJ because I think it's important for artists to challenge each other. You all could push each other's limits in a positive way. With BJ, we definitely challenge each other. He'll push back sometimes even when it makes me uncomfortable, in the sense that I'm pretty sure I know exactly what I want. But he's like, \"Well, what if we did it like this?\" You're right, it's so important to have those people who are going to get you moving forward because you'd have to be uncomfortable in order to make anything great. BJ tends to be a lot more like that. And when Justin and I write together, there's something really magical that happens that I've never really experienced on this level where we almost tap into the same creative energy or channel. We're able to freestyle and make it super open and easy and then we'll sort of interpret what the other person is doing through our own mind. There's something very special about working with him. I think probably a lot of people will say that. Also, our voices together felt so natural and comfortable. That helped too because when you're able to sing the idea, you really hear it for what it is. Let's get into some of the music. When I was listening to \"On Wrong Side\" with Justin Vernon, it took me to another realm. There's so many layers of interpretation. It's so funny because as time goes on, I find those other layers too. So it sort of morphs and becomes a different thing for me. It was the first song we ever did together and it was the thing that established our creative relationship. We wrote it within 20 minutes of meeting each other and the song only took about 20 minutes to write. At first, it felt like when you're on the wrong side of a heartbreak, you're able to look at the situation and then you see the other person is being on the wrong side. It's that process of trying to figure out if there is anyone to blame in this or not. But as time went on, I started looking at it as it's also about being on the wrong side of history and being the person who's wrong in a situation. So it became a lot of different things for me, but that's the beauty of music too. Even with my own songs, the meaning can change over time. It's really up to interpretation.\n\nMy favorite is \"Yellow Roses.\" This song is so poetic, just discussing that yearning for love that doesn't necessarily want you and hiding from the truth of what's actually going on. This was a really central one for me on the album because it got to the heart of what the heartbreak was for me. Every rose has a different meaning and yellow is the color of friendship. When I discovered that I was like, \"This is the perfect metaphor.\" When you fall in love with somebody that's not able to give you the thing that you're looking for, or you fall in love with the idea of somebody, there's so much heartache in that. Then you also have to face the fact that you're going to the wrong place for it. That one was the most painful to write because it really showed me why I was heartbroken and showed me where that came from. I think everybody experiences that feeling at some point. \"No California\" reminds me of '70s-era Stevie Nicks. You're riding in your car with your hair blowing in the wind, wanting to ultimately run away from whatever issues are at home. Again, it's going back to that theme of self-discovery. I think you hit the nail on the head. When you're going through something, everything around you reminds you of that person or that thing. So you want to run away. But that really comes back to the central theme of the album: wherever you go, there you are. Because you change the location or because you change the circumstances, you're still going to have to go through the thing that you're going through. \"Heart of Gold\" is the sole cover on the album. How did you initially discover the song? That's a really good question. I can't remember the first time I heard it, because I've loved it for so long. But probably in high school at some point. It became this sort of touchstone that I kept coming back to when I was making this album. I went out to Wisconsin one time and I threw the idea out there to do a cover of it. I expected people to be like, \"Yeah, I don't know about that.\" But everyone wanted to do it. So it came together really easily and naturally. I really wanted to do a different take on the song. Because I think it's important if you do a cover to make it your own. I think it turned out pretty cool.", "images": ["https://i8.amplience.net/i/naras/2023-latin-grammys-sevilla-spain-key-art-rectangle.jpg?w=821&sm=c", "https://naras.a.bigcontent.io/v1/static/2023-new-members-class-recording-academy-announcement-Invitation-Email-header-1200-690", "https://naras.a.bigcontent.io/v1/static/youtube-icon", "https://i8.amplience.net/i/naras/gettyimages-1062036782.jpg", "https://naras.a.bigcontent.io/v1/static/facebook-icon", "https://naras.a.bigcontent.io/v1/static/instagram-icon", "https://i8.amplience.net/i/naras/2023-latin-grammys-nominations-livestream-YouTube_Event.jpg?w=821&sm=c", "https://naras.a.bigcontent.io/v1/static/2024-grammys-new-categories-announced-hero-image", "https://i8.amplience.net/i/naras/Ilsey_Press_Photo_2023_Caity_Krone.jpg?w=821&sm=c", "https://naras.a.bigcontent.io/v1/static/Banner-Pop_1500x1000", "https://naras.a.bigcontent.io/v1/static/2024-grammys-new-categories-announced-hero-purple", "https://naras.a.bigcontent.io/v1/static/search", "https://cdn.media.amplience.net/i/naras/ra_ga_logo.webp?w=175", "https://naras.a.bigcontent.io/v1/static/twitter-icon", "https://i8.amplience.net/i/naras/HH50_GR_Kendrick_Hero_1920x1080.jpg?w=821&sm=c", "https://cdn.media.amplience.net/i/naras/RA_Logo_black", "https://naras.a.bigcontent.io/v1/static/connected", "https://i8.amplience.net/i/naras/gettyimages-1062036782.jpg.jpg?w=821&sm=c"], "top_img": "https://i8.amplience.net/i/naras/gettyimages-1062036782.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.grammy.com/news/2018-latin-grammy-awards-complete-winners-list", "title": "2018 Latin GRAMMY Awards Complete Winners List", "meta_data": {"viewport": "width=device-width", "google-site-verification": "mjYJq7vX2IJfypeIqe00aJUZ98j7fzgMwjkIC_eBGto", "robots": "index,follow", "googlebot": "index,follow", "description": "As the world&#039;s leading society of music professionals, the Recording Academy is dedicated to celebrating, honoring, and sustaining music&#039;s past, present, and future.", "og": {"title": "2018 Latin GRAMMY Awards Complete Winners List | GRAMMY.com", "description": "As the world&#039;s leading society of music professionals, the Recording Academy is dedicated to celebrating, honoring, and sustaining music&#039;s past, present, and future.", "url": "https://www.grammy.com/news/2018-latin-grammy-awards-complete-winners-list", "type": "article", "image": {"identifier": "https://i8.amplience.net/i/naras/gettyimages-1062036782.jpg", "alt": "GRAMMY.com", "width": 1200, "height": 630}}, "keywords": "GRAMMY, GRAMMY.COM, 2018 Latin GRAMMY Awards Complete Winners List | GRAMMY.com", "twitter": {"url": "https://www.grammy.com/news/2018-latin-grammy-awards-complete-winners-list", "title": "2018 Latin GRAMMY Awards Complete Winners List | GRAMMY.com", "description": "As the world&#039;s leading society of music professionals, the Recording Academy is dedicated to celebrating, honoring, and sustaining music&#039;s past, present, and future.", "image": "https://i8.amplience.net/i/naras/gettyimages-1062036782.jpg", "site": {"id": 17243213}}, "bingbot": "index,follow", "next-head-count": 29}, "movies": [], "publish_date": null, "source": "https://www.grammy.com", "summary": ""}