{"url": "https://web.archive.org/web/20180225231831/https://www.vanityfair.com/news/2018/02/monica-lewinsky-in-the-age-of-metoo", "text": "How do I know him? Where have I seen him? The Man in the Hat looked familiar, I thought, as I peered over at him a second time. It was Christmas Eve 2017. My family and I were about to be seated at a quaint restaurant in Manhattan’s West Village. We had just come from Gramercy Park—on the one night each year when the exclusive park (accessible only to nearby residents with special keys) opens its gates to outsiders. There had been carols. People had sung with abandon. In short, it was a magical night. I was happy. Amid the glow of candles and soft lighting, I strained to look again at the Man in the Hat. He was part of a small group that had just exited the main dining room. They were now gathering their belongings, likely vacating what was to be our table. And then it clicked. He looks just like . . . no, couldn’t be. Could it? A student of Karma, I found myself seizing the moment. Whereas a decade ago I would have turned and fled the restaurant at the prospect of being in the same place as this man, many years of personal-counseling work (both trauma-specific and spiritual) had led me to a place where I now embrace opportunities to move into spaces that allow me to break out of old patterns of retreat or denial. At the same moment I stepped toward the Man in the Hat and began to ask, “You’re not . . . ?,” he stepped toward me with a warm, incongruous smile and said, “Let me introduce myself. I’m Ken Starr.” An introduction was indeed necessary. This was, in fact, the first time I had met him. I found myself shaking his hand even as I struggled to decipher the warmth he evinced. After all, in 1998, this was the independent prosecutor who had investigated me, a former White House intern; the man whose staff, accompanied by a group of F.B.I. agents (Starr himself was not there), had hustled me into a hotel room near the Pentagon and informed me that unless I cooperated with them I could face 27 years in prison. This was the man who had turned my 24-year-old life into a living hell in his effort to investigate and prosecute President Bill Clinton on charges that would eventually include obstruction of justice and lying under oath—lying about having maintained a long-term extramarital relationship with me. Ken Starr asked me several times if I was “doing O.K.” A stranger might have surmised from his tone that he had actually worried about me over the years. His demeanor, almost pastoral, was somewhere between avuncular and creepy. He kept touching my arm and elbow, which made me uncomfortable. I turned and introduced him to my family. Bizarre as it may sound, I felt determined, then and there, to remind him that, 20 years before, he and his team of prosecutors hadn’t hounded and terrorized just me but also my family—threatening to prosecute my mom (if she didn’t disclose the private confidences I had shared with her), hinting that they would investigate my dad’s medical practice, and even deposing my aunt, with whom I was eating dinner that night. And all because the Man in the Hat, standing in front of me, had decided that a frightened young woman could be useful in his larger case against the president of the United States. Understandably, I was a bit thrown. (It was also confusing for me to see “Ken Starr” as a human being. He was there, after all, with what appeared to be his family.) I finally gathered my wits about me—after an internal command of Get it together. “Though I wish I had made different choices back then,” I stammered, “I wish that you and your office had made different choices, too.” In hindsight, I later realized, I was paving the way for him to apologize. But he didn’t. He merely said, with the same inscrutable smile, “I know. It was unfortunate.” It had been nearly 20 years since 1998. The next month would mark the 20th anniversary of the Starr investigation expanding to include me. The 20th anniversary of my name becoming public for the first time. And the 20th anniversary of an annus horribilis that would almost end Clinton’s presidency, consume the nation’s attention, and alter the course of my life. By Jeffrey Markowitz/Sygma/Getty Images.\n\nIf I have learned anything since then, it is that you cannot run away from who you are or from how you’ve been shaped by your experiences. Instead, you must integrate your past and pres­ent. As Salman Rushdie observed after the fatwa was issued against him, “Those who do not have power over the story that dominates their lives, power to retell it, rethink it, deconstruct it, joke about it, and change it as times change, truly are powerless, because they cannot think new thoughts.” I have been working toward this realization for years. I have been trying to find that power—a particularly Sisyphean task for a person who has been gaslighted. To be blunt, I was diagnosed several years ago with post-traumatic stress disorder, mainly from the ordeal of having been publicly outed and ostracized back then. My trauma expedition has been long, arduous, painful, and expensive. And it’s not over. (I like to joke that my tombstone will read, MUTATIS MUTANDIS—“With Changes Being Made.”) I’ve lived for so long in the House of Gaslight, clinging to my experiences as they unfolded in my 20s. But as I find myself reflecting on what happened, I’ve also come to understand how my trauma has been, in a way, a microcosm of a larger, national one. Both clinically and observationally, something fundamental changed in our society in 1998, and it is changing again as we enter the second year of the Trump presidency in a post-Cosby-Ailes-O’Reilly-Weinstein-Spacey-Whoever-Is-Next world. The Starr investigation and the subsequent impeachment trial of Bill Clinton amounted to a crisis that Americans arguably endured collectively—some of us, obviously, more than others. It was a shambolic morass of a scandal that dragged on for 13 months, and many politicians and citizens became collateral damage—along with the nation’s capacity for mercy, measure, and perspective. Certainly, the events of that year did not constitute a war or a terrorist attack or a financial recession. They didn’t constitute a natural catastrophe or a medical pandemic or what experts refer to as “Big T” traumas. But something had shifted nonetheless. And even after the Senate voted in 1999 to acquit President Clinton on two articles of impeachment, we could not escape the sense of upheaval and partisan division that lingered, settled in, and stayed. Maybe you remember or have heard stories about how “the scandal” saturated television and radio; newspapers, magazines, and the Internet; Saturday Night Live and the Sunday-morning opinion programs; dinner-party conversation and watercooler discussions; late-night monologues and political talk shows (definitely the talk shows). In The Washington Post alone, there were 125 articles written about this crisis—in just the first 10 days. Many parents felt compelled to discuss sexual issues with their children earlier than they might have wanted to. They had to explain why “lying”—even if the president did it—was not acceptable behavior. The press was navigating unexplored terrain, too. Anonymous sources seemed to emerge almost daily with new (and often false or meaningless) revelations. There was a new commingling of traditional news, talk radio, tabloid television, and online rumor mills (fake news, anyone?). With the introduction of the World Wide Web (in 1992-93) and two new cable news networks (Fox News and MSNBC in 1996), the lines began to blur between fact and opinion, news and gossip, private lives and public shaming. The Internet had become such a propulsive force driving the flow of information that when the Republican-led Judiciary Committee of the House of Representatives decided to publish Ken Starr’s commission’s “findings” online—just two days after he had delivered them—it meant that (for me personally) every adult with a modem could instantaneously peruse a copy and learn about my private conversations, my personal musings (lifted from my home computer), and, worse yet, my sex life. Americans young and old, red and blue, watched day and night. We watched a beleaguered president and the embattled and often disenchanted members of his administration as they protected him. We watched a First Lady and First Daughter move through the year with grit and grace. We watched a special prosecutor get pilloried (though some thought he deserved it). We watched an American family—my family—as a mother was forced to testify against her child and as a father was forced to take his daughter to be fingerprinted at the Federal Building. We watched the wholesale dissection of a young, unknown woman—me—who, due to legal quarantine, was unable to speak out on her own behalf. How, then, to get a handle, today, on what exactly happened back then?\n\nOne useful viewpoint is that of cognitive linguist George Lakoff. In his book Moral Politics: What Conservatives Know That Liberals Don’t, Lakoff observes that the connective fiber of our country is often best represented through the metaphor of family: e.g., “our Founding Fathers,” “Uncle Sam,” the concept of sending our sons and daughters to war. Lakoff goes on to argue that, “for conservatives, the nation is conceptualized (implicitly and unconsciously) as a Strict Father family and, for liberals, as a Nurturant Parent family.” Addressing the scandal itself, he asserts that Clinton was widely perceived as “the naughty child” and that, in line with the filial metaphor, “a family matter [had turned] into an affair of state.” Thus, in many ways, the crack in the foundation of the presidency was also a crack in our foundation at home. Moreover, the nature of the violation—an extramarital relationship—struck at the heart of one of humanity’s most complicated moral issues: infidelity. (You’ll forgive me if I leave that topic right there.) The result, I believe, was that in 1998 the person to whom we would typically turn for reassurance and comfort during a national crisis was remote and unavailable. The country, at that stage, had no consistent, Rooseveltian voice of calm or reason or empathy to make sense of the chaos. Instead, our Nurturer in Chief, because of his own actions as much as the subterfuge of his enemies, was a figurative “absent father.” As a society, we went through this together. And ever since, the scandal has had an epigenetic quality, as if our cultural DNA has slowly been altered to ensure its longevity. If you can believe it, there has been at least one significant reference in the press to that unfortunate spell in our history every day for the past 20 years. Every. Single. Day. The fog of 1998 has lodged in our consciousness for many reasons. The Clintons have remained pivotal political figures on the global stage. Their disparagement has been vigorously abetted by “this vast right-wing conspiracy,” as Hil­la­ry Clinton famously put it. And the Clinton presidency segued into a bitter electoral deadlock: the contested Bush v. Gore showdown, which would usher in an era so turbulent that it would leave the lessons of the Clinton years altogether murky. In succession came the unthinkable (the attacks of September 11, 2001), protracted conflicts (the wars in Iraq and Afghanistan), the Great Recession, a state of perpetual gridlock in Washington, and then the daily bedlam central to Trumpism. No matter how these subsequent events dwarfed the impeachment and subsumed our attention, maybe, just maybe, the long, unimpeded derivation of this drama, ever since, is partly the result of 1998 having been a year of unremitting crisis that we all endured but never actually resolved—a low-grade collective trauma, perhaps? I discussed this idea with psychologist Jack Saul, founding director of New York’s International Trauma Studies Program and author of Collective Trauma, Collective Healing. “Collective trauma,” he told me, “usually refers to the shared injuries to a population’s social ecology due to a major catastrophe or chronic oppression, poverty, and disease. While the events of 1998 in the United States do not fit neatly into such a definition, they may have led to some of the features we often associate with collective traumas: social rupturing and a profound sense of distress, the challenging of long-held assumptions about the world and national identity, a constricted public narrative, and a process of scapegoating and dehumanization.” Until recently (thank you, Harvey Weinstein), historians hadn’t really had the perspective to fully process and acknowledge that year of shame and spectacle. And as a culture, we still haven’t properly examined it. Re-framed it. Integrated it. And transformed it. My hope, given the two dec­ades that have passed, is that we are now at a stage where we can untangle the complexities and context (maybe even with a little compassion), which might help lead to an eventual healing—and a systemic transformation. As Haruki Murakami has written, “When you come out of the storm you won’t be the same person who walked in. That’s what this storm’s all about.” Who were we then? Who are we now?\n\n‘I’m so sorry you were so alone.” Those seven words undid me. They were written in a recent private exchange I had with one of the brave women leading the #MeToo movement. Somehow, coming from her—a recognition of sorts on a deep, soulful level—they landed in a way that cracked me open and brought me to tears. Yes, I had received many letters of support in 1998. And, yes (thank God!), I had my family and friends to support me. But by and large I had been alone. So. Very. Alone. Publicly Alone—abandoned most of all by the key figure in the crisis, who actually knew me well and intimately. That I had made mistakes, on that we can all agree. But swimming in that sea of Aloneness was terrifying. Isolation is such a powerful tool to the subjugator. And yet I don’t believe I would have felt so isolated had it all happened today. One of the most inspiring aspects of this newly energized movement is the sheer number of women who have spoken up in support of one another. And the volume in numbers has translated into volume of public voice. Historically, he who shapes the story (and it is so often a he) creates “the truth.” But this collective rise in decibel level has provided a resonance for women’s narratives. If the Internet was a bête noire to me in 1998, its stepchild—social media—has been a savior for millions of women today (notwithstanding all the cyberbullying, online harassment, doxing, and slut-shaming). Virtually anyone can share her or his #MeToo story and be instantly welcomed into a tribe. In addition, the democratizing potential of the Internet to open up support networks and penetrate what used to be closed circles of power is something that was unavailable to me back then. Power, in that case, remained in the hands of the president and his minions, the Congress, the prosecutors, and the press. There are many more women and men whose voices and stories need to be heard before mine. (There are even some people who feel my White House experiences don’t have a place in this movement, as what transpired between Bill Clinton and myself was not sexual assault, although we now recognize that it constituted a gross abuse of power.) And yet, everywhere I have gone for the past few months, I’ve been asked about it. My response has been the same: I am in awe of the sheer courage of the women who have stood up and begun to confront entrenched beliefs and institutions. But as for me, my history, and how I fit in personally? I’m sorry to say I don’t have a definitive answer yet on the meaning of all of the events that led to the 1998 investigation; I am unpacking and reprocessing what happened to me. Over and over and over again. For two dec­ades, I have been working on myself, my trauma, and my healing. And, naturally, I have grappled with the rest of the world’s interpretations and Bill Clinton’s re-interpretations of what happened. But in truth, I have done this at arm’s length. There have been so many barriers to this place of self-reckoning. The reason this is difficult is that I’ve lived for such a long time in the House of Gaslight, clinging to my experiences as they unfolded in my 20s and railing against the untruths that painted me as an unstable stalker and Servicer in Chief. An inability to deviate from the internal script of what I actually experienced left little room for re-evaluation; I cleaved to what I “knew.” So often have I struggled with my own sense of agency versus victimhood. (In 1998, we were living in times in which women’s sexuality was a marker of their agency—“owning desire.” And yet, I felt that if I saw myself as in any way a victim, it would open the door to choruses of: “See, you did merely service him.”) What it means to confront a long-held belief (one clung to like a life raft in the middle of the ocean) is to challenge your own perceptions and allow the pentimento painting that is hidden beneath the surface to emerge and be seen in the light of a new day.", "images": ["https://web.archive.org/web/20180225231831im_/https://media.vanityfair.com/photos/5a64dc0bdd94fc12188412c4/master/h_590,c_limit/14-womens-march-dc-DSCF3541VF.jpg", "https://web.archive.org/web/20180225231831im_/https://media.vanityfair.com/photos/5a9038f3374b104fc48641b3/1:1/w_100,c_limit/cpac-on-the-ground-2018-ss11.jpg", "https://web.archive.org/web/20180225231831im_/https://media.vanityfair.com/photos/5a92eff1adad664a16b0fbf4/1:1/w_100,c_limit/russia-olympics-hack.png", "https://web.archive.org/web/20180225231831im_/https://media.vanityfair.com/photos/5a64dc2d7df577764ae9be9d/master/h_590,c_limit/16-womens-march-dc-DSCF3486VF.jpg", "https://web.archive.org/web/20180225231831im_/https://media.vanityfair.com/photos/5a64dc0bdd94fc12188412c4/master/w_768,c_limit/14-womens-march-dc-DSCF3541VF.jpg", "https://web.archive.org/web/20180225231831im_/https://media.vanityfair.com/photos/5a64db8c2d4c642bf63b3ba4/master/w_768,c_limit/02-womens-march-dc-DSCF3316VF.jpg", "https://web.archive.org/web/20180225231831im_/https://media.vanityfair.com/photos/5a64db94fee89c27f99f59cc/master/h_590,c_limit/04-womens-march-dc-DSCF0573VF.jpg", "https://web.archive.org/web/20180225231831im_/https://media.vanityfair.com/photos/5a64dbe8dd94fc12188412c2/master/w_768,c_limit/12-womens-march-dc-DSCF3662VF.jpg", "https://web.archive.org/web/20180225231831im_/https://media.vanityfair.com/photos/5a64dbe2fee89c27f99f59ce/master/w_768,c_limit/11-womens-march-dc-DSCF3566VF.jpg", "https://web.archive.org/web/20180225231831im_/https://media.vanityfair.com/photos/5a64dc0d47fd88021e400b76/master/w_768,c_limit/15-womens-march-dc-DSCF3649VF.jpg", "https://web.archive.org/web/20180225231831im_/https://media.vanityfair.com/photos/5a64db86522d2433237667c3/master/w_768,c_limit/05-womens-march-dc-DSCF0535VF.jpg", "https://web.archive.org/web/20180225231831im_/https://media.vanityfair.com/photos/5a64db5f522d2433237667c1/master/h_590,c_limit/03-womens-march-dc-DSCF3371VF.jpg", "https://web.archive.org/web/20180225231831im_/https://media.vanityfair.com/photos/5a8dcf3f9028ff3af11a186e/master/w_768,c_limit/monica-lewinsky-metoo-03-2018-lede.jpg", "https://web.archive.org/web/20180225231831im_/https://media.vanityfair.com/photos/5a64db8c2d4c642bf63b3ba4/master/h_590,c_limit/02-womens-march-dc-DSCF3316VF.jpg", "https://web.archive.org/web/20180225231831im_/https://media.vanityfair.com/photos/5a8dcfed3c0f45451fecd3a7/master/w_690,c_limit/monica-lewinsky-metoo-03-2018-embed.jpg", "https://web.archive.org/web/20180225231831im_/https://media.vanityfair.com/photos/5a64db687df577764ae9be9b/master/h_590,c_limit/01-womens-march-dc-DSCF3272VF.jpg", "https://web.archive.org/web/20180225231831im_/https://media.vanityfair.com/photos/5a64db687df577764ae9be9b/master/w_768,c_limit/01-womens-march-dc-DSCF3272VF.jpg", "https://web.archive.org/web/20180225231831im_/https://media.vanityfair.com/photos/59de6375730d2d7fb5b9ce60/1:1/w_100,c_limit/donald-trump-white-house.jpg", "https://web.archive.org/web/20180225231831im_/https://media.vanityfair.com/photos/5a64dc0d47fd88021e400b76/master/h_590,c_limit/15-womens-march-dc-DSCF3649VF.jpg", "https://web.archive.org/web/20180225231831im_/https://media.vanityfair.com/photos/5a64dc2d7df577764ae9be9d/master/w_768,c_limit/16-womens-march-dc-DSCF3486VF.jpg", "https://web.archive.org/web/20180225231831im_/https://www.vanityfair.com/images/hive/logo.svg", "https://web.archive.org/web/20180225231831im_/https://media.vanityfair.com/photos/5a64dba8ed2de06615787473/master/w_768,c_limit/06-womens-march-dc-DSCF0496VF.jpg", "https://web.archive.org/web/20180225231831im_/https://media.vanityfair.com/photos/5a64dbaf2d4c642bf63b3ba6/master/w_768,c_limit/07-womens-march-dc-DSCF3309VF.jpg", "https://web.archive.org/web/20180225231831im_/https://media.vanityfair.com/photos/5a64dc292d4c642bf63b3bac/master/w_768,c_limit/13-womens-march-dc-DSCF3559VF.jpg", "https://web.archive.org/web/20180225231831im_/https://media.vanityfair.com/photos/5a8321d5a5739251b7b27d75/1:1/w_100,c_limit/Kushner-666-Fifth.jpg", "https://web.archive.org/web/20180225231831im_/https://media.vanityfair.com/photos/5a64db94fee89c27f99f59cc/master/w_768,c_limit/04-womens-march-dc-DSCF0573VF.jpg", "https://web.archive.org/web/20180225231831im_/https://media.vanityfair.com/photos/5a8f7b633c0f45451fecd408/1:1/w_100,c_limit/ivanka-trump-olympics.jpg", "https://web.archive.org/web/20180225231831im_/https://media.vanityfair.com/photos/5a64dbde2d4c642bf63b3ba8/master/w_768,c_limit/08-womens-march-dc-DSCF0589VF.jpg", "https://web.archive.org/web/20180225231831im_/https://media.vanityfair.com/photos/5a8dcf3d1c6be356b8dcf6a6/16:9/w_1200,h_630,c_limit/t-monica-lewinsky-metoo-03-2018.jpg", "https://web.archive.org/web/20180225231831im_/https://media.vanityfair.com/photos/5a64dbd6fd00b20f6e7b6b8e/master/w_768,c_limit/10-womens-march-dc-DSCF3448VF.jpg", "https://web.archive.org/web/20180225231831im_/https://media.vanityfair.com/photos/5a64db5f522d2433237667c1/master/w_768,c_limit/03-womens-march-dc-DSCF3371VF.jpg", "https://web.archive.org/web/20180225231831im_/https://media.vanityfair.com/photos/5a64dbc18b23bb555ac62c65/master/w_768,c_limit/09-womens-march-dc-DSCF3439VF.jpg"], "top_img": "https://web.archive.org/web/20180225231831im_/https://media.vanityfair.com/photos/5a8dcf3d1c6be356b8dcf6a6/16:9/w_1200,h_630,c_limit/t-monica-lewinsky-metoo-03-2018.jpg", "keywords": [], "authors": ["Monica Lewinsky", "Vanity Fair", "Emma Stefansky"], "canonical_link": "https://web.archive.org/web/20180225231831/https://www.vanityfair.com/news/2018/02/monica-lewinsky-in-the-age-of-metoo", "title": "Monica Lewinsky: Emerging from “the House of Gaslight” in the Age of #MeToo", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=no,width=device-width,initial-scale=1,maximum-scale=1", "parsely-metadata": "{\"rubric\":\"From the Magazine\"}", "author": "Monica Lewinsky", "pubdate": "2018-02-25T05:00:00Z", "copyright": "Copyright (c) Condé Nast 2018", "description": "On the 20th anniversary of the Starr investigation, which introduced her to the world, the author reflects on the changing nature of trauma, the de-evolution of the media, and the extraordinary hope now provided by the #MeToo movement.", "keywords": "article,metoo,#metoo movement,monica lewinsky,Tf07941c5937b4170a152736c05d9ecb0,Tfccf81753def2294f6ca69cf405ec154", "fb": {"pages": 8810407571, "app_id": 1770815573137715}, "og": {"site_name": "The Hive", "image": "https://web.archive.org/web/20180225231831im_/https://media.vanityfair.com/photos/5a8dcf3d1c6be356b8dcf6a6/16:9/w_1200,h_630,c_limit/t-monica-lewinsky-metoo-03-2018.jpg", "title": "Monica Lewinsky: Emerging from “the House of Gaslight” in the Age of #MeToo", "description": "On the 20th anniversary of the Starr investigation, which introduced her to the world, the author reflects on the changing nature of trauma, the de-evolution of the media, and the extraordinary hope now provided by the #MeToo movement.", "url": "https://web.archive.org/web/20180225231831/https://www.vanityfair.com/news/2018/02/monica-lewinsky-in-the-age-of-metoo", "type": "article"}, "twitter": {"site": "@VFHive", "domain": "https://www.vfhive.com", "card": "summary_large_image", "title": "Monica Lewinsky: Emerging from “the House of Gaslight” in the Age of #MeToo", "description": "On the 20th anniversary of the Starr investigation, which introduced her to the world, the author reflects on the changing nature of trauma, the de-evolution of the media, and the extraordinary hope now provided by the #MeToo movement.", "image": {"src": "https://media.vanityfair.com/photos/5a8dcf3d1c6be356b8dcf6a6/16:9/pass/t-monica-lewinsky-metoo-03-2018.jpg?mbid=social_retweet"}}}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}