{"url": "http://www.wopular.com/bachelor-recap-age-aint-nothing-oh-my-god", "text": "Sophia Bush Dating Soccer Star Ashlyn Harris After Respective Breakups\n\nSophia Bush has scored herself a new date amid her divorce from estranged husband Grant Hughes. The One Tree Hill alum is dating former USWNT soccer player Ashlyn Harris, who herself is in the\n\nWill Smith Releases \"Official Statement\" But It's Not What You Think\n\nWill Smith is gettin' jiggy with it amid buzz around Jada Pinkett Smith's explosive tell-all. On the release date of the Red Table Talk host's memoir Worthy, which detailed how she and\n\nJulianne Hough Joins DWTS Tour and the Details Are On Pointe\n\nJulianne Hough is back on the ballroom floor. E! News can exclusively reveal the 35-year-old will join Dancing With the Stars: Live! The Tour, which kicks off in January 2024, months after she\n\nLove Is Blind “Villain” Uche Answers All Your Burning Questions\n\nThe most controversial pod squad member is setting the record straight. Although Love Is Blind star Uche Okoroha skipped the season five reunion episode, he is ready to address the drama with\n\nJax Taylor Reveals He’s in “Negotiations” With Brittany for Baby No. 2\n\nJax Taylor is raising a glass high to fatherhood. The Vanderpump Rules alum revealed he and his wife Brittany Cartwright are currently discussing giving their 2-year-old son Cruz a", "images": ["http://www.wopular.com/sites/all/themes/garland/wopular/images/social_icon_rss.gif", "http://www.wopular.com/sites/all/themes/garland/wopular/images/mwb_sidebar_graphic.jpg", "http://www.wopular.com/sites/all/themes/garland/wopular/images/social_icon_twitter.gif", "http://www.wopular.com/files/wopular_favicon.ico", "http://www.wopular.com/files/header_logo.png", "http://www.wopular.com/sites/all/themes/garland/wopular/images/share_email_button.gif", "http://www.wopular.com/sites/all/themes/garland/wopular/images/social_icon_facebook.gif", "http://www.wopular.com/sites/all/themes/garland/wopular/images/social_icon_gplus.gif", "http://www.wopular.com/sites/all/themes/garland/wopular/images/clear.gif"], "top_img": "http://www.wopular.com/files/wopular_favicon.ico", "keywords": [], "authors": [], "canonical_link": "", "title": "The Bachelor Recap: Age Ain't Nothing But An Oh My God", "meta_data": {"description": "Just a couple of minutes into tonight's episode of The Bachelor, Krystal declared herself \"the voice of reason, the voice of reality\" for Arie when it came to eliminating the other...", "keywords": "news,headlines,newspapers,news site,news website,aggregated news", "robots": "index,follow", "DC.title": "The Bachelor Recap: Age Ain't Nothing But an Oh My God", "og": {"title": "The Bachelor Recap: Age Ain't Nothing But an Oh My God", "site_name": "Wopular"}, "fb": {"admins": 663016824, "app_id": 214168345322701}}, "movies": [], "publish_date": null, "source": "http://www.wopular.com", "summary": ""}