{"url": "https://www.elle.com/culture/movies-tv/news/a47020/princess-diaries-3-release-date-casting-news/", "text": "It's hard to believe that arrived way back in August 2004. While the past 18 years have just flown by, fans of the real-life fairytale franchise have never given up hope for a third Princess Diaries movie. And 2022 feels as fitting a time as any to bestow the world with some good news.\n\n\n\nIn recent years, traction on a trilogy-making sequel has stalled. Anne Hathaway, who played plucked-from-obscurity princess Mia Thermopolis, previously confirmed a script exists, and while she claimed to be on board for the film alongside co-star Julie Andrews as Queen Clarisse, there hadn't been many updates since. Until Disney officially greenlit a new installment.\n\nAs The Princess Diaries taught us, miracles happen once in a while if you believe. Ahead, everything we know about the status of Princess Diaries 3, including Chris Pine's involvement and Mandy Moore's surprising character theories.\n\nMore From ELLE\n\nPrincess Diaries 3 is officially happening!\n\nDisney has signed on for a third installment, The Hollywood Reporter announced on Nov. 15. TV writer Aadrita Mukerji (Reacher, Supergirl) is penning the script. The film will be a continuation of the Princess Diaries story rather than a reboot.\n\nAnne Hathaway's involvement is not yet confirmed, but “the hope is she would return should the potential new film move forward beyond the script stage,” per THR. She has vocally supported the idea of a third Princess Diaries film, telling Entertainment Tonight in October, “I would more than entertain it, I'm pulling for it. If there's any way to get Julie Andrews involved, I think we would make it work. We would go to where she was and put a green screen behind her and just make it happen.”\n\nDebra Martin Chase, who produced the first two films, will produce the new installment and Melissa Stack (The Other Woman) will executive produce.\n\nThe film has been discussed for years.\n\nQueen Andrews herself gave an update at the time. During a virtual interview with The Talk in April, the Oscar winner managed to both inspire optimism and cast doubt when it comes to PD3. “I heard that there might be one,” she revealed. “It’s long been talked about but nothing sort of been on my desk or anything like that. I think I would [do it]. I’m getting awfully old and crotchety. I’m not sure if it’s the right timing, but I think to work with Annie [Anne Hathaway, who played Princess Mia] would be lovely again, and sure I’d be up for it. I think we should wait for—if a script comes in, let’s wait for that. Of course, we wouldn’t have the wonderful Gary Marshall who was the director. He’s passed. And he was really the nuts and bolts of it all.”\n\nThis content is imported from twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site. \"I’m getting awfully old and crotchety. I’m not sure if it’s the right timing, but I think to work with Annie [Hathaway] would be lovely again. And yeah, sure I would be up for it.” - @JulieAndrews on a potential “Princess Diary 3” movie. pic.twitter.com/0qY07FlFMi — The Talk (@TheTalkCBS) April 27, 2020\n\nHathaway was asked about the status of the project during her January 2019 appearance on Watch What Happens Live. She wants it to happen. Julie Andrews wants it to happen. They're working on it, she confirmed. “There is a script for the third movie.... There is a script,” she said. “I want to do it. Julie [Andrews] wants to do it. Debra Martin Chase, our producer, wants to do it. We all really want it to happen. It’s just we don’t want to unless it’s perfect, because we love it just as much as you guys love it. It’s as important to us as it is to you, and we don’t want to deliver anything until it’s ready, but we’re working on it, so...”\n\nThe Princess Diaries The Princess Diaries Now 13% Off $10 at Amazon\n\nPrior to Hathaway confirming there was a script, the author of The Princess Diaries book series, Meg Cabot, told Entertainment Weekly in 2017 that a script exists. She also said that if the movie gets made, it'll happen “kind of as a tribute” to director Garry Marshall, who passed away in 2016. But Cabot refused to reveal any further details, apart from saying that the movies would likely deviate from the book series. She said, “I think of them as two different universes.”\n\nGarry Marshall was reportedly planning the third installment before he died.\n\nSpeaking of Marshall, the filmmaker was also passionate about a third movie about Princess Mia. In an interview with People in March 2016, Marshall said, \"I was with Anne Hathaway a couple weeks ago. It looks like we want to do The Princess Diaries 3 in Manhattan.\" Sadly, Marshall's plan never came to fruition, but it's possible that the sequel will still be set in New York, to honor his idea.\n\nChris Pine is open to a third movie.\n\nThe actor seemed enthusiastic when asked about reprising his role as the dashing Nicholas Devereaux in 2016. After quite literally sweeping Mia off her feet at the end of the 2004 sequel, questions remain about the status of Nicholas and Mia's romance. During a fan Q&A for Entertainment Weekly in 2016, Pine was asked, “Don't you pray every night for a Princess Diaries 3?” To which he replied, “Have you been reading my diary?”\n\nPine and Hathaway in 2004. Giulio Marcocchi // Getty Images\n\nMandy Moore would consider a cameo.\n\nIn July 2017, Moore, who played mean-girl cheerleader Lana, told ELLE.com, “If I'm going to be involved, I would be down for a cameo—maybe she could make amends with Mia and apologize for being a bully when she was younger. She was insecure, going through a difficult time in her life and [has now] reflected on why that wasn't okay.”\n\nMoore also appeared on People Now in February 2019 and was asked what she would like to see for her character Lana. The actress had a pretty fleshed out answer: “I would like to see if life kicked down a few pegs because she was the bully in school [if she comes back]. I'd like to see her is life has come full circle and maybe she's a little more well humble. I would be down!”\n\n©Walt Disney Co./Courtesy Everett Collection // Everett\n\nPrincess Mia's best friend Lilly Moscovitz would come back.\n\nIn July 2016, Heather Matarazzo, who played Princess Mia's best friend Lilly Moscovitz, told Cosmopolitan that she would definitely return for another sequel. She said, “If Annie and Julie are down, of course.”\n\nThe fans are ready for a royal return.\n\nIf you had concerns about the fanbase returning for a third movie, allow Twitter's evergreen excitement to ease your mind.\n\nThis content is imported from twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site. The Princess Diaries 3 movie will heal our broken nation. pic.twitter.com/Gjuy0SVWpb — Nerd Girl Says (@Rachael_Conrad) November 16, 2022\n\nThis content is imported from twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site. need disney to cut a big check and pay anne hathaway, julie andrews and chris pine whatever they have to in order to make them come back for princess diaries 3 this is not a joke this is my life — j. (@INEJSKNlVES) November 15, 2022\n\nThis content is imported from twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site. where is enchanted 2 where is princess diaries 3 why is no one asking the important questions — 사니야 ☯︎ (@wtvrsans) July 19, 2020\n\nThis content is imported from twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site. Every night before I go to bed I say a little prayer that tomorrow will be the day they announce the release of Princess Diaries 3 — Super Mom (@mirandaexotic) July 18, 2020\n\nThis content is imported from twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site. The sooner everyone stops complaining and just wears a fucking mask the sooner they can finish filming Legally Blonde 3 and Princess Diaries 3 so I’m gonna need everyone to suck it up and just be smart — SJ 🦊 (@Sarah__T0nin) July 17, 2020\n\nThis content is imported from twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site. give me Princess Diaries 3 and make Mia an anarchist who dissolves the monarchy and redistributes the wealth while her retired grandmother helps her, you cowards — (sk)elly(ton) belle 🔮 (@literElly) May 19, 2020\n\nThis content is imported from twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site. i need Princess Diaries 3 to happen asap — Noah Cyrus (@noahcyrus) February 2, 2020\n\nThis content is imported from twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site. Hate the monarchy but still want a 'Princess Diaries 3' — Eimear Keenan (@eimearkeenan) January 5, 2020\n\nAs we await the official release, there's plenty of time to rewatch the first two movies, and reflect on Sandra Oh's Oscar-worthy turn as Vice Principal Gupta.", "images": ["https://hips.hearstapps.com/hmg-prod/images/justine-triet-headshot-c-yann-rabanier-6528f3d909dd4.jpg?crop=1.00xw:0.802xh;0,0.0371xh&resize=360:*", "https://hips.hearstapps.com/rover/profile_photos/67055711-c808-4a4d-811a-e7155a2bce10_1667409691.file?fill=1:1&resize=120:*", "https://www.elle.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/mcdprdi-ec056-1548424541.jpg?resize=640:*", "https://hips.hearstapps.com/vidthumb/images/elle-burn-ballads-babyface-ak-v1-65283d375ffe8.jpg?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/actors-anne-hathaway-and-chris-pine-arrive-at-the-54th-news-photo-1595430212.jpg?crop=1.00xw:0.491xh;0,0.0100xh&resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/msdprdi-ec005-1548424679.jpg?crop=1xw:1xh;center,top&resize=980:*", "https://www.elle.com/_assets/design-tokens/fre/static/icons/social/twitter.b9a5c19.svg?primary=%2523ffffff&id=social-button-icon", "https://www.elle.com/_assets/design-tokens/elle/static/images/logos/network-logo.242fea1.svg?primary=%2523ffffff", "https://www.elle.com/_assets/design-tokens/elle/static/images/logos/logo.2856426.svg?primary=navLogoColor", "https://hips.hearstapps.com/hmg-prod/images/tfhu-101-unit-06069rc-6527adc585e5b.jpg?crop=0.668xw:1.00xh;0.167xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/thecrown-season6-firstlook4-652ee68754c72.jpg?crop=0.502xw:1.00xh;0.138xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/lessons-in-chemistry-photo-010501-6528eb59f21ab.jpg?crop=0.670xw:1.00xh;0.0994xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/iron-claw-final-6527afe1af415.jpg?crop=1.00xw:0.734xh;0,0.164xh&resize=360:*", "https://hips.hearstapps.com/rover/profile_photos/6f65ad1d-dc40-434e-9648-b0321db6f365_1565275467.png?fill=1:1&resize=120:*", "https://hips.hearstapps.com/hmg-prod/images/mcdprdi-ec057-1548424577.jpg?crop=0.753xw:0.526xh;0.247xw,0.330xh&resize=1200:*", "https://hips.hearstapps.com/hmg-prod/images/taylor-swift-performs-onstage-during-taylor-swift-the-news-photo-1697121326.jpg?crop=0.669xw:1.00xh;0.166xw,0&resize=360:*", "https://www.elle.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/loki-season-2-652856bd74b47.png?crop=0.668xw:1.00xh;0.167xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/practical-magic-gettyimages-1150528-652c5441e4857.jpg?crop=0.673xw:1.00xh;0.223xw,0&resize=360:*", "https://www.elle.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=currentColor&id=link-out-embed", "https://www.elle.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/love-is-blind-n-s5-e5-00-17-49-01r-65284438eb0de.jpg?crop=0.565xw:1.00xh;0.218xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/love-is-blind-652807bfe98a6.png?crop=0.713xw:1.00xh;0.0990xw,0&resize=360:*", "https://www.elle.com/_assets/design-tokens/elle/static/images/logos/logo.2856426.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/tfhu-108-unit-03590rc-652c27ba58070.jpg?crop=0.6666666666666666xw:1xh;center,top&resize=360:*", "https://hips.hearstapps.com/vader-prod.s3.amazonaws.com/1595443580-9780061479939.jpg?crop=1xw:1xh;center,top&resize=980:*", "https://hips.hearstapps.com/hmg-prod/images/lessons-in-chemistry-brie-larson-2-65296508e1bcb.png?crop=0.670xw:1.00xh;0.223xw,0&resize=360:*", "https://hips.hearstapps.com/rover/profile_photos/32a17ebf-adab-48ef-a723-758c53a8bea8_1524066273.file?fill=1:1&resize=120:*", "https://www.elle.com/_assets/design-tokens/fre/static/icons/social/pinterest.e8cf655.svg?primary=%2523ffffff&id=social-button-icon"], "top_img": "https://hips.hearstapps.com/hmg-prod/images/mcdprdi-ec057-1548424577.jpg?crop=0.753xw:0.526xh;0.247xw,0.330xh&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.elle.com/culture/movies-tv/news/a47020/princess-diaries-3-release-date-casting-news/", "title": "The Princess Diaries 3 News, Cast, Release Date, and Rumors", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "X-UA-Compatible": "IE=edge,chrom=1", "msapplication-tap-highlight": "no", "title": "The Princess Diaries 3 News, Cast, Release Date, and Rumors", "description": "If new reports are to be believed, The Princess Diaries 3 is finally on the way, but will Anne Hathaway and Chris Pine return? Here's what we know so far.", "keywords": "Anne Hathaway, chris pine, mandy moore, meg cabot, julie andrews, princess diaries 3, princess diaries, princess diaries 3 cast, princess diaries 3 date, princess diaries 3 news, princess diaries 3 rumors", "og": {"type": "article", "site_name": "ELLE", "title": "'Princess Diaries 3' Is Officially Happening, But Anne Hathaway's Return Is Not Yet Confirmed", "description": "However, she's been “pulling for” a third film, so there's still hope for her to play Mia Thermopolis again.", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod/images/mcdprdi-ec057-1548424577.jpg?crop=0.753xw:0.526xh;0.247xw,0.330xh&resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.elle.com/culture/movies-tv/news/a47020/princess-diaries-3-release-date-casting-news/"}, "theme-color": "#000000", "fb": {"app_id": 364664413547847, "pages": 31911516300}, "article": {"publisher": "https://www.facebook.com/ellemagazine", "section": "Movies & TV 2023", "modified_time": "2022-11-16T17:07:33Z", "published_time": "2022-11-16T17:04:00Z"}, "twitter": {"site": "@ELLEmagazine", "image": "https://hips.hearstapps.com/hmg-prod/images/mcdprdi-ec057-1548424577.jpg?crop=0.753xw:0.526xh;0.247xw,0.330xh&resize=640:*", "card": "summary_large_image"}, "google-site-verification": "W6SOBCzCmb2sA5l3z9YK1yO7I7bPYArVQCP09_e2zck", "robots": "max-image-preview:large,max-snippet:-1,max-video-preview:30", "thumbnail": "https://hips.hearstapps.com/hmg-prod/images/mcdprdi-ec057-1548424577.jpg?crop=0.455xw:0.633xh;0.362xw,0.276xh&resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod/images/mcdprdi-ec057-1548424577.jpg?crop=0.455xw:0.633xh;0.362xw,0.276xh&resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod/images/mcdprdi-ec057-1548424577.jpg?crop=0.455xw:0.633xh;0.362xw,0.276xh", "auto-publish": "timely", "sailthru.excerpt": "It's hard to believe that The Princess Diaries 2: Royal Engagement arrived way back in August 2004. While the past 18 years have just flown by, fans of the real-life fairytale franchise have never given up hope for a third Princess Diaries movie. And 2022 feels as fitting a time", "sailthru.tags": "culture,Culture,movies-tv,Movies & TV 2023", "sailthru.date": "2022-11-16 17:04:00", "sailthru.socialtitle": "'Princess Diaries 3' Is Officially Happening, But Anne Hathaway's Return Is Not Yet Confirmed", "sailthru.contenttype": "standard-article", "m1": ".content-hed", "m2": ".content-dek p", "next-head-count": 45}, "movies": [], "publish_date": 1668618240.0, "source": "https://www.elle.com", "summary": ""}