{"url": "https://www.wanttoknow.info/newsstories-0-10000", "text": "News Stories Excerpts of Key News Stories in Major Media\n\nThis comprehensive list of news stories is usually updated once a week. Explore our full index to revealing excerpts of key major media news stories on several dozen engaging topics. And don't miss amazing excerpts from 20 of the most revealing news articles ever published.\n\n2023-10-09, Associated Press\n\nPosted: 2023-10-16 01:37:16\n\nFor Palestinians in Gaza, Israel’s eyes are never very far away. Surveillance drones buzz constantly from the skies. The highly-secured border is awash with security cameras and soldiers on guard. But Israel’s eyes appeared to have been closed in the lead-up to an unprecedented onslaught by the militant Hamas group, which broke down Israeli border barriers and sent hundreds of militants into Israel to carry out a brazen attack that has killed hundreds. Israel withdrew troops and settlers from the Gaza Strip in 2005. But even after Hamas overran Gaza in 2007, Israel appeared to maintain its edge, using technological and human intelligence. It claimed to know the precise locations of Hamas leadership and appeared to prove it through the assassinations of militant leaders in surgical strikes, sometimes while they slept in their bedrooms. Israel has known where to strike underground tunnels used by Hamas to ferry around fighters and arms. Despite those abilities, Hamas was able to keep its plan under wraps. The ferocious attack, which likely took months of planning and meticulous training and involved coordination among multiple militant groups, appeared to have gone under Israel’s intelligence radar. An Egyptian intelligence official said Egypt, which often serves as a mediator between Israel and Hamas, had spoken repeatedly with the Israelis about “something big,” without elaborating. He said Israeli officials were focused on the West Bank and played down the threat from Gaza.\n\nNote: According to Efrat Fenigson, a former Israeli soldier who served on the Gaza border, \"A cat moving alongside the fence is triggering all forces.\" How could Israeli intelligence not have known that this attack was coming? For more along these lines, see concise summaries of deeply revealing news articles on intelligence agency corruption and war from reliable major media sources.\n\n2023-09-05, New York Post\n\nPosted: 2023-10-16 01:35:37\n\nEvery year, up to 9,000 people die in the US as a result of a prescription medication error. That figure doesn’t include the hundreds of thousands of patients who suffer adverse effects from taking the wrong medication or taking meds in the wrong way. Now, an investigative report from the Los Angeles Times reveals that pharmacies make an estimated 5 million errors every year in California alone, according to the state’s Board of Pharmacy. But even as pharmacy errors mount across the US, pharmaceutical lobbyists are pushing to keep reports of errors hidden from officials and the public. The problem, according to pharmacists and others, is most acute at big retail pharmacy chains such as CVS and Walgreens, where overworked staff are pushed to the limit to meet sales quotas, despite desperate staffing shortages. To combat the rising tide of pharmacy errors, the California State Board of Pharmacy is sponsoring a bill that would require pharmacies to report every error to a third party outside the government. The bill would also allow the pharmacist responsible for the store to increase staffing if the workload has become too overwhelming to keep patients safe. But the bill is opposed by the California Community Pharmacy Coalition, a lobbying group representing retail pharmacies, including the big chains. The coalition believes pharmacy staffing requirements are too strict and it does not want the pharmacy board to have access to the error reports.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on corporate corruption and Big Pharma profiteering from reliable major media sources.\n\n2023-06-30, New York Post\n\nPosted: 2023-10-16 01:34:07\n\nOver 30 million Americans a year use benzodiazepines, or “benzos,” including Xanax, Valium, Ativan and Klonopin. Benzodiazepines are prescribed to treat anxiety disorders, insomnia, muscle spasms, schizophrenia, bipolar disorder, seizures and epilepsy. But this widely used class of drugs is linked to severe side effects and life impacts that can last for years — even after people have stopped taking the drugs — a new study finds. “Patients have been reporting long-term effects from benzodiazepines for over 60 years. I am one of those patients,” Dr. Christy Huff, a cardiologist and co-author of the study, said in a news release. The new research, published in PLOS One, includes a lengthy list of side effects that a majority of benzo users experienced more than a year after they stopped taking the drugs. Those long-lasting symptoms include low energy, difficulty focusing, memory loss, anxiety, insomnia, sensitivity to light and sounds, digestive problems, symptoms triggered by food and drink, muscle weakness and body pain. Alarmingly, users also struggled with severe life impacts: 54.7% reported suicide attempts or suicidal thoughts, for example. Health experts noted numerous other problems with benzos, including an increased risk of suicide and dependence on the drug, among other adverse side effects. Withdrawal from benzos can produce troubling symptoms as soon as within 24 hours, and these adverse effects can last for months.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on Big Pharma corruption from reliable major media sources.\n\n2023-08-24, New York Post\n\nPosted: 2023-10-16 01:32:35\n\nThe Food and Drug Administration is now regularly approving new drugs after just one or two clinical trials — a significant departure from the more rigorous vetting process the agency was previously known for, newly published research reveals. Furthermore, the authors say, there’s now less information available to the public about the results of all trials. Of the 37 drugs approved by the FDA last year, 24 (about 65%) were approved based on just one study, according to a paper published in JAMA Network Open. Only four of those 37 drugs, or about 11%, reported three or more studies before approval. Another piece of new research, published in Health Affairs Scholar, found that of the 46 new drugs approved in 2017, 19 of them (41%) were approved based on a single study — though the drugmakers conducted an average of 2.2 studies per drug, including 165 studies for the popular weight-loss drug Ozempic. The ease with which novel drugs are approved is in part the result of the 21st Century Cures Act, passed in 2016 to speed the approval of new medicines so patients could gain access to life-saving treatments. As part of that law, the FDA relaxed some standards to allow treatments for priority health conditions such as cancer to be approved with fewer supporting studies, and with less emphasis on randomized clinical trials. But in the years following the passage of the 21st Century Cures Act, the FDA has faced a firestorm of criticism over the approval process for some new drugs.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on government corruption and Big Pharma profiteering from reliable major media sources.\n\n2023-10-09, The Guardian (One of the UK's Leading Newspapers)\n\nPosted: 2023-10-16 01:30:20\n\nIn December 2010 under the Obama administration, Congress enacted the Healthy, Hunger-Free Kids Act. This legislation provided for more fruits and vegetables in school meal programs, a focus on whole grains and a lot fewer starchy vegetables and trans-fat laden foods. In response, some food companies rejiggered ingredients just enough to add “whole grain” to their packaging. Things went downhill from there. Congress caved to lobbying in 2014, allowing schools to serve high-salt french fries and pizza sold by these companies. Again, big food lobbied hard and legislators pulled back on restrictions for sodium levels, flavored milks and amounts of refined grains. We in the United States seem to believe that ... education is unconnected to food and how we eat. Instead, our kids are at the mercy of the companies and brands inundating them: Tyson, General Mills, Kraft, Heinz and many others. Before the pandemic began, the overwhelming majority of US schools offered branded foods during or around mealtimes, and that this is worth $20bn in ... profits for the food industry. Pantries and food banks get in bed with corporate food companies because they don’t want to lose access to large quantities of foods and beverages that fill people up. That these products are unhealthy is a secondary or tertiary concern. Food banks and pantries are not always meeting the nutritional profiles of the people they serve, particularly people who are struggling with diabetes, obesity and decades of poor eating.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on food system corruption from reliable major media sources.\n\n2023-09-15, Reuters\n\nPosted: 2023-10-16 01:28:08\n\nProcter & Gamble (PG.N), Walgreens (WBA.O) and Johnson & Johnson's (JNJ.N) former consumer business are among several companies accused in lawsuits of deceiving consumers about cold medicines containing an ingredient that a unanimous U.S. Food and Drug Administration advisory panel declared ineffective. Proposed class actions were filed on Wednesday and Thursday, after the panel reviewed several studies and concluded this week that the ingredient phenylephrine marketed as a decongestant was essentially no better than a placebo. According to an agency presentation, about 242 million products with phenylephrine were sold in the United States last year, generating $1.76 billion of sales and accounting for about four-fifths of the market for oral decongestants. The first lawsuit appeared to have been filed in Pensacola, Florida, federal court. It said Johnson & Johnson Consumer and Procter & Gamble should have known by 2018 that their marketing claims about products with phenylephrine were \"false and deceptive.\" That year was when new FDA guidance for evaluating symptoms related to nasal congestion demonstrated that earlier data about phenylephrine's effectiveness could no longer be relied upon, the complaint said. The plaintiff Steve Audelo, a Florida resident, said he bought Johnson & Johnson's Sudafed PE and Benadryl Allergy Plus, and Procter & Gamble's Vicks NyQuil, based on the companies' claims that the products worked.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on health and corporate corruption from reliable major media sources.\n\n2023-09-08, Courthouse News\n\nPosted: 2023-10-16 01:26:20\n\nThe United States will continue in a decades long, post-9/11 state of emergency for at least another year. In a Thursday night declaration, President Joe Biden ensured the emergency will extend at least 23 years after coordinated attacks killed nearly 3,000 people in New York, Virginia and Pennsylvania. Biden penned his signature to a one-year extension of President George W. Bush’s Proclamation 7463, retaining broad powers over the organization of the military. The proclamation is officially titled “The National Emergency with Respect to Certain Terrorist Attacks.” Most emergencies are used to impose economic sanctions. But Proclamation 7463, along with the broad 2001 Authorization for Use of Military Force, gives the president the power to call up the National Guard, alter the size and shape of the military's top officers and hire or fire commissioned officers — even ordering them out of retirement if necessary. Biden has most recently cited the 2001 authorization to justify drone strikes against al-Shabab militants in Somalia in 2021. The National Emergencies Act, adopted in 1976, requires presidents to renew emergencies each year. Presidents Barack Obama and Donald Trump also extended the 9/11 state of emergency each year of their respective tenures. Trump used it in 2017 to fill a chronic shortage in Air Force pilots. So far, Biden has declared eight new emergencies, continued 34 from his predecessors and ended three.\n\nNote: An article by The Atlantic explores the alarming scope of president’s emergency powers, stating that “the moment the president declares a “national emergency”—a decision that is entirely within his discretion—he is able to set aside many of the legal limits on his authority.” For more along these lines, see concise summaries of deeply revealing news articles on government corruption from reliable major media sources.\n\n2023-01-23, Daily Mail (One of the UK's Popular Newspapers)\n\nPosted: 2023-10-16 01:24:16\n\nElon Musk said he had 'major side effects' from his second Covid-19 booster shot that left him feeling like he 'was dying'. Musk, 51, took to Twitter to share his experience of the Covid-19 vaccine in response to a retweet of a poll that said 7 percent of adults claimed they experienced major side effects from the Covid vaccine. The Twitter and Tesla CEO said the second booster 'crushed me'. Musk also shared that his younger cousin, who he said was in 'peak health', had to be hospitalized after his jab suffering from myocarditis. 'I had major side effects from my second booster shot. Felt like I was dying for several days. Hopefully, no permanent damage, but I dunno,' Musk tweeted over the weekend. He added: 'And my cousin, who is young & in peak health, had a serious case of myocarditis. Had to go to the hospital.' Myocarditis is an inflammation of the heart and is named as a possible, but very rare, side effect of Covid-19 vaccinations. A large study published in JAMA Network of more than 192 million people who received Covid vaccines found there were 1,626 cases of myocarditis - a rate of 8.5 cases per million people (0.000845 per cent). Many people have reported side effects from Covid shots, including headaches, a temperature, fatigue and injection site soreness, but in most cases the symptoms only last a few days. When asked why he had gotten the second booster, Musk said that it was not his choice but because it was a requirement fly to Germany.\n\nNote: Explore a list of recent news articles we've summarized that reveal how vaccine-induced myocarditis is not as rare as we're told to believe. For more along these lines, see concise summaries of deeply revealing news articles on coronavirus vaccine problems from reliable major media sources.\n\n2023-10-06, Reason\n\nPosted: 2023-10-16 01:22:47\n\nPublic schools ... are the focus of a new report on surveillance and kids by the American Civil Liberties Union (ACLU). \"Over the last two decades, a segment of the educational technology (EdTech) sector that markets student surveillance products to schools — the EdTech Surveillance industry — has grown into a $3.1 billion a year economic juggernaut,\" begins Digital Dystopia The Danger in Buying What the EdTech Surveillance Industry is Selling. \"The EdTech Surveillance industry accomplished that feat by playing on school districts' fears of school shootings, student self-harm and suicides, and bullying — marketing them as common, ever-present threats.\" As the authors detail, among the technologies are surveillance cameras. These are often linked to software for facial recognition, access control, behavior analysis, and weapon detection. That is, cameras scan student faces and then algorithms identify them, allow or deny them entry based on that ID, decide if their activities are threatening, and determine if objects they carry may be dangerous or forbidden. \"False hits, such as mistaking a broomstick, three-ring binder, or a Google Chromebook laptop for a gun or other type of weapon, could result in an armed police response to a school,\" cautions the report. Students are aware that they're being observed. Of students aged 14–18 surveyed by the ACLU ... thirty-two percent say, \"I always feel like I'm being watched.\"\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on government corruption and the disappearance of privacy from reliable major media sources.\n\n2023-10-03, Public on Substack\n\nPosted: 2023-10-16 01:21:19\n\nOn April 27, 2021, then-director of the CDC, Rochelle Walensky stated, “we have not seen any reports” of post-vaccination myocarditis, but this was a false statement. When Walensky claimed to have “not seen any reports,” there were dozens of reports in the US Vaccine Adverse Event Reporting System (VAERS). “The CDC,” notes [journalist Zachary] Stieber, “was warned by Israel on Feb. 28, 2021, about a ‘large number’ of myocarditis cases after Pfizer COVID-19 vaccination. Internally, the warning was designated as ‘high’ importance and set off a review of US data.” The Israeli Ministry of Health requested a joint meeting with the Food and Drug Administration (FDA) and the CDC to respond to this trend. “The Israeli National Focal Point is noticing a large number of reports of myocarditis, particularly in young people, following the administration of the Pfizer vaccines,” the email stated. Even when more information about myocarditis became public, [Walensky's] agency continued to downplay the risks. Stieber also found that the CDC’s V-Safe self-reporting system did not include a category for myocarditis reports. To this day, the CDC has not released complete, updated data on myocarditis. The agency’s cover-up of adverse cardiac events has had profound consequences and represents a major breach of trust and abuse of authority. Due to the higher risks of myocarditis after Moderna, Sweden, Norway, Finland, Germany, and France suspended the use of the Moderna vaccine for people under 30 two years ago.\n\nNote: When current and former FDA advisers and academics asked the FDA to improve COVID vaccine labeling given the significant risk of severe vaccine injuries, the agency denied almost every single request. For more along these lines, see concise summaries of deeply revealing news articles on government corruption and coronavirus vaccines from reliable major media sources.\n\n2023-04-28, Philadelphia Inquirer\n\nPosted: 2023-10-16 01:18:51\n\nMemorial Day used to be Israel’s most sacred secular holiday because it honored those who died in wars or terrorist attacks. I attended one memorial service in Tel Aviv that rose above these tensions and penetrated to the heart of the issues troubling the country: a meeting of Israeli and Palestinian families who had lost relatives to the conflict and gathered together to share their grief. What was most astonishing about the event was to see the Palestinians fall into the arms of their Israeli hosts and hold on tightly. Why astonishing? Because these days, Palestinians and Israelis almost never come into contact, except at Israeli military checkpoints on the West Bank, or when violent Israeli settlers attack their fields — or when Palestinian workers come to Israel to work in construction or in agriculture. It was moving in the extreme to see Palestinians and Israelis who had experienced heartbreak at the hands of the other side embrace each other tightly and talk about family. It was also moving to watch thousands of Israelis file into the fenced-off area of the ceremony and fill endless rows of plastic chairs (the organizers say that 300,000 watched online). They listened in total silence as Israeli Jews and Palestinian Muslims told their personal stories on the stage. Yuval Sapir, whose sister Tamar was murdered in Tel Aviv in 1994 by a Palestinian suicide bomber ... choked out these words: “It is easy and natural to hate ... I chose to try to break the chain of revenge and hatred.”\n\nNote: Explore more positive stories like this in our comprehensive inspiring news articles archive focused on solutions and bridging divides.\n\n2023-10-08, NPR\n\nPosted: 2023-10-16 01:17:27\n\nIn 1968, at the age of 42, psychiatrist Robert Jay Lifton sat down to write Death in Life, a book about his experiences interviewing survivors of the atomic bombings of Hiroshima and Nagasaki. Over the course of his career, Lifton studied not only survivors of the atomic bombings but Auschwitz survivors, Vietnam war veterans and people who'd been subjected to repression by the Chinese government. The COVID pandemic prompted him to reflect on what he'd learned about mass trauma and resilience – that telling stories about trauma, and even trying to influence policy, can often help people recover. Now 97, Lifton has just published his 13th book, Surviving Our Catastrophes: Resilience and Renewal from Hiroshima to the Covid-19 Pandemic. \"I interviewed people who had undergone the most extreme kind of trauma and victimization,\" [said Lifton]. \"And yet some of the very same people who had so suffered from trauma have shown what I call \"survivor wisdom\" — they transformed themselves from helpless victims to agents of survival. If ... storytelling can include the transformation from the helpless victim to the life-enhancing survivor, then the storytelling is crucial. The storytelling we most encourage is that kind that enables the formerly helpless victim to be transformed in the story, to transform himself or herself, collectively transform themselves into life-affirming survivors. That's the key transformation, and that's the story we [listeners] seek to help them achieve.\"\n\nNote: Explore more positive stories like this in our comprehensive inspiring news articles archive focused on solutions and bridging divides.\n\n2023-10-09, NPR\n\nPosted: 2023-10-16 01:15:59\n\nAfter a decline in nutrition education in U.S. schools in recent decades, there's new momentum to weave food and cooking into the curriculum again. Remember the hands-on cooking in home economics class, which was a staple in U.S. schools for decades? \"I'd love to see it brought back and have the science around healthy eating integrated,\" says Stacy Dean, deputy under secretary for food, nutrition and consumer services at the U.S. Department of Agriculture. Dean told me she was inspired by a visit to Watkins Elementary, in Washington, D.C., where this idea is germinating. Students grow vegetables in their school garden. They also roll up their sleeves in the school's kitchen to participate in a FRESHFARM FoodPrints class, which integrates cooking and nutrition education. Evaluations show participation in FRESHFARM programs is associated with increased preference for fruits and vegetables. And, the CDC points to evidence that nutrition education may help students maintain a healthy weight and can also help students recognize the connection between food and emotional wellbeing. Given the key role diet plays in preventing chronic disease, the agency says it would be ideal to offer more nutrition education. Programs like FRESHFARM can help kids expand their palettes by introducing them to new tastes. At first, many kids are turned off by the bitter taste of greens. But through the alchemy of cooking, caramelizing the onions, and blending in fresh ginger, kids can be inspired.\n\nNote: Explore more positive stories like this in our comprehensive inspiring news articles archive focused on solutions and bridging divides.\n\n2023-10-02, Washington Post\n\nPosted: 2023-10-08 19:52:59\n\nLynn and Paul were sitting in their Seattle home one night earlier this year when their son, Michael, a 17-year-old high school football player, burst into the room and made a beeline for his mom’s purse. “I’m being blackmailed,” he said. Michael had fallen prey to what online safety and law enforcement experts call financial sextortion, in which predators befriend victims online under false pretenses, entice them to send incriminating photos and then demand payment under threat that they’ll expose the photos to family and friends. The number of sextortion cases targeting young people “has exploded in the past couple of years,” with teen boys being specific targets, said Lauren Coffren, executive director of the Exploited Children Division at the National Center for Missing and Exploited Children (NCMEC). NCMEC, which serves as a clearinghouse for records of abuse, received more than 10,000 tips of financial sextortion of minors, primarily boys, in 2022 from the public as well as from electronic service providers, such as Facebook, Instagram and Snapchat, which are required by law to report cases. By the end of July 2023, NCMEC had already received more than 12,500 reports. The repercussions of the abuse are devastating: At least a dozen boys died by suicide in 2022, after they were blackmailed, according to the FBI. Meanwhile, social media companies are playing catch up to stem the tidal wave of sextortion scams targeting children.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on sexual abuse scandals from reliable major media sources.\n\n2023-08-29, The Intercept\n\nPosted: 2023-10-08 19:51:18\n\nThe FBI has amassed 21.7 million DNA profiles — equivalent to about 7 percent of the U.S. population — according to Bureau data reviewed by The Intercept. The FBI aims to nearly double its current $56.7 million budget for dealing with its DNA catalog with an additional $53.1 million, according to its budget request for fiscal year 2024. “The requested resources will allow the FBI to process the rapidly increasing number of DNA samples collected by the U.S. Department of Homeland Security,” the appeal for an increase says. “When we’re talking about rapid expansion like this, it’s getting us ever closer to a universal DNA database,” Vera Eidelman, a staff attorney at the American Civil Liberties Union, [said]. “I think the civil liberties implications here are significant.” The rapid growth of the FBI’s sample load is in large part thanks to a Trump-era rule change that mandated the collection of DNA from migrants who were arrested or detained by immigration authorities. Until recently, the U.S. DNA database surpassed even that of authoritarian China, which launched an ambitious DNA collection program in 2017. That year, the BBC reported, the U.S. had about 4 percent of its population’s DNA, while China had about 3 percent. While DNA has played an important role in prosecuting crimes, less than 3 percent of the profiles have assisted in cases, the Bureau’s data reveals. By comparison, fingerprints collected by the FBI from current and former federal employees linked them to crimes at a rate of 12 percent each year.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on intelligence agency corruption and the disappearance of privacy from reliable major media sources.\n\n2023-09-27, Bloomberg\n\nPosted: 2023-10-08 19:49:22\n\nGoogle maintains one of the world’s most comprehensive repositories of location information. Drawing from phones’ GPS coordinates, plus connections to Wi-Fi networks and cellular towers, it can often estimate a person’s whereabouts to within several feet. It gathers this information in part to sell advertising, but police routinely dip into the data to further their investigations. The use of search data is less common, but that, too, has made its way into police stations throughout the country. Traditionally, American law enforcement obtains a warrant to search the home or belongings of a specific person, in keeping with a constitutional ban on unreasonable searches and seizures. Warrants for Google’s location and search data are, in some ways, the inverse of that process, says Michael Price, the litigation director for the National Association of Criminal Defense Lawyers’ Fourth Amendment Center. Rather than naming a suspect, law enforcement identifies basic parameters—a set of geographic coordinates or search terms—and asks Google to provide hits, essentially generating a list of leads. By their very nature, these Google warrants often return information on people who haven’t been suspected of a crime. In 2018 a man in Arizona was wrongly arrested for murder based on Google location data. Google says it received a record 60,472 search warrants in the US last year, more than double the number from 2019. The company provides at least some information in about 80% of cases.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on police corruption and the disappearance of privacy from reliable major media sources.\n\n2023-10-03, The Guardian (One of the UK's Leading Newspapers)\n\nPosted: 2023-10-08 19:47:59\n\nFrom Virginia to Florida, law enforcement all over the US are increasingly using tools called reverse search warrants – including geofence location warrants and keyword search warrants – to come up with a list of suspects who may have committed particular crimes. While the former is used by law enforcement to get tech companies to identify all the devices that were near a certain place at a certain time, the latter is used to get information on everyone who’s searched for a particular keyword or phrase. It’s a practice public defenders, privacy advocates and many lawmakers have criticised, arguing it violates fourth amendment protections against unreasonable searches. Unlike reverse search warrants, other warrants and subpoenas target a specific person that law enforcement has established there is probable cause to believe has committed a specific crime. But geofence warrants are sweeping in nature and are often used to compile a suspect list to further investigate. Google broke out how many geofence warrants it received for the first time in 2021. The company revealed it received nearly 21,000 geofence warrants between 2018 and 2020. The tech giant did not specify how many of those requests it complied with but did share that in the second half of 2020, it responded to 82% of all government requests for data in the US with some level of information. Apple has taken steps to publish its own numbers. In the first half of 2022 the company fielded a total of 13 geofence warrants and complied with none.\n\nNote: The legal world is struggling to keep up with the rise of tech firms building ever more sophisticated means of surveilling people and their devices. For more along these lines, see concise summaries of deeply revealing news articles on police corruption and the disappearance of privacy from reliable major media sources.\n\n2023-09-27, New York Times\n\nPosted: 2023-10-08 19:46:28\n\nFort Ord was one of 800 U.S. military bases, large and small, that were shuttered between 1988 and 2005. The cities of Seaside and Marina, Calif., where Fort Ord had been critical to the local economy, were left with a ghost town of clapboard barracks and decrepit, World War II-era concrete structures that neither of the cities could afford to tear down. Also left behind were poisonous stockpiles of unexploded ordnance, lead fragments, industrial solvents and explosives residue, a toxic legacy that in some areas of the base remains largely where the Army left it. Across the country, communities were promised that closed bases would be restored, cleaned up and turned over for civilian use. But the cleanup has proceeded at a snail’s pace at many of the facilities, where future remediation work could extend until 2084 and local governments are struggling with the cost of making the land suitable for development. At more than 1,000 sites within the closed bases, the land is so badly contaminated that no one will ever be allowed to live on it. Sites that were supposed to be clean were later found full of asbestos, radioactivity and other health threats. Military base cleanups are often full of surprises, but Hunters Point is in a league of its own. Two former supervisors at an environmental firm, Tetra Tech EC, which the Navy hired to help clean up the base, were convicted in 2018 of fraudulently submitting clean dirt to a laboratory in place of the contaminated dirt at the shipyard.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on military corruption from reliable major media sources.\n\n2023-09-28, The Intercept\n\nPosted: 2023-10-08 19:44:48\n\nBraven Environmental [is] a company that says it can recycle nearly 90 percent of plastic waste through a form of chemical recycling called pyrolysis. Traditional recycling is able to process only about 8.7 percent of America’s plastic waste; pyrolysis uses high temperatures and low-oxygen conditions to break down the remaining plastics, like films and Styrofoam, ideally turning them into feedstock oil for new plastic production. The American Chemistry Council, the country’s leading petrochemical industry trade group, claims that chemical recycling will create a “circular economy” for the bulk of the world’s plastic, diverting it from oceans and landfills. Plastic giants have gone so far as to dub the process “advanced recycling,” but environmentalists say this is a misnomer because the majority of the plastic processed at such facilities is not recycled at all. In fact, researchers have found that the process uses more energy and has a worse overall environmental impact than virgin plastic production. Despite these challenges, lawmakers nationwide are now embracing the technology, thanks to a massive lobbying push from ... petrochemical groups. One list of warnings in a Braven air permit application reads like a toxicologist’s worst nightmare: The pyrolysis oil may cause cancer and genetic defects, as well as damage to organs, fertility, and unborn children. Other hazards included being “extremely flammable” and “very toxic to aquatic life” with “long lasting effects.”\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on corporate corruption from reliable major media sources.\n\n2023-07-24, The Independent (One of the UK's Leading Newspapers)\n\nPosted: 2023-10-08 19:39:58\n\nAn unknown source has been sending radio blasts towards Earth since at least 1988, scientists say. For 35 years, the source has been sending out regular 20-minute blasts of energy that vary considerably in their brightness, researchers say. The emissions appear something like the blasts that come out of pulsars or fast radio bursts, which last for milliseconds to several seconds. But the newly discovered source sends radio signals that pulsate on a period of 21 minutes – something previously thought impossible by expected explanations. Pulsars are neutron stars that spin around quickly, throwing out radio blasts as they do. When one crosses Earth, the emissions can be picked up very briefly and brightly, like being in the path of the light from a rotating lighthouse. Scientists believe that process can only work if the magnetic field of the pulsar is strong, and it is rotating quickly enough – if not, there would not be enough energy to see the pulsar from Earth. That has led to the development of the “pulsar death line”, which suggests that sources must be spinning fast and strong enough to be detected. The newly discovered object named GPMJ1839-10, however, is way beyond that death line. If it is a pulsar, then it seems to be operating in ways that scientists thought impossible. It could also be a highly magnetised white dwarf or magnetar, an extra kind of neutron star with incredibly strong magnetic fields. But they do not tend to send out emissions of this kind, researchers believe.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on the mysterious nature of reality from reliable major media sources.\n\n2023-10-01, Tablet\n\nPosted: 2023-10-08 19:37:49\n\nIn March of 2021 a nonprofit group called the Center for Countering Digital Hate (CCDH) released a report about online misinformation. Founded [by] Imran Ahmed, the CCDH ... provides the White House with a powerful weapon to use against critics including RFK Jr. and [Elon] Musk, while also pressuring platforms like Facebook and Twitter to enforce the administration’s policies. One rumor that came up ... is that [Ahmed] works for British intelligence. “There’s nothing surprising about this,” said Mike Benz, a former State Department official who now runs the Foundation for Freedom Online, a free-speech watchdog. “This is not the first rodeo of British and U.S. intelligence services creating a cutout for the purpose of influencing the online news economy, to rig public debate in favor of political speech that supports agency agendas.” CCDH’s ... chairman is Simon Clark, a former senior fellow at the Center for American Progress (CAP), a D.C. think tank aligned with the corporate arm of the Democratic Party. One might conclude that CCDH functions as an arm of the corporate wing of the Democratic Party, to be deployed against the perceived enemies of corporate Democrats, whether they come from the left or the right. Clark was also a senior fellow at the Atlantic Council’s Digital Forensics Lab. “The Atlantic Council, in the past several years, has had seven CIA directors on its board of directors or board of advisers,” said Benz. “And it’s one of the premier architects of online censorship.”\n\nNote: Read an excellent piece on what gave rise to the modern censorship regime. For more along these lines, see concise summaries of deeply revealing news articles on intelligence agency corruption and media manipulation from reliable sources.\n\n2023-05-04, ScheerPost\n\nPosted: 2023-10-08 19:32:41\n\nOn 7 October 2022, the United States government implemented export controls in an effort to hinder the development of China’s semiconductor industry. The next day, China’s Foreign Ministry spokesperson Mao Ning said: \"... By politicising tech and trade issues and using them as a tool and weapon, the US cannot hold back China’s development but will only hurt and isolate itself when its action backfires.\" Under the Trump and Biden administrations, the US has placed hundreds of Chinese companies on trade and investment blacklists. These restrictions have banned any company in the world that uses US products – effectively every chip designer and manufacturer – from doing business with Chinese tech firms. The US has also pressured governments and firms around the world to impose similar restrictions. Washington fears that China’s technological development will lead, through trade and investment, to the dispersal of advanced technologies more broadly throughout the world, namely, to states in the Global South that the US sees as a threat. This would be a significant blow to the US’s power over these countries. The scale of the developments in digital technology is staggering. Earlier conflicts took place over energy and food, but now this conflict has heated up ... the resources of our digital world. This technology can be used to solve so many of our dilemmas, and yet, here we are, at the precipice of greater conflict to benefit the few over the needs of the many.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on government corruption from reliable major media sources.\n\n2023-09-12, Waging Nonviolence\n\nPosted: 2023-10-08 19:30:06\n\n‘Contact theory’ has been shown to lead to harmony and an enlarged sense of a common good, even when there are limited resources and competing interests. It's a theory that suggests that the more contact that people have, the more willing they are to rehumanize and understand each other, even across their personal differences. It originated in the 50s with the work of Gordon Allport. After World War II, he asked himself, how can we reduce conflict in society? He put forward that, under the right conditions, having positive experiences with people of another social, ethnic, cultural, religious backgrounds could improve our tolerance and reduce our prejudice against them. 50 years later, the vast majority of studies show that it does work. If you talk about moving beyond past violence and having a harmonious society, one of the biggest things that could hamper having these contact experiences [is] the homophilia principle, where you go with your own group. It's easy to avoid having experiences with other groups. But once we do, they're very beneficial. We spoke with someone named Ali Abu Awad [who] is a Palestinian activist. He said he never had contact with an Israeli ... until he was in his 30s. And they were brought together into a group. This Israeli woman was crying, and he was crying. They were both grieving the loss of family members of the conflict. That moment of contact actually changed the whole direction of his life because he realized that this Israeli woman was human like he was. He ended up becoming an activist working toward a solution that humanizes Israelis and humanizes Palestinians at the same time.\n\nNote: This summary is a transcript of an interview with Jasper Van Assche, professor at the University of Ghent in Belgium. Explore more positive stories like this in our comprehensive inspiring news articles archive focused on solutions and bridging divides.\n\n2023-09-27, The Guardian (One of the UK's Leading Newspapers)\n\nPosted: 2023-10-08 19:28:45\n\nFriluftsliv [is] a way of being that is part of the Norwegian national identity. The term was coined by the playwright Henrik Ibsen in his 1859 poem On the Heights, although the concept is much older. Its literal translation is “free-air life”, but Ibsen used it to convey a spiritual connection with nature. To modern Norwegians, it means participating in outdoor activities, but also has a deeper sense of de-stressing in nature and sharing in a common culture. An astonishingly high percentage of Norwegians report spending time outdoors. A survey in June by the market research company Kantar TNS found that 83% are interested in friluftsliv, 77% spend time in nature on a weekly basis and 25% do so most days. At many nurseries, toddlers spend 80% of their time outside; at school, there are special days throughout the year when children go out in nature and build campfires. Studies show that being in green spaces helps reduce anxiety and improve cognition. In a 2020 survey, 90% of Norwegians said they felt less stressed and in a better mood when they spent time in nature. Helga Synnevåg Løvoll, a professor of friluftsliv at Volda University College, says the five documented ways to wellbeing can be achieved through friluftsliv (they are “connect”, “be active”, “take notice”, “keep learning” and “give”). This nature-induced wellbeing could be one reason why Norway ranks among the happiest countries in the world. It came seventh in the UN’s World Happiness report in 2023.\n\nNote: Read about the rise of \"green prescription\" programs in different healthcare systems around the world. Explore more positive stories like this in our comprehensive inspiring news articles archive focused on solutions and bridging divides.\n\n2023-10-01, BBC News\n\nPosted: 2023-10-08 19:26:56\n\nIn 2023, Seabed 2030 announced that its latest map of the entire seafloor is nearly 25% complete. The data to make the world's first publicly available map is stored at the International Hydrography Organization (IHO)'s Data Centre for Digital Bathymetry. 17 research vessels owned by American universities ... constantly circle the globe studying the deep ocean. The ocean mappers came up with a new plan: crowdsourcing. By attaching a data logger to a boat's echosounder, any vessel can build a simple map of the seafloor. Tion Uriam, the head of the Hydrographic Unit at the Republic of Kiribati's Ministry of Communications, Transport and Tourism Development, recently received two data loggers that he's planning to install on local ferries. \"It's a win to be part of that initiative,\" he says. \"Just to put us on the map and raise our hands [to say] we want to be part of a global effort.\" The military or commercial value of nautical charts will always be a barrier. \"Sea charts were destined to be removed from the academic realm and from general circulation,\" wrote the map historian Lloyd Brown. \"They were much more than an aid to navigation; they were the key to empire, the way to wealth.\" [Marine geologist Kevin] Mackay experienced this on a scientific-mapping expedition. He received a call from a military he chooses not to name and \"they said 'you need to destroy that data because there was military value ... it's a place where submarines like to hide',\" he recalls. \"Obviously, we ignore them because we're [mapping] for science, we don't care.\"\n\nNote: Explore more positive stories like this in our comprehensive inspiring news articles archive focused on solutions and bridging divides.\n\n2023-09-15, Time Magazine\n\nPosted: 2023-10-03 15:32:44\n\nAt a press conference at NASA’s Washington, D.C., headquarters, the space agency [appointed] the country’s, and indeed the world’s, first-ever UFO Czar. Only NASA didn’t use either one of those terms. Fewer and fewer people ... talk about UFOs. The preferred term now is UAP, for unidentified anomalous (or, variously, aerial) phenomenon. And NASA didn’t use the label czar either. Instead, the full name for the new job is director of UAP research, and the man tapped to do the work is Mark McInernay, a former Pentagon liaison for NASA. It will be McInernay’s job to study the sightings, advancing science if the vehicles are confirmed to be extraterrestrial, and protecting national security if they’re of international military origin. He’ll have a lot to work with. Over the past 20 years, there have been more than 120 sightings of objects that often appear to be flying with no identified means of propulsion, and maneuvering in quick, head-snapping, often stop-and-start ways that no conventional machines can manage. It helps that the sightings have been called in by witnesses most people think of as unimpeachably reliable: U.S. military pilots. NASA Administrator Bill Nelson yesterday stepped up to offer his view of the possibility of life in space. “There’s a global fascination with UAP,” he said. “Now, NASA has a statutory authority to look for life in the universe. Do I believe there's life in a universe that is so vast that it's hard for me to comprehend how big it is? My personal answer is yes.”\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on UFOs from reliable major media sources. Then explore the excellent, reliable resources provided in our UFO Information Center.\n\n2023-09-15, Reuters\n\nPosted: 2023-10-03 15:30:48\n\nFrance's radiation watchdog has banned sales of Apple's iPhone 12 after tests that it said showed the smartphone breached European radiation exposure limits. The Agence Nationale des Frequences (ANFR) said on Tuesday the model's Specific Absorption Rate (SAR) - a measure of the rate of radiofrequency energy absorbed by the body from a piece of equipment - was higher than legally allowed. Jean-Noel Barrot, France's junior minister for the digital economy, told newspaper Le Parisien a software update could fix the problem. If Apple does not resolve the issue, the ANFR said it would order a recall of the device across France. \"Specific Absorption Rate\" refers to the dose of energy that the body absorbs from any source of radiation. It is expressed as watts per kilogram of body weight. The radiation from mobile phones is a result of the way they work, by transmitting radiofrequency waves, creating electromagnetic fields. The ANFR said it recently carried out random tests on 141 phones, including iPhone 12, bought from shops. In independent laboratory tests, two iPhone 12s did not comply with EU standards, the office of the Digital Minister told Reuters. Smartphone radiation tests have so far led to 42 imposed sale stops in the country, it said. The ANFR said accredited labs had found an SAR of 5.74 watts per kilogram during tests of the iPhone 12 being held in the hand or kept in a trouser pocket. The EU standard is 4.0 watts per kilogram.\n\nNote: Explore an excellent investigation into how the FCC shields cell phone companies from valid safety concerns. This Wired article quotes the result of a mega-study that reveals there is “significant evidence linking cellular phone use to increased tumor risk.” Unlike the U.S., many countries have regulations in place to protect people from cell phone radiation exposure. Check out this comprehensive list of countries with official recommendations and policies on cell phone radiation exposure. For more along these lines, see concise summaries of news articles on wireless technology risks from reliable major media sources.\n\n2023-09-12, CBS News\n\nPosted: 2023-10-03 15:29:03\n\nMillions of American families fell into poverty last year as the well of government-funded pandemic aid dried up and incomes shrank, according to new data from the U.S. Census. Children were particularly hard-hit, with the poverty rate for kids doubling compared with 2021. The rise in poverty amounts to an increase of 15.3 million people around the U.S. living in poverty. Rising inflation [has] hobbled many households. Last year also marked the end of all pandemic-era benefits that helped families stay afloat during the health crisis, such as stimulus checks and the Child Tax Credit, which distributed as much as $300 per child in cash payments. The Supplemental Poverty Measure (SPM), which measures whether people have enough resources to cover their needs, was 12.4% for U.S. households in 2022, an increase of 4.6 percentage points from a year earlier, the Census said on Tuesday. The child poverty rate, as measured by the SPM, jumped from a historic low of 5.2% in 2021 to 12.4% in 2022, the Census said. That's the largest change in child poverty since the Census began tracking the SPM in 2009, Census officials said. If the expanded Child Tax Credit had been renewed, about 3 million additional children would have been kept out of poverty last year. U.S. households also earned less last year, the Census said. The median household income in 2022 was $74,580, a decline of 2.3% from 2021 and the third year in a row that incomes have dipped.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on income inequality from reliable major media sources.\n\n2023-09-20, New York Post\n\nPosted: 2023-10-03 15:27:07\n\nA federal court of appeals ruled earlier this month that the White House, surgeon general, CDC and FBI “likely violated the First Amendment” by exerting a pressure campaign on social media companies to censor COVID-19 skeptics — including Stanford epidemiologist Dr. Jay Bhattacharya. Bhattacharya, a professor of medicine, economics and health research policy at Stanford University, co-authored the Great Barrington Declaration in the fall of 2020 with professors from Harvard and Oxford. The epidemiologists advocated for “focused protection” — safeguarding the most vulnerable Americans while cautiously allowing others to function as normally as possible — rather than broad pandemic lockdowns. “We were just acting as scientists, but almost immediately we were censored,” said Bhattacharya. “Google de-boosted us. Our Facebook page was removed. It was just a crazy time. “The kinds of things that the federal government was telling social media companies to censor included us — along with millions of other posts from countless other people who were criticizing government COVID policy,” he added. A New Orleans-based three-judge panel found that the federal government “likely coerced or significantly encouraged social-media platforms to moderate content” by vaguely threatening adverse regulatory consequences if social media companies did not suppress certain viewpoints on the pandemic.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on the coronavirus and media manipulation from reliable sources.\n\n2023-09-14,\n\nPosted: 2023-10-03 15:24:35\n\nWhat if I told you one in 50 people who took a new medication had a “medically attended adverse event” and the manufacturer refused to disclose what exactly the complication was — would you take it? And what if the theoretical benefit was only transient, lasting about three months, after which your susceptibility goes back to baseline? And what if we told you the Food and Drug Administration cleared it without any human-outcomes data. That’s what we know about the new COVID vaccine the Biden administration is firmly recommending. COVID vaccines are very different from flu vaccines. COVID vaccines have higher complication rates, including severe and life-threatening cardiac reactions. Flu shots have a 50-plus-year safety record whereas COVID vaccines have been associated with a serious adverse event rate of one in 5,000 doses, according to a German study by the Paul-Ehrlich-Institut. Another study, published last year in the medical journal Vaccine, estimated the rate of serious adverse events to be as high as one in 556 COVID vaccine recipients. And for young people, the incidence of myocarditis is six to 28 times higher after the vaccine than after infection, even for females, according to a 2022 JAMA Cardiology study. That’s one of the reasons a study that we and several national colleagues published last year found that college booster mandates appear to have resulted in a net public health harm.\n\nNote: The above was written by Marty Makary, MD, a professor at the Johns Hopkins School of Medicine. Anecdotals is a powerful documentary that follows the lives of many people who stepped up to get vaccinated for themselves or the greater good, yet whose lives changed drastically as a result. Instead of having their stories of vaccine injuries heard and seen, they were discredited and abandoned by the medical system and our media systems.\n\n2023-09-20, The Guardian (One of the UK's Leading Newspapers)\n\nPosted: 2023-10-03 15:22:46\n\nDefence and Security Equipment International (DSEI) [is] Europe’s biggest arms fair, which takes place every two years in the Excel convention centre in east London. It is a sprawling supermarket of modern warfare, where the world’s armies come to buy the latest AI-guided missiles and tanks, inspect giant warships moored in the Royal Docks, and queue to take a turn sitting in the cockpits of fighter jets. Joystick manufacturers jostle with makers of invisibility cloaks, while purveyors of VR simulators compete with those of radar jammers, next to endless ranks of machine guns. Sleek submarines sparkle on spotlit plinths while flocks of missile-carrying drones dangle from the ceiling like menacing mobiles. “This year feels much busier than usual,” one bomb salesman tells me, standing by a gleaming rack of cone-shaped warheads, polished like trophies in a glass cabinet. “It seems war is back in a big way. People are looking to stock up.” Whereas attendees of this great murderous bazaar may once have felt sheepish, they now proudly march through the entrance gates with their heads held high. Recent events in Ukraine have sharpened minds and opened wallets in relation to government spending on defence. Total global military expenditure reached an all-time high of $2.2tn (£1.8tn) in 2022. Outside the exhibition halls, reality hits. “Please be aware,” a polite protester tells visitors, “that many of the countries you are doing business with are on the UK government’s human rights priority list.”\n\nNote: As one defense executive flat-out told Reuters during the event, \"war is good for business.\" For more along these lines, see concise summaries of deeply revealing news articles on war and military corruption from reliable major media sources.\n\n2023-08-30, The Intercept\n\nPosted: 2023-10-03 15:21:17\n\nIn response to a spate of coups by U.S.-trained military personnel in West Africa and the greater Sahel, Rep. Matt Gaetz, R-Fla., has authored an amendment to the 2024 defense spending bill to collect information on trainees who overthrow their governments. It would require the Pentagon for the first time to inform Congress about U.S.-mentored mutineers. “The Department of Defense, up until this point, has not kept data regarding the people they train who participate in coups to overthrow democratically elected — or any — governments,” said Gaetz. The Intercept has found that at least 15 officers who benefited from U.S. security assistance have been involved in 12 coups in West Africa and the greater Sahel during the war on terror. At least five leaders of the Niger coup in late July received American training. They, in turn, appointed five U.S.-trained members of the Nigerien security forces to serve as governors. The Intercept identified more than 70 other African military personnel involved in coups since 2001 who might have received U.S. training or assistance, but when provided with names, State Department spokespeople either failed to respond or replied, “We do not have the ability to provide records for these historical cases.” Gaetz’s proposed legislation ... would require the defense secretary to submit a report listing “the number of partner countries whose military forces have participated in security cooperation training or equipping programs or received security assistance training.”\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on corruption in government and in the military from reliable major media sources.\n\n2023-08-25, The Intercept\n\nPosted: 2023-10-03 15:19:50\n\nCol. Elias Melgar Urbina, a top-ranking Honduran military official and U.S. partner in joint drug war operations, has been tied to a Honduran drug trafficker, according to a U.S. Justice Department filing, and a private security company accused of assassinating land rights activists, according to eyewitness testimony and documents obtained by The Intercept. During the trial of Geovanny Fuentes Ramírez in federal district court in Manhattan, U.S. prosecutors suggested the possibility that Melgar himself had links to the drug trade. Fuentes was convicted in March 2021 of conspiring with high-ranking Honduran politicians and military officials to traffic tons of cocaine into the United States. One of Fuentes’s “military contacts,” according to prosecutors, was Melgar. For decades, the U.S. has supported Honduran governments whose security forces have violently repressed protest, protected select figures in the drug trade, and executed perceived criminals with so-called extermination squads. Since 2009, when a military coup greenlit by the State Department ousted former President Manuel Zelaya, the husband of current president Castro, the U.S. has supported sweeping security initiatives to militarize Honduran forces in the name of the war on drugs — even as they engaged in widespread human rights abuses. “The armed forces have been the key for turning Honduras into a narco-state,” [Pro-Honduras Network head Cristián] Sánchez told The Intercept.\n\nNote: The US government has a long history of involvement in drug trafficking. For more along these lines, see concise summaries of deeply revealing news articles on military corruption from reliable major media sources.\n\n2023-01-04, ProPublica\n\nPosted: 2023-10-03 15:17:31\n\nFederal regulators have maintained that cellphones pose no danger. But a growing body of scientific research is raising questions, with the stakes heightened by the ongoing deployment of hundreds of thousands of new transmitters in neighborhoods across America. ProPublica recently examined the issue in detail, finding that the chief government regulator, the Federal Communications Commission, relies on an exposure standard from 1996 ... and that the agency brushed aside a lengthy study by a different arm of the federal government that found that cellphone radiation caused rare cancers. The newest generation of cellphone technology, known as 5G, remains largely untested. A growing body of research has found evidence of health risks even when people are exposed to radiation below the FCC limits. The array of possible harms ranges from effects on fertility and fetal development to associations with cancer. Some studies of people living near cell towers have also confirmed an array of health complaints, including dizziness, nausea, headaches, tinnitus and insomnia. In 2011, the International Agency for Research on Cancer, an arm of the World Health Organization, cited troubling but uncertain evidence in classifying wireless radiation as “possibly carcinogenic to humans.” In 2018, a study by the federal government that was nearly two decades in the making found “clear evidence” that cellphone radiation caused cancer in lab animals.\n\nNote: Unlike the U.S., many countries have regulations in place to protect people from cell phone radiation exposure. Check out this comprehensive list of countries with official recommendations and policies on cell phone radiation exposure. For more along these lines, see concise summaries of deeply revealing news articles on wireless technology risks from reliable major media sources.\n\n2023-09-24, TomDispatch\n\nPosted: 2023-10-03 15:15:33\n\nWhat would a progressive Pentagon look like? I’m not talking about a “woke” Pentagon that touts and celebrates its “diversity,” including its belated acceptance of LGBTQ+ members. Painting “Black Lives Matter” and rainbow flags on B-52 bombers doesn’t make the bombs dropped any less destructive. All too many Americans didn't know how badly they'd been lied to about the Vietnam War until the Pentagon Papers emerged near the end of that disastrous conflict. All too many Americans didn't know how badly they'd been lied to about the Afghan War until the Afghan War Papers emerged near the end of that disastrous conflict. All too many Americans didn't know how badly they'd been lied to about the Iraq War until the myth of Saddam Hussein's weapons of mass destruction (which had been part of the bogus rationale for invading that country) crumbled. A progressive Pentagon would ... celebrate the insights of Generals Smedley Butler and Dwight D. Eisenhower that war is fundamentally a racket (Butler) and that the military-industrial-congressional complex poses the severest of threats to freedom and democracy in America (President Eisenhower). A progressive Pentagon would ... recognize that one cannot serve both a republic and an empire, that a choice must be made, and that a Pentagon of the present kind in a genuine republic would voluntarily downsize itself, while largely dismantling its imperial infrastructure of perhaps 800 overseas bases.\n\nNote: Read decorated general Smedley Butler's 1935 book War is a Racket. For more along these lines, see concise summaries of deeply revealing news articles on military corruption from reliable major media sources.\n\n2023-09-18, Reasons to be Cheerful\n\nPosted: 2023-10-03 15:13:48\n\nAt the highest point of Los Tres Miradores, a terrifyingly steep urban settlement with soaring views across Peru’s capital, Lima, there is a curious set of large structures that resemble a fleet of ships in the sky. They are so-called “fog catchers.” About 40 of these netted devices, made of high density Raschel polyethylene and spanning several meters wide, are lined up atop a misty mound and linked by a network of tubes that lead to storage containers. Home to a population of more than 10 million, Lima is one of the driest cities in the world. [The nonprofit] El Movimiento Peruanos sin Agua has helped install 600 fog catchers across Lima and a total of 2,000 across Peru, including in the regions of Arequipa, Iquitos and Cuzco. According to [founder Abel] Cruz, one man he supported is even able to raise 1,000 chickens thanks to fog catchers. In June, the project received a significant boost when it signed an agreement with the Mayor of Lima to install 10,000 more fog catchers in the hills surrounding the city in the next four years. The municipality ... said the project has the potential to “reforest, create ecological lungs, ecotourism and at the same time provide water for human consumption, for bio-orchards, botanical gardens, washing clothes, utensils and more.” In Los Tres Miradores, the 40 fog catchers — which were installed in 2021 — provide enough water for 180 families, whether to bathe, clean, drink (after being filtered at home) or to irrigate crops on small garden patches.\n\nNote: Explore more positive stories like this in our comprehensive inspiring news articles archive focused on solutions and bridging divides.\n\n2023-09-15, Reasons to be Cheerful\n\nPosted: 2023-10-03 15:11:59\n\nThe solution to stopping climate change might be buried on 10 acres in the Pauma Valley of California. “The idea is not just to produce food but to improve the soil,” says Alvarez, Solidarity Farm’s Climate Resilience Specialist. “We stopped using the plow to turn the soil, and we do a lot of composting and mulching to improve our soil health.” Solidarity Farm had used organic principles in the 10 years since its inception, but it pivoted to carbon farming after the extreme heat in the summer of 2017. Carbon farmers cultivate plants and trees in a way that maximizes carbon sequestration in the soil. Among the most important practices for carbon farmers are minimizing soil erosion by planting perennials and ground cover, which also lowers soil temperatures, and only working the land by hand or with low-tech solutions. “The soil has the capacity to store more carbon than all plants on the planet together,” Alvarez says. Solidarity Farms produces a diverse range of about 60 different fruits and vegetables, at least 70 percent of them perennial crops such as plums and pomegranates. Stacks of organic chicken manure in front of the vegetable beds wait to be distributed. The farmers enrich the soil with compost and mulch, while deterring pests with diverse crop rotation. According to soil tests, the Solidarity farmers have tripled the amount of carbon in the ground since 2018. “This equates to a drawdown of nearly 600 metric tons of CO2 per year, offsetting the emissions of 80 American households,” Alvarez says.\n\nNote: Have you seen the groundbreaking and inspiring movie Kiss the Ground? In a time where we're told hopeless and divisive narratives about our current environmental challenges, people all over the world are reversing the damage from destroyed ecosystems, regenerating the world's soils, and creating abundant food supplies. Don't miss this powerful film on the growing regenerative agriculture movement and its power to revive global community and our connection to the natural world.\n\n2023-08-21, Reasons to be Cheerful\n\nPosted: 2023-10-03 15:10:27\n\nNatalie Small looks at the ocean. “How high are the waves today – the ones out there on the water and the emotional ones within me? These are questions she likes to ask at the start of every group therapy session on Ocean Beach in San Diego, California. Small ... is part of a burgeoning niche of psychotherapy that blends traditional therapy with a sport proven to build resilience, confidence and well-being. More than a hippie wellness novelty or New Age fad, surf therapy is being embraced by psychologists and government agencies alike as a way to increase access to mental health care while delivering evidence-based, lasting results. Kristen Walter ... received a $1 million grant from the Navy to research surf therapy for military personnel. “We see immediate benefits,” Walter confirms. “Post-traumatic stress, depression and anxiety decrease significantly.” Walter’s research has shown that the effects of surf therapy are lasting: When she randomly assigned 96 military participants with mental health diagnoses to either hiking or surf therapy, both groups spent three to four hours per week in nature. After six weeks, both groups showed improvements — 55 percent of the surfers and 46 percent of the hikers were no longer considered clinically ill. “But when we checked again three months later, the improvements in the surfer group lasted significantly longer,” Walter says. “74 percent of the surfers were considered healed versus only 47 percent of the hikers.”\n\nNote: Explore more positive stories like this in our comprehensive inspiring news articles archive focused on solutions and bridging divides.\n\n2023-09-08, Wall Street Journal\n\nPosted: 2023-09-24 17:11:28\n\nAt the heart of America’s political and cultural turmoil is a crisis of trust. In the space of a generation, the people’s confidence in their leaders and their most important institutions to do the right thing has collapsed. The federal government, big business, the media, education, science and medicine, technology, religious institutions, law enforcement and others have seen a precipitous decline. Since 1979 Gallup has measured trust among the public in the most important American institutions. Its latest survey ... found that across the nine key institutions Gallup has tracked consistently, the proportion of Americans who said they had “a great deal or quite a lot of confidence” averaged out at 26%. That is the lowest figure ever recorded. Some institutions have forfeited more trust than others. In 1979 Gallup found that 51% of Americans had a great deal or quite a lot of confidence in newspapers. This year the number was 18%. The biggest factor driving mistrust ... is surely the widening cultural gap between the people who have led and thrived in our major institutions and the rest of the population. The past 20 years have seen the rapid emergence of a new elite—expensively educated, versed in progressive nostrums, increasingly distant from and disdainful of the rest of America and its values. This crowd comprises much of the nation’s permanent government classes, almost its entire academic establishment, most of the people who control its news and cultural output, and a good deal of its corporate elite.\n\nNote: About half of Americans lost faith in the scientific community after this \"new elite\" repeatedly misled the public on issues related to the pandemic. For more along these lines, see concise summaries of deeply revealing news articles on the coronavirus and media manipulation from reliable sources.\n\n2023-09-08, New York Post\n\nPosted: 2023-09-24 17:08:40\n\nThe Biden administration likely infringed upon the First Amendment when it leaned on social media companies to remove false or misleading COVID-19 content, a federal court of appeals ruled Friday — narrowing a bombshell district court order that barred several officials and agencies from communicating with the platforms. The White House, surgeon general, Centers for Disease Control and Prevention and the FBI “likely coerced or significantly encouraged social-media platforms to moderate content” and in doing so, “likely violated the First Amendment,” the New Orleans-based Fifth US Circuit Court of Appeals determined. The three-judge panel, however, adjusted the scope of US District Judge Terry Doughty’s July 4 order ... removing officials from the National Institute of Allergy and Infectious Disease, the Cybersecurity and Infrastructure Security Agency and the State Department from the injunction. The Fifth Circuit vacated nine of the 10 provisions in Doughty’s order that prevented Biden administration officials from “urging, encouraging, pressuring” or “inducing” social media companies from removing content. Similarly, the appeals court determined that “following up with social-media companies” about content moderation, “requesting content reports from social-media companies” or asking platforms to “Be on The Lookout” for certain types of material does not violate individuals’ First Amendment rights.\n\nNote: Many posts that were censored contained factual information on COVID-related issues. For more along these lines, see concise summaries of deeply revealing news articles on the coronavirus and media manipulation from reliable sources.\n\n2023-09-20, The Intercept\n\nPosted: 2023-09-24 17:06:44\n\nLeading up to the August Republican presidential primary debate ... An RNC official told Google via email that the debate would be streaming exclusively on the upstart video platform Rumble. The August 23 debate was broadcast on Fox News and streamed on Fox Nation, which requires a subscription, while Rumble was the only one to stream it for free. On the day of and during the debate, however, potential viewers who searched Google for “GOP debate stream” were returned links to YouTube, Fox News, and news articles about the debate, according to screen recordings. Rumble was nowhere on the first page. For Rumble, which is currently in discovery in an antitrust lawsuit against Google in California, this is a case of Google suppressing its competitors in favor of its own product, YouTube. YouTube is owned by Google, and it has regularly been the subject of anticompetitive allegations from rivals, who charge that Google unfairly and illegally favors YouTube in its search algorithm. Google, in fact, is in the middle of a landmark antitrust trial, charged with anticompetitive practices by the Department of Justice. The company would not have been required by antitrust law to promote [Rumble's] link. It would, however, be barred from suppressing the competitor’s link from organic results. The fact that Rumble’s link did not appear on the first page even though it was the most relevant link the search could return means either the search engine failed at its task or the link was suppressed.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on corporate corruption and media manipulation from reliable sources.\n\n2023-09-17, The Intercept\n\nPosted: 2023-09-24 17:04:59\n\nThe New York Times tried to block a web crawler that was affiliated with the famous Internet Archive. The Internet Archive’s Wayback Machine has long been used to compare webpages as they are updated over time, clearly delineating the differences between two iterations of any given page. Several years ago, the archive added a feature called “Changes” that lets users compare two archived versions of a website from different dates or times on a single display. The tool can be used to uncover changes in news stories that have been made without any accompanying editorial notes, so-called stealth edits. The Times has, in the past, faced public criticisms over some of its stealth edits. In a notorious 2016 incident, the paper revised an article about then-Democratic presidential candidate Sen. Bernie Sanders, I-Vt. ... drastically after publication — changing the tone from one of praise to skepticism. More recently, the Times stealth-edited an article that originally listed “death” as one of six ways “you can still cancel your federal student loan debt.” Following the edit, the “death” section title was changed to a more opaque heading of “debt won’t carry on.” A service called NewsDiffs — which provides a similar comparative service but focuses on news outlets such as the New York Times, CNN, the Washington Post, and others — has also chronicled a long list of significant examples of articles that have undergone stealth edits, though the service appears to not have been updated in several years.\n\nNote: The manipulation of media coverage for Bernie Sanders' campaign was widespread, as discussed in an WantToKnow.info interview with media activist Tony Brasunas. For more along these lines, see concise summaries of deeply revealing news articles on corporate corruption and media manipulation from reliable sources.\n\n2023-09-14, New York Post\n\nPosted: 2023-09-24 17:03:27\n\nGoogle fought hard to be the default search engine on smartphones and browsers so it “can manipulate your choices,” an expert on human behavior testified for the government at the closely watched antitrust trial. Antonio Rangel, a behavioral economist ... took the stand for the second day and said Google has leaned heavily on default settings to keep users hooked on its search engine and other lucrative services. The Justice Department is arguing ... that the Alphabet unit sought agreements with mobile carriers to win powerful default positions on smartphones to dominate search. The antitrust case – the largest of its kind in more than two decades – will ultimately hinge on whether Google is determined to have taken anticompetitive steps to cut off rivals while building its search behemoth. In testimony on Wednesday, Rangel questioned Google’s argument that users could easily switch their default search engine, telling the court that he acquired an Android smartphone and found that it took 10 steps for the owner to switch Google for Microsoft’s Bing. “That is considerable choice friction,” Rangel said. Justice Department attorneys said Google paid “more than $10 billion per year” to major companies, including smartphone makers Apple and Samsung, browser operators like Mozilla and wireless providers such as AT&T, to secure a 91% share of the search market. The case’s outcome won’t be determined by a jury. Instead, US District Judge Amit Mehta will reach a determination on the outcome.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on corporate corruption and media manipulation from reliable sources.\n\n2023-09-13, The Guardian (One of the UK's Leading Newspapers)\n\nPosted: 2023-09-24 17:01:23\n\nFor decades, it was the secret behind the magic show of homemaking across the US. Applied to a pan, it could keep a fried egg from sticking to the surface. Perfluorooctanoic acid, or PFOA, was ... seeping into the blood and organs of hundreds of millions of people who used products containing the chemical. PFOA is just one of dozens of modern-day chemicals that are found in the bodies of the majority of Americans. Research has also shown that more Americans are facing a growing number of ailments and disorders, from autoimmune disease to developmental disorders such as autism and some cancers. Scientists are increasingly concerned these two truths are linked. Scientists have accumulated enough data to conclude with confidence that humans face significant health risks from exposure to common commercial chemicals, and that regulations designed to protect them are failing. Due to flaws in federal regulation, the US Environmental Protection Agency (EPA) is perennially playing catch up. The majority of the 86,000 consumer chemicals registered with the agency have never received vigorous toxicity testing. Kyla Bennett, a former EPA employee [said] that at recent rates of review, it would take thousands of years to assess all 86,000 chemicals currently approved for use. EPA staff ... say the agency’s chemical programs remain understaffed, overwhelmed and burdened by still-ineffective regulations and a persistent culture that enables the chemical industry instead of counterbalancing it.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on government corruption and health issues from reliable major media sources.\n\n2023-09-20, Associated Press\n\nPosted: 2023-09-24 16:59:56\n\nLouis Milione retired from the DEA a second time this summer amid reporting by The Associated Press on potential conflicts caused by his prior consulting for the pharmaceutical industry. Less than three months later, Milione again landed a plum job at Guidepost Solutions, a New York-based firm hired by some of the same companies he had been tasked with regulating when he returned to the DEA in 2021. Milione had spent four years at Guidepost prior to his return, leveraging his extensive experience and contacts from a 21-year DEA career. Milione is the most senior of a slew of DEA officials to have traded their badge and gun for a globe-trotting consulting job. His career stands out for two cycles through the revolving door between government and industry, raising questions about the potential impact on the DEA’s mission to police drug companies blamed for tens of thousands of American overdose deaths. Milione’s private-sector clientele also included Morris & Dickson Co., the nation’s fourth-largest wholesale drug distributor, as it tried to stave off DEA sanctions for disregarding thousands of suspicious, high-volume orders. The DEA allowed the company to continue shipping drugs for nearly four years after a judge recommended its license be revoked for “cavalier disregard” of rules aimed at preventing opioid abuse. It was not until AP began asking questions this spring that the DEA moved to finally strip the Shreveport, Louisiana-based company of its license to distribute highly addictive painkillers.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on corruption in government and in the pharmaceutical industry from reliable major media sources.\n\n2023-07-28, Vox\n\nPosted: 2023-09-24 16:57:46\n\nThere’s a lot of money in AI. Economists are predicting a massive boom in productivity as AI use takes off, buoyed by empirical research showing tools like ChatGPT boost worker output. Demis Hassabis, the founder of DeepMind, sold his company to Google in 2014 only after the latter agreed to an independent ethics board that would govern how Google uses DeepMind’s research. ChatGPT maker OpenAI is structured as a nonprofit that owns a for-profit arm. Anthropic, which makes the chatbot Claude, is divesting control over a majority of its board to a trust composed not of shareholders, but independent trustees meant to enforce a focus on safety ahead of profits. Those three companies, plus Microsoft, got together ... to start a new organization meant to self-regulate the AI industry. There are three broad ways the profits reaped by AI companies could make their way to a more general public. The first ... is taxes. The second, considerably less important, is charity. The third is if the companies themselves decide to donate a large share of their profits. This was the key proposal of a landmark 2020 paper called “The Windfall Clause.” The idea is simple: The clause is a voluntary but binding commitment that AI firms could make to donate a set percentage of their profits in excess of a certain threshold to a charitable entity. They suggest the thresholds be based on profits as a share of the gross world product (the entire world’s economic output).\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on corporate corruption from reliable major media sources.\n\n2023-08-31, Truthout\n\nPosted: 2023-09-24 16:56:09\n\nThe United States is gunning for war with China. By cozying up to Taiwan and arming it to the teeth, President Joe Biden is undermining the “One China” policy which has been the cornerstone of U.S.-China relations since 1979. In March, U.S. Director of National Intelligence Avril Haines called China the “leading and most consequential threat to U.S. national security.” More than 90 percent of the most advanced microchips in the world are manufactured in Taiwan. The chips are used to power our smartphones, train artificial intelligence systems and guide missiles. The Trump administration imposed heavy tariffs on Chinese imports to cut off China’s access to the software technology and equipment required to build the advanced chips. Biden has maintained and dramatically expanded Trump’s coercive economic measures and imposed a blockade on advanced semiconductors. Biden has repeatedly stated that the United States would use military force to defend Taiwan if it is attacked by China. The Biden administration has provided Taiwan with $619 million worth of high-tech arms. China has not been at war with any country since 1979. By contrast, the United States has had only 16 years of peace in its 247 years. K.J. Noh, an activist scholar who writes about the geopolitics of the Asian continent ... described South Korea as key to the U.S.’s escalating war on China. “The United States has operational control over South Korean troops,” Noh said. The U.S. is also “weaponizing Taiwan into an imperial outpost for war.”\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on government corruption from reliable major media sources.\n\n2023-09-19, ScheerPost\n\nPosted: 2023-09-24 16:54:07\n\nShould the government have to get a warrant before using a drone to spy on your home and backyard? We think so, and in an amicus brief filed last Friday in Long Lake Township v. Maxon, we urged the Michigan Supreme Court to find that warrantless drone surveillance of a home violates the Fourth Amendment. In this case, Long Lake Township hired private operators to repeatedly fly drones over Todd and Heather Maxon’s home to take aerial photos and videos of their property in a zoning investigation. The Township did this without a warrant and then sought to use this documentation in a court case against them. In our brief, we argue that the township’s conduct was governed by and violated the Fourth Amendment and the equivalent section of the Michigan Constitution. Drone prevalence has soared in recent years, fueled by both private and governmental use. We have documented more than 1,471 law enforcement agencies across the United States that operate drones. In some cities, police have begun implementing “drone as first responder” programs, in which drones are constantly flying over communities in response to routine calls for service. Authorities have routinely used aerial surveillance technologies against individuals participating in racial justice movements. Under this backdrop, states like Florida, Maine, Minnesota, Nevada, North Dakota, and Virginia have enacted statutes requiring warrants for police use of drones.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on government corruption and the disappearance of privacy from reliable major media sources.\n\n2023-09-14, Nature\n\nPosted: 2023-09-24 16:48:44\n\nThe psychedelic drug MDMA, also known as ecstasy or molly, has passed another key hurdle on its way to regulatory approval as a treatment for mental illness. A second large clinical trial has found that the drug — in combination with psychotherapy — is effective at treating post-traumatic stress disorder (PTSD). In June, Australia became the first country to allow physicians to prescribe MDMA for treating psychiatric conditions. MDMA is illegal in the United States and other countries because of the potential for its misuse. But the Multidisciplinary Association for Psychedelic Studies (MAPS) ... has long been developing a proprietary protocol for using MDMA as a treatment for PTSD and other disorders. MAPS has been campaigning for its legalization. In 2021, researchers sponsored by MAPS reported the results of a study in which 90 people received a form of psychotherapy developed by the organization alongside either MDMA or a placebo. After three treatment sessions, 67% of those who received MDMA with therapy no longer qualified for a PTSD diagnosis, compared with 32% of those who received therapy and a placebo. The results of a second trial ... were similar: 71% of people who received MDMA alongside therapy lost their PTSD diagnosis. A MAPS spokesperson says that the organization plans to seek formal FDA approval before the end of this year, and that because the agency has already designated MDMA as a ‘breakthrough therapy’ ... it will be evaluated quickly.\n\nNote: Read more about the healing potentials of mind-altering drugs. Explore more positive stories like this in our comprehensive inspiring news articles archive focused on solutions and bridging divides.\n\n2023-06-29, NPR\n\nPosted: 2023-09-24 16:47:21\n\nStuck indoors during the peak of COVID lockdown, science journalist Rachel Nuwer found herself at a professional crossroads. She had already published a nonfiction book on the dark world of wildlife trafficking and was looking for her next subject. A moment of clarity came at a surprising time. She and her partner, at home with nothing much to do, ingested MDMA. MDMA, also known as ecstasy or molly, is illegal. It is listed as a Schedule 1 drug by the U.S. federal government (the same group as marijuana and psilocybin, or magic mushrooms). A growing body of academic research has suggested potential benefits of MDMA beyond the recreational ecstasy some partygoers are familiar with. One study found that MDMA-enhanced therapy dramatically reduced PTSD symptoms. Another showed that psychedelics like MDMA could reopen so-called critical periods of time when brains are especially impressionable and open to learning. A scientific case study profiled a former white supremacist who reformed his extremist views after taking MDMA. Nuwer experienced similar clarity while on the drug. Her new book, \"I Feel Love: MDMA and the Quest for Connection in a Fractured World,\" is the result of her epiphany. She explores the history and potential of the so-called love drug.\n\nNote: Read more about the healing potentials of mind-altering drugs. Explore more positive stories like this in our comprehensive inspiring news articles archive focused on solutions and bridging divides.\n\n2023-09-19, Reasons to be Cheerful\n\nPosted: 2023-09-24 16:45:50\n\nWhen Anthony Myint and his wife Karen Leibowitz opened their San Francisco restaurant The Perennial in 2016, they had big ambitions: They wanted it to be the first carbon-neutral restaurant in the world, and they succeeded. From the recycled floor tiles and reclaimed lumber to the aquaponic herb garden and compostable paper menus, the culinary duo designed every part of the diner with the climate in mind. “We shifted the menus, reduced food waste, switched to renewable energy, started composting and bought carbon offsets,” Myint says. They were motivated by the knowledge that agriculture and food systems contribute nearly a third of greenhouse gas emissions worldwide. The Perennial’s menu championed sourdough loaves baked with perennial Kernza grains, and the chefs bought their steaks from regenerative ranches associated with the Marin Carbon Project, the country’s foremost center for regenerative farming. The more Myint learned about regenerative agriculture, the more he became convinced that this was the global solution he needed to champion. “It became clear to me that this is the future of food, similar to the way renewable energy is the future of energy,” he says. “The whole food system needs to gradually transition.” Zero Foodprint is asking restaurant customers and other participating businesses to give one percent of their sales to a pool that funds regenerative agriculture. More than 80 businesses have signed up.\n\nNote: We've summarized a handful of stories about the power of regenerative agriculture practices to reverse and heal global ecological destruction. Explore more positive stories like this in our comprehensive inspiring news articles archive focused on solutions and bridging divides.\n\n2023-09-09, New York Times\n\nPosted: 2023-09-18 14:28:16\n\nHe still remembers the first gunshot. Now, 60 years later, Paul Landis, one of the Secret Service agents just feet away from President John F. Kennedy on that fateful day in Dallas, is telling his story in full for the first time. His account differs from the official version. At age 88, he said, all he wants is to tell what he saw and what he did. He will leave it to everyone else to draw conclusions. What it comes down to is a copper-jacketed 6.5-millimeter projectile. The Warren Commission decided that one of the bullets fired that day struck the president from behind, exited from the front of his throat and continued on to hit Mr. Connally, somehow managing to injure his back, chest, wrist and thigh. It seemed incredible that a single bullet could do all that, so skeptics called it the magic bullet theory. Investigators came to that conclusion partly because the bullet was found on a stretcher believed to have held Mr. Connally at Parkland Memorial Hospital. In fact, [Mr. Landis] said, he was the one who found the bullet — and he found it not in the hospital near Mr. Connally but in the presidential limousine lodged in the back of the seat behind where Kennedy was sitting. “If what he says is true, which I tend to believe, it is likely to reopen the question of a second shooter, if not even more,” [Historian James] Robenalt said. “If the bullet we know as the magic or pristine bullet stopped in President Kennedy’s back, it means that the central thesis of the Warren Report, the single-bullet theory, is wrong.”\n\nNote: For more along these lines, see concise summaries of revealing news articles on the Kennedy assassination from reliable major media sources. For deeper exploration, check out our comprehensive Information Center on John F. Kennedy's assassination, which challenge mainstream narratives about his assassination and the events leading up to it.\n\n2023-09-09, Vanity Fair\n\nPosted: 2023-09-18 14:25:41\n\nPaul Landis was one of two Secret Service agents tasked with guarding first lady Jacqueline Kennedy on November 22, 1963—the day President John F. Kennedy was assassinated. In a new book, The Final Witness, to be published in October, Landis claims to have seen something that afternoon that he had never publicly admitted before. Landis was approximately 15 feet away when Kennedy was mortally wounded. Landis saw and did something that he has kept secret for six decades, he says now. He claims he spotted a bullet resting on the top of the back of the seat. He says he picked it up, put it in his pocket, and brought it into the hospital. Then, upon entering Trauma Room No. 1 (at that stage, he was the only nonmedical person in the room besides Mrs. Kennedy, and both stayed for only a short period), he insists, he placed the bullet on a white cotton blanket on the president’s stretcher. This secret, as it turns out, may upend key conclusions of the Warren Commission, the body created by President Lyndon Johnson to investigate the assassination. Landis ... never sat for an interview before the FBI and never testified before the commission. There have been endless theories surrounding the assassination, but not one of them considered that a Secret Service agent might have brought a fully intact bullet, found on top of the rear seat of the limousine, into Parkland Memorial Hospital and placed it on the president’s stretcher. Not one.\n\nNote: For more along these lines, see concise summaries of revealing news articles on the Kennedy assassination from reliable major media sources. For deeper exploration, check out our comprehensive Information Center on John F. Kennedy's assassination, which challenge mainstream narratives about his assassination and the events leading up to it.\n\n2023-09-12, New York Post\n\nPosted: 2023-09-18 14:23:22\n\nThe Central Intelligence Agency offered to pay off analysts in order to bury their findings that COVID-19 most likely leaked from a lab in Wuhan, China, new whistleblower testimony to Congress alleges. A senior-level CIA officer told House committee leaders that his agency tried to pay off six analysts who found SARS-CoV-2 likely originated in a Wuhan lab if they changed their position and said the virus jumped from animals to humans, according to a letter sent Tuesday to CIA Director William Burns. Select Subcommittee on the Coronavirus Pandemic Chairman Brad Wenstrup (R-Ohio) and Permanent Select Committee on Intelligence Chairman Mike Turner (R-Ohio) requested all documents, communications and pay info from the CIA’s COVID Discovery Team by Sept. 26. “According to the whistleblower, at the end of its review, six of the seven members of the Team believed the intelligence and science were sufficient to make a low confidence assessment that COVID-19 originated from a laboratory in Wuhan, China,” the House panel chairmen wrote. “The seventh member of the Team, who also happened to be the most senior, was the lone officer to believe COVID-19 originated through zoonosis.” “The whistleblower further contends that to come to the eventual public determination of uncertainty, the other six members were given a significant monetary incentive to change their position,” they said, noting that the analysts were “experienced officers with significant scientific expertise.”\n\nNote: Explore more revealing articles we've summarized about the COVID origin story. For more along these lines, see concise summaries of news articles on intelligence agency corruption and the coronavirus from reliable major media sources.\n\n2023-09-06, New York Post\n\nPosted: 2023-09-18 14:20:00\n\nCar makers Nissan and Kia can collect data on their drivers’ “sexual activity” and “sex lives” — and may sell the info to third-party advertisers, according to a shocking study by an internet privacy watchdog. The creepy collection of personal information by the two auto companies earned them failing grades from The Mozilla Foundation, maker of the Firefox web browser, which ran privacy checks on 25 car brands. The foundation said most car companies can comb through a variety of sources to glean personal information about drivers after they pair their smartphones with a vehicle’s connected services. “This invasive harvesting of information is collected via a web of sensors, microphones, cameras and the phones, apps, and connected services you use in your vehicle,” according to Mozilla Foundation. The car firms can then take that data and sell it to or share it with vendors, insurance companies and others. Of the 25 car brands that were reviewed, Nissan’s privacy policy “is probably the most ... messed up privacy policy we have ever read,” according to Mozilla Foundation. “They come right out and say they can collect and share your sexual activity, health diagnosis data, and genetic information and other sensitive personal information for targeted marketing purposes,” the foundation wrote. Mozilla Foundation also flagged other car companies such as Chrysler, Chevrolet, Toyota, Audi, Jeep, and Honda for “brazenly collecting deeply personal information from the moment they get into a car.”\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on corporate corruption and the disappearance of privacy from reliable major media sources.\n\n2023-02-10, Wired\n\nPosted: 2023-09-18 14:16:54\n\nNew details about the FBI’s failures to comply with restrictions on the use of foreign intelligence for domestic crimes have emerged. Section 702 of the Foreign Intelligence Surveillance Act (FISA) ... grants the government the ability to intercept the electronic communications of overseas targets who are unprotected by the Fourth Amendment. That authority is set to expire at the end of the year. But errors in the FBI’s secondary use of the data—the investigation of crimes on US soil—are likely to inflame an already fierce debate over whether law enforcement agents can be trusted with such an invasive tool. Central to this tension has been a routine audit by the Department of Justice’s (DOJ) national security division and the office of the director of national intelligence (ODNI) ... which unearthed new examples of the FBI failing to comply with rules limiting access to intelligence ostensibly gathered to protect US national security. Such “errors,” they said, have occurred on a “large number” of occasions. A report on the audit, only recently declassified, found that in the first half of 2020, FBI personnel unlawfully searched raw FISA data on numerous occasions. In one incident, agents reportedly sought evidence of foreign influence linked to a US lawmaker. In another, an inappropriate search pertained to a local political party. In what privacy and civil liberties lawyers have termed a “backdoor search,” the FBI regularly searches through unminimized data during investigations, and routinely prior to launching them.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on intelligence agency corruption and the disappearanc", "images": ["https://www.wanttoknow.info/m/images/rss.jpg", "https://www.wanttoknow.info/m/images/menu.png", "https://www.wanttoknow.info/m/images/menu-close.png", "https://www.wanttoknow.info/m/images/social-insta.png", "https://www.wanttoknow.info/m/images/wtk-og.jpg", "https://www.wanttoknow.info/m/images/social-fb.png", "https://www.wanttoknow.info/m/images/social-twitter.png", "https://www.wanttoknow.info/m/images/fire.png", "https://forms.aweber.com/form/displays.htm?id=rAzMTEzs7Bws", "https://www.wanttoknow.info/m/images/wtk-logo.png", "https://www.wanttoknow.info/m/images/social-youtube.png"], "top_img": "https://www.wanttoknow.info/m/images/wtk-og.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.wanttoknow.info/newsstories-0-10000", "title": "News Stories", "meta_data": {"description": "News stories: Excerpts from highly revealing major media news stories suggest major cover-ups of health, energy, media, 9/11, war, elections, and more. Links to original stories provided for easy verification.", "keywords": "news,articles,9/11,911,elections,energy,inventions,financial,global,warming,government,health,mass,media,,information,polls,able,danger,avian,flu,corporate,corruption,dolphins,whales,hurricane,katrina,income,inequality,inspirational,microchips,mind,control,nature,reality,non-lethal,nonlethal,privacy,secrecy,secret,societies,terrorism,ufos,vaccines,war", "og": {"title": "WantToKnow.info", "description": "Want to know the truth? Key media articles and reliable, information-packed summaries on major cover-ups for those who want to know the truth on health, banking, energy, media, elections, war, 9/11.", "image": "https://www.wanttoknow.info/m/images/wtk-og.jpg", "type": "article", "url": "https://www.wanttoknow.info/newsstories-0-10000"}, "viewport": "width=device-width, initial-scale=1", "ROBOTS": "INDEX,FOLLOW", "Revisit-after": "21 days", "rating": "general", "google-site-verification": "93poa4ULbuO4k4m5pcOzlCUyZF-QR_CMpiv-eFUo8sw"}, "movies": [], "publish_date": null, "source": "https://www.wanttoknow.info", "summary": ""}