{"url": "https://web.archive.org/web/20170815224727/http://www.baltimoresun.com/entertainment/tv/tv-lust/bs-fe-bachelor-in-paradise-recap-season-4-episode-1-story.html", "text": "Before we get to the “Bachelor in Paradise” premiere recap, a note from TV Lust’s longtime “Bachelor” franchise recapper, Abby Draper:\n\nSeason 4 of “Bachelor in Paradise” has begun, and for the first time in years, I will not be providing a snarky recap to TV Lust for you to read the morning after … when the haze of Paradise has (kind of) worn off.\n\nIt has been an absolute pleasure to share my thoughts with all of you every week. I appreciate your engagement, your support and, mostly, your reciprocated snark.\n\nI am absolutely certain Katy Primosch will do a wonderful job every week moving forward. I am excited to follow along.\n\nI am also always available anywhere on social media @abbydraper to discuss all things “Bachelor.” Or Tim Riggins.\n\nThank you, guys, for the fun. Don’t be a stranger. Now, back to your regularly scheduled recap:\n\nHi, my name is Katy, and I’m a Bachelor-holic. I’ll be taking the reins from the infamous Abby Draper for your “Bachelor” franchise recaps, and while I couldn’t possibly fill her shoes, I’ll fill my wine glass and hope for the best.\n\nWelcome to Season 4 of “Bachelor in Paradise.” After seeing the trailer for this season during last week’s “Bachelorette” finale, I’m left wondering how much ABC paid the standards department to look the other way on this season’s content. It is entirely possible that Chris Harrison’s ubiquitous promise of “the most dramatic season ever” may finally ring true.\n\nWe open to shots of an empty resort with dramatic music and audio clips of news stories about the “Bachelor in Paradise” production shutdown in the background. Chris Harrison strolls in and sounds downright cheerful, which is weird, because he’s here to give background about the “accusations and allegations” of potential sexual misconduct that led to a decision to halt production 2 1/2 days into filming. Chris explains that before addressing what happened, the show will recap what happened before production halted, and we begin the episode.\n\nTHE ENTRANCES\n\nRaven, the dark-haired dark horse from Nick’s season, is the first to enter. She drops every Bachelor Nation platitude in her first breath, and she’s looking for a Jade and Tanner love story, but a Carly and Evan one would be OK too. Ouch.\n\nDeanie-baby is next, and he might be wearing silk boxers instead of a swim suit.\n\nNext up is Kristina, the fan-favorite Russian beauty who is now a blonde. She says it feels like a 2-on-1 date, and there must be another boy coming next … which of course means another girl will arrive.\n\nDanielle M. enters and immediately ends every sentence with a comment about how hot Dean is.\n\nBen Z. joins the crew with an eye for Raven. He pulls her aside and launches in to a monologue about his dog and possibly his entire pet ownership history. He says his dog, Zeus, needs a dog mom, and even I, a crazy dog lady, am weirded out.\n\nFinally, we get a romantic embrace — between Dean and new-arrival Iggy.\n\nFormer Disney princess Jasmine arrives and is looking forward to meeting the guys from Rachel’s season, in particular.\n\nJack Stone, who everyone agrees is not just Jack but Jack Stone, appears and goes on the record that he is NOT a serial killer as everyone thought during Rachel’s season.\n\nThere’s a gap in my notes here, because Alexis walks up the beach path in her shark suit, and I’m laughing hysterically and screaming with joy. She is an American treasure.\n\nThere’s a break in the arrivals for everyone to grab a drink and begin gossiping. The ladies gather to discuss Demario and whether he really had a girlfriend while on Rachel’s season. They appear to be very anti-Demario, and say they hope he won’t show up, so of course … he shows up. Who would have thought?\n\nDemario wants to set everything straight, but he doesn’t really answer Chris Harrison’s questions, and he still refers to the events of last season as “happening to him.” He sees that Raven is clearly the pack leader and attempts to get to her to plead his case and show her he’s in paradise for the right reasons. Raven is conciliatory, but then the show cuts to an interview of her that shows she’s not quite buying it.\n\nAfter the heart-to-heart, Derek sneaks in and has to introduce himself as the one who cried on JoJo’s season, because no one saw him come in and no one knows who he is.\n\nHis frenemy and Chief Narrator, Alex, joins the cast. He’s excited to see his buddy Derek, who is simultaneously suggesting that Alex might be overcompensating for something.\n\nCorinne tells Chris Harrison she’s “Making Paradise Corinne Again,” and I’m not sure how that works, but I’m quickly distracted by Corinne’s stellar language skills. She learned how to say “nap,” “cheesy pasta,” and “champagne” in Spanish. She’s in charge and is ready to have a siesta fiesta.\n\n“Camel girl,” aka Lacey, joins the group, and Iggy is already interested. It seems to be reciprocated, but the dream is short-lived because, unfortunately, Lacey has to leave immediately to attend to a death in the family at home.\n\nVinny and Diggy make nondescript entrances and remain boring for the rest of the episode.\n\nWhile we wait for the remainder of the cast, we are treated to flirtation and a back massage between Demario and Corinne, and another cute chat between Dean and Kristina.\n\nAlex delivers some snark about guys who rely on gimmicks, just as Matt the penguin, and St. Nick arrive in their respective costumes. Not to be out-snarked, Matt says Nick’s Santa Claus beard is a cop-out and he should have gone for a full costume.\n\nImmediately, Nick confesses that he’s in paradise specifically to meet Jasmine and they have the first kiss of the day after a dare.\n\n“Bachelor in Paradise” veteran Amanda is back for another shot at love. Her engagement to World’s Worst Dude Josh Murray didn’t work out “because he’s a sweaty person.” She returns her Neil Lane engagement ring to Chris Harrison and (in my favorite moment of the night) he takes a sniff and says the ring smells like pizza.", "images": ["https://web.archive.org/web/20170815224727im_/http://www.trbimg.com/img-5991d259/turbine/bs-fe-mike-rowe-facebook-show-20170814/70/70x70", "https://web.archive.org/web/20170815224727im_/http://www.trbimg.com/img-5991d71d/turbine/bs-fe-game-of-thrones-episode-5-season-7/70/70x70", "https://web.archive.org/web/20170815224727im_/http://www.trbimg.com/img-59933669/turbine/bs-fe-bachelor-in-paradise-recap-season-4-episode-1", "https://web.archive.org/web/20170815224727im_/http://www.trbimg.com/img-5992fc92/turbine/bs-fe-liris-crosse-project-runway-20170811/70/70x70", "https://web.archive.org/web/20170815224727im_/http://pixel.sitescout.com/iap/796cee1a34239f32"], "top_img": "https://web.archive.org/web/20170815224727im_/http://www.trbimg.com/img-59933669/turbine/bs-fe-bachelor-in-paradise-recap-season-4-episode-1", "keywords": [], "authors": ["Katy Primosch"], "canonical_link": "https://web.archive.org/web/20170815224727/http://www.baltimoresun.com/entertainment/tv/tv-lust/bs-fe-bachelor-in-paradise-recap-season-4-episode-1-story.html", "title": "'Bachelor in Paradise' premiere recap: What happened before the shutdown", "meta_data": {"robots": "index,follow", "author": "Katy Primosch", "date": "2017-08-15", "copyright": "Copyright (c) 2017 Baltimore Sun", "Description": "The season premiere of \"Bachelor in Paradise\" alludes to the controversy that shut down production", "keywords": "Bachelor in Paradise, premiere, recap, controversy, shutdown, Corinne, Demario", "news_keywords": "Bachelor in Paradise, premiere, recap, controversy, shutdown, Corinne, Demario", "fb_title": "'Bachelor in Paradise' premiere recap: What happened before the shutdown", "og": {"title": "'Bachelor in Paradise' premiere recap: What happened before the shutdown", "description": "The season premiere of \"Bachelor in Paradise\" alludes to the controversy that shut down production", "type": "article", "url": "https://web.archive.org/web/20170815224727/http://www.baltimoresun.com/entertainment/tv/tv-lust/bs-fe-bachelor-in-paradise-recap-season-4-episode-1-story.html", "image": "https://web.archive.org/web/20170815224727im_/http://www.trbimg.com/img-59933669/turbine/bs-fe-bachelor-in-paradise-recap-season-4-episode-1", "site_name": "baltimoresun.com"}, "fb": {"page_id": 9299179711, "app_id": 310302989040998, "pages": 9299179711}, "twitter": {"card": "summary", "site": "@baltimoresun"}, "googlebot": "index", "googlebot-news": "index", "apple-itunes-app": "app-id=496681035, app-argument=http://www.baltimoresun.com/deeplinkid/94342563", "viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, minimum-scale=1.0, user-scalable=no", "x-servername": "i15prod-3c1c3e6-0-199.1", "so": {"status": "5,1"}}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}