{"url": "https://www.thebalancecareers.com/how-to-become-a-victoria-s-secret-model-2379407", "text": "Once the scout has placed a model with an agency, the agents and bookers take over. An agent and booker are used interchangeably and are usually the same role. The agents and bookers will book the jobs, handle the model’s “chart,” and manage the model to achieve not only the best jobs but also jobs that are conducive to the model’s brand and career goals.\n\nIt's important to clarify the difference between a scout, an agent, and a booker. Scouts typically scout new faces and present them to either the model agency that employs them or to a variety of different modeling agencies. Should one or more of the agencies want to contract the model, the scout should have the knowledge to guide the model as to the best choice of agency for their particular goals. Scouts are always scouting, and models can be discovered anywhere from shopping malls, airports, on the beach, or at organized events.\n\nAs fun and glamorous as the life of a model scout, agent, or booker can be, it can also mean a lot of time in airports and hotels, handling cranky models and difficult clients, very long hours, and a lot of disappointment when things don't go as planned.\n\nA career as a model scout, agent, or booker can be a fun and exciting career. It’s a career that often involves a lot of travel, attending spectacular fashion shows and events, and if you’re lucky, working with famous models, fashion designers, photographers, and other celebrities.\n\nHave a Passion for the Industry PeopleImages / DigitalVision / Getty Images If you attempt a career as a scout, agent, or booker without having a passion for the industry, you’ll burn out quickly. The most successful scouts and agents are the ones who can’t imagine doing anything else, and it’s their passion that helps them through the rough times. The modeling industry is not all glitz and glamor, and it takes a tremendous commitment and a lot of hard work to succeed.\n\nStudy the Business and its History Learn about the modeling business and its history. The popular saying - \"to know where you are going, you have to know where you've been,\" is true even in the modeling industry. Know who founded the major agencies and who currently runs them. Know the names and faces of the early superstars such as Twiggy, Jean Shrimpton, Lauren Hutton, Beverly Johnson, Carmen Dell'Orefice and others who led the way for today's superstars. And study what made those models so successful. Know the names and faces of today's superstars as well as the up and coming models. Show potential employers that you have taken the time to learn the business and that you can apply that knowledge to scouting talent.\n\nKnow the Lingo Be sure you know and understand the meaning of modeling terms and phrases such as \"time for prints,\" buyouts, vouchers, and comp cards. Don't expect the agencies to teach you the basics such as commonly used modeling terms.\n\nWork as an Intern or an Assistant In many of the big agencies, and in particular talent agencies, the only way that a wannabe agent can break into the industry is to work as an unpaid intern or an assistant. Many of Hollywood's mega agents and moguls including David Geffen (estimated net worth $6 billion), Barry Diller, and Michael Ovitz started their careers working in the mailroom. A definite must-read for anyone serious about becoming an agent should be the book The Mailroom: Hollywood History from the Bottom Up by David Rensin. Be willing to start on the ground floor and work your way up to a position as a scout, agent, or booker. By immersing yourself in the industry, you'll gain a solid understanding of how model agencies function, the scouting and booking process, as well as meeting valuable contacts in the industry.\n\nFocus on One Type of Model Until you have been working in the industry for a while, it's best to specialize in one area and become an expert in that area. Decide where to focus your energies, which should be what interests you, whether it's representing only female editorial models, male models, child models, or swimsuit models. By honing in on one type of model, you'll become a specialist and the go-to person for that type of model or talent.\n\nAttend Conventions and Networking Events If you want to work on an international level, it's important that you meet and network with agents and scouts from the agencies with which you'd like to sign your models. The International Modeling & Talent Association (IMTA) hosts modeling conventions in New York and Los Angeles annually. A less expensive option is the Faces West Conference in Vancouver, Canada.\n\nUnderstand Basic Contract Law It's certainly not necessary to have a law degree to be an agent. However, you should have a basic understanding of contract law and how to negotiate contracts. There are many great online resources that teach basic contract law for little or no cost. There are also more focused types of resources such as the book Hollywood Dealmaking - Negotiating Talent Agreements by Dina Appleton and Daniel Yankelevits.\n\nBe Willing to Take Risks Becoming a successful model scout or agent means being willing to take risks. You'll have to approach strangers in various locations who you think have modeling potential in order to build your client base. For example, Gisele Bündchen, in an interview with Vogue Magazine, said she was discovered as a teenager while sitting with her friends at McDonald's. If you truly believe in a new model's potential don't be afraid to negotiate \"time for prints\" or other special deals with photographers or clients in your area. You also need to be willing to work on a commission basis. Most model scouts and agents do not earn a salary but rather a commission based on a percentage of what their model earns.\n\nAlways Behave in a Professional Manner Being a professional means more than just calling yourself an agent or model scout and setting up shop. It means behaving professionally by keeping your appointment times, always taking the high road in difficult situations, and never bad-mouthing other agents or scouts. Also, you'll need to pay your expenses and payroll on time and never owe money to your models, photographers or others whose services you've employed. While the industry may have a relaxed image, to be a successful agent, scout or booker you need to be all business.\n\nInappropriate Behavior As in any professional setting, never make inappropriate or sexually suggestive comments, or approach or stare at a model in a way that will make them feel uncomfortable. The very nature of the industry can make even the most innocent of behaviors appear creepy and even scary to a young model.", "images": ["https://www.liveabout.com/thmb/mH0Rj3MWyqrNQpLFgCCq0Lw70Dk=/250x0/filters:no_upscale():max_bytes(150000):strip_icc()/beautiful-woman-163519061-5b3b8799c9e77c0037f8cef0.jpg", "https://www.liveabout.com/thmb/7q4UWFog9ndmV87u2T-z5_pTxrs=/250x0/filters:no_upscale():max_bytes(150000):strip_icc()/modeling-auditions-casting-open-calls-565b9f8c3df78c6ddf5c146d.jpg", "https://www.liveabout.com/thmb/0LUHf_4qEhzbz-HcCQgimsm98T8=/250x0/filters:no_upscale():max_bytes(150000):strip_icc()/modeling-470747773-5b09a5f8ff1b780036c1b1f3.jpg", "https://www.liveabout.com/thmb/417R15cjitS6IVjtQ80cbYI1eH8=/250x0/filters:no_upscale():max_bytes(150000):strip_icc()/modeling-schools-56a6314b3df78cf7728bc4e9.jpg", "https://www.liveabout.com/thmb/3ejyGS30aSMfIAJFJVlNMRE6zSk=/250x0/filters:no_upscale():max_bytes(150000):strip_icc()/she-s-got-style-517872559-5945d95d5f9b58d58a20b09a.jpg", "https://www.liveabout.com/thmb/mdBkDp6opTmUuqs4vPgifcFCYyI=/250x0/filters:no_upscale():max_bytes(150000):strip_icc()/elite-model-look-56a631403df78cf7728bc4ae.jpg", "https://www.liveabout.com/thmb/l_ohDpEOU2vwW6VMBixnNYf8u4g=/250x0/filters:no_upscale():max_bytes(150000):strip_icc()/male-photographer-photographing-female-model-on-studio-white-background-723498785-596a7ca73df78c57f4a64546.jpg", "https://www.liveabout.com/thmb/QqJsBuKm3_aETWQYl0VS12NtFRI=/250x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-452699391-58bd7c2e5f9b58af5cacf029.jpg", "https://www.liveabout.com/thmb/gfUcK5VHhW5guwsUmhPRyarNNC0=/250x0/filters:no_upscale():max_bytes(150000):strip_icc()/fashion-model-on-runway-564721427-5ac1d73beb97de0037dd551c.jpg", "https://www.liveabout.com/thmb/8DuHgt46lvXLhsXNDqufMut0oy8=/250x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-605716434-58bdcb553df78c353cb4d38b.jpg", "https://www.liveabout.com/thmb/Nt7xDilBjs3cmRIIRzPfVIsArxk=/250x0/filters:no_upscale():max_bytes(150000):strip_icc()/451993640-56a630ce5f9b58b7d0e0553f.jpg", "https://www.liveabout.com/thmb/V_EFtud7jz-nQEwKvz61qSUYYM0=/250x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-611310330-58c478835f9b58af5cc138fd.jpg", "https://www.liveabout.com/thmb/Gfu_zgCVSt3iipFKMSCHt3QmiUg=/250x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-sb10062194j-002-58941d1d3df78caebc474ef8.jpg", "https://www.liveabout.com/thmb/hgsIf6h6GBCWIfs2sYSNGzaQ-1w=/250x0/filters:no_upscale():max_bytes(150000):strip_icc()/pregnancy-maternity-pregnant-model-56a6314e3df78cf7728bc4ef.jpg", "https://www.liveabout.com/thmb/5fmhEvxYjOk7js6rErwxgTJmpWU=/250x0/filters:no_upscale():max_bytes(150000):strip_icc()/eileenford2-56a630c73df78cf7728bc242.jpg", "https://www.liveabout.com/thmb/rrXJVY9U0z4SXP47x-qBja6jJS4=/250x0/filters:no_upscale():max_bytes(150000):strip_icc()/modeling-beauty-headshot-571aaa9e5f9b58857d01dd99.jpg", "https://www.liveabout.com/thmb/-aNCSoBRc7Pe40NXYBLoXVigVZQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/model_scout-472050461-5a0e470f22fa3a003691b4d4.jpg"], "top_img": "https://www.liveabout.com/thmb/-aNCSoBRc7Pe40NXYBLoXVigVZQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/model_scout-472050461-5a0e470f22fa3a003691b4d4.jpg", "keywords": [], "authors": ["Vanessa Helmer", "Vanessa Helmer Has Over Years Of Experience In The Modeling Industry. She Is A Model Scout", "Agent Who Has Owned Several Successful International Modeling Agencies. Vanessa Is The Owner", "Founder Of Modelscouts.Com.", "Learn About Our", "Editorial Process"], "canonical_link": "https://www.liveabout.com/start-a-career-as-a-model-scout-agent-or-booker-2379476", "title": "Start a Career as a Model Scout, Agent, or Booker", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "You can become a model scout, agent, or booker. Here are 11 tips to learn the industry, build contacts, and kick start your career.", "emailcontenttype": "LISTSC", "emailvertical": "LIVEABOUT", "sailthru.author": "Vanessa Helmer", "sailthru.tags": "careers,career-paths,entertainment-careers", "parsely-section": "Careers", "parsely-tags": "Careers,Career Paths,Entertainment Careers", "article": {"section": "LiveAbout"}, "fb": {"app_id": 233430483833280}, "og": {"type": "article", "site_name": "LiveAbout", "url": "https://www.liveabout.com/start-a-career-as-a-model-scout-agent-or-booker-2379476", "title": "Become a Model Scout with These 11 Tips to Kick Start Your Career", "description": "You can become a model scout, agent, or booker. Here are 11 tips to learn the industry, build contacts, and kick start your career.", "image": "https://www.liveabout.com/thmb/-aNCSoBRc7Pe40NXYBLoXVigVZQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/model_scout-472050461-5a0e470f22fa3a003691b4d4.jpg"}, "twitter": {"card": "summary_large_image", "site": "@liveaboutcom", "title": "Become a Model Scout with These 11 Tips to Kick Start Your Career", "description": "You can become a model scout, agent, or booker. Here are 11 tips to learn the industry, build contacts, and kick start your career.", "image": "https://www.liveabout.com/thmb/-aNCSoBRc7Pe40NXYBLoXVigVZQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/model_scout-472050461-5a0e470f22fa3a003691b4d4.jpg"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/3.168.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/3.168.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/3.168.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/3.168.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/3.168.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "https://www.thebalancecareers.com", "summary": ""}