{"url": "https://web.archive.org/web/20220901154803/http://www.newslocker.com/en-us/news/celebrity/vin-diesel-takes-the-eq-in-42-further-proves-hes-the-cuddliest-action-star-ever/", "text": "Tig Notaro Joins 'The Morning Show' for Season Three Tig Notaro is the latest star to join the cast of The Morning Show!\n\nOn Wednesday (August 31), it was announced that the 51-year-old comedian/actress had landed a major recurring role in the upcoming third season of the Apple TV+ series.\n\nClick inside to find out more about her role…\n\nAccording to E! News, Tig will be playing Amanda Robinson, “the chief of staff to corporate titan Paul Marks.”\n\nEarlier this month, it was announced that Jon Hamm had joined the cast of The Morning Read more\n\n'RHONJ's Jackie Goldschneider Demoted as Newbie Rachel Fuda Lands Full-Time Slot There’s a big cast shakeup going on in New Jersey.\n\nAhead of the season 13 premiere of The Real Housewives of New Jersey, it was been revealed that Jackie Goldschneider has been demoted to a “Friend Of” role.\n\nClick inside to read more…\n\nNewbie Rachel Fuda has now taken over the full-time slot from Jackie, who first joined the show in season nine, Page Six reports.\n\nAccording to sources, Jackie, Rachel, and another new girl named Jennifer “Jenn” Fessler “c Read more\n\nJosh Duhamel Runs An Intense Hockey Summer Camp in 'Mighty Ducks: Game Changers' Season 2 The first trailer for season two of The Mighty Ducks: Game Changers is here!\n\nThe series will bring back Lauren Graham with Brady Noon, Maxwell Simkins, Swayam Bhatia, Luke Islam, Taegen Burns, and DJ Watts.\n\nJosh Duhamel and Naveen Paddock have joined the Disney+ series in major roles for the new season.\n\nHere’s a quick summary of what to expect in the series: After winning back the Mighty Ducks team name last year, our squad-with-heart and their coach Alex Morrow (Graham) take to the road Read more\n\nGigi & Bella Hadid Head to U.S. Open 2022 to Cheer on Serena Williams The Hadid sisters are on their way to the 2022 U.S. Open!\n\nGigi and Bella Hadid made their way out of an apartment building to their waiting ride to take them to the tennis tournament on Wednesday (August 31) in New York City.\n\nPHOTOS: Check out the latest pics of Gigi Hadid\n\nFor the match, Gigi, 27, sported an all red outfit while Bella, 25, wore a white zip-up jacket paired with a tan skirt.\n\nThe model sisters were heading to the Open to cheer on their pal Serena Williams as she faced off against Read more\n\nMaxim Baldry Reveals How His Isildur Will Be More Relatable in 'Rings of Power' Maxim Baldry is filling up some pretty big shoes as Isildur in The Lord of the Rings: The Rings of Power.\n\nThe 26-year-old actor steps into the iconic role for the Prime Video series, where fans will see the origins of the character who many know from his decision of keeping the ring he cut from Sauron’s hand in the book series.\n\nIn a new interview, Maxim opened up about making his Isildur more relatable in the show.\n\nClick inside… Read more\n\nAshley Judd Seeks Privacy Protections Of Those Impacted By Suicide Following Mom Naomi’s Death Ashley Judd is pushing for more privacy protection for the family members and close loved ones impacted by suicide.\n\nThe 54-year-old actress opened up in a new essay for The New York Times, recalling the details surrounding her mother, Naomi Judd‘s death earlier this year.\n\nAshley, her sister Wynonna Judd, and Naomi‘s husband, Larry Strickland, filed a motion to seal any records surrounding her death after news of Naomi‘s will had been made public.\n\nClick inside to read more&hell; Read more\n\nAvril Lavigne Says Getting Star on Hollywood Walk of Fame is 'Dream Come True' It’s a very big day for Avril Lavigne!\n\nThe 37-year-old “Sk8er Boi” singer was honored with a star on the Hollywood Walk of Fame on Wednesday (August 31) in Los Angeles.\n\nAvril got support at the event from fiance Mod Sun and longtime friends Machine Gun Kelly and Joel Madden.\n\nTo the event, Avril brought along a photo of herself when she first visited Hollywood at 16-years-old when she started her music career.\n\nClick inside to read more…\n\n“I mean, to get a star today Read more\n\nKim Kardashian Strikes a Pose in Balenciaga Winter 2022 Campaign Kim Kardashian is starring in Balenciaga‘s new fashion campaign!\n\nOn Wednesday (August 31), the fashion brand released their new Winter 2022 Campaign featuring the 41-year-old reality star as one of models for the new collection.\n\nClick inside to read more…\n\nIn one campaign photo, Kim is posing in the skintight, electric blue dress that she wore to Vanity Fair’s Oscars After Party back in March.\n\nIn another photo, Kim is wearing a yellow, floral print ensemble and sunglasses.\n\nOth Read more\n\nLuke Volker Speaks Out After Fiancée Charlbi Dean's Sudden Passing Luke Volker has broken his silence after the sudden passing of his fiancée, Charlbi Dean.\n\nAccording to reports, Charlbi, passed away on Monday (August 29) after an “unexpected sudden illness.” She was just 32.\n\nFollowing the news of her death, Luke took to social media with a message for fans.\n\nClick inside to read more…\n\nLuke thanked fans who shared messages of sympathy and support in the wake of Charlbi‘s passing\n\n“Hi, everyone. I wanted to just post a pictur Read more\n\nAlexis Bledel & Vincent Kartheiser Finalize Their Divorce Just Weeks After Announcing Split Alexis Bledel and Vincent Kartheiser are officially divorced.\n\nThe celebrity couple filed for divorce earlier this month, and just weeks later, their split is final, according to People.\n\nVincent was the one who filed for divorce from Alexis with the Putnam County Supreme Court in New York, just a couple of weeks ago and their split was fast tracked in the system.\n\nThe couple secretly tied the knot in 2014 in Ojai, Calif., after first meeting while working together on the set of Mad Men.\n\nAlexis an Read more\n\nJennifer Lawrence Holds Hands with Husband Cooke Maroney During Walk in the Park Jennifer Lawrence is enjoying the sunny weather with her husband.\n\nThe 32-year-old Don’t Look Up actress and Cooke Maroney held hands while out on a walk around Abingdon Square on Wednesday afternoon (August 31) in New York City.\n\nPHOTOS: Check out the latest pics of Jennifer Lawrence\n\nFor their outing, Jennifer looked cool in a white T-shirt and tan pants while her art dealer husband wore a white T-shirt paired with blue pants.\n\nEarlier this month, Jennifer was seen meeting up with one of he Read more\n\nBroadway's 'Almost Famous' Musical, Starring Chris Wood & Solea Pfeiffer, Begins Rehearsals - See Photos! The musical version of the beloved movie Almost Famous is coming to Broadway this fall and rehearsals have officially begun!\n\nChris Wood and Solea Pfeiffer are starring in the musical as Russell Hammond and Penny Lane, the roles originated by Billy Crudup and Kate Hudson.\n\nThe musical will also star Casey Likes as William Miller, Anika Larsen as Elaine Miller, Drew Gehling as Jeff Bebe, and Rob Colletti as Lester Bangs.Cameron Crowe, who wrote and directed the movie, wrote the book and lyrics for Read more\n\nJodie Turner-Smith Turns Heads in Sparkly Gucci Gown at 'White Noise' Premiere in Venice Jodie Turner-Smith has a major fashion moment on the red carpet at the premiere of White Noise during the 2022 Venice Film Festival on Wednesday (August 31) in Venice, Italy.\n\nThe 35-year-old actress stunned in a gorgeous and sparkly Gucci gown, accessorized with bright green opera length gloves and regal emerald jewelry.\n\nJodie joined her co-stars Adam Driver, Greta Gerwig,Don Cheadle, Raffey Cassidy, Sam Nivola, May Nivola, and their director Noah Baumbach.\n\nGuests at the premiere and opening ce Read more\n\n'Rings of Power' Star Morfydd Clark Reveals How To Pronounce Her Name Correctly There are many celebrity names out there that will get you tongue tied, and Morfydd Clark‘s might be one.\n\nThe 33-year-old actress, who is about to hit your screens in The Lord of the Rings: The Rings Of Power as Galadriel, has revealed just how to pronounce her name.\n\nClick inside to read more…\n\nIn a recent interview where she was promoting another project of hers, Morfydd broke her name down for a reporter.\n\n“It’s all voiced,” she explained, adding that there is a & Read more\n\nLeonardo DiCaprio's 10 Best Movies, Ranked Leonardo DiCaprio is a Hollywood veteran.\n\nThe 47-year-old actor is responsible for starring in some of the most beloved films of our time, and he’s paved an impressive path in the film industry with his choices for challenging, interesting roles.\n\nHe’s also a heavily decorated actor, having earned himself an Academy Award, a BAFTA, and three Golden Globe Awards, among many other prestigious awards. His films have grossed well over $7 billion worldwide, and he’s known as one of Read more\n\nHallmark Channel Adds More Movies To 'Fall Into Love' Event in October 2022 Hallmark Channel has released the full lineup of movies coming in October!\n\nThe network has lined up a handful of cozy new romantic films for fans as the new season approaches.\n\nFan favorites Tamera Mowry-Housley, Teri Hatcher, Taylor Cole and Aimee Teegarden will be starring in some of the films, too, which are all part of the network’s “Fall Into Love” programming event.\n\nClick inside to get all the details about Hallmark Channel’s Fall Into Love October 2022 lineup&helli; Read more", "images": ["https://web.archive.org/web/20220901154804im_/https://media-cldnry.s-nbcnews.com/image/upload/rockcms/2022-08/Neena-Pacholke-2x1-te-220830-7fcad5.jpg", "https://web.archive.org/web/20220901154804im_/https://media-cldnry.s-nbcnews.com/image/upload/rockcms/2022-08/220830-mikhail-gorbachev-jm-1639-74e811.jpg", "https://web.archive.org/web/20220901154804im_/https://media-cldnry.s-nbcnews.com/image/upload/rockcms/2022-08/lisa-laflamme-bw-220830-931da9.jpg", "https://web.archive.org/web/20220901154804im_/https://www.newslocker.com/images/share-linkedin.png", "https://web.archive.org/web/20220901154804im_/https://static.addtoany.com/buttons/share_save_120_16.gif", "https://web.archive.org/web/20220901154804im_/https://www.newslocker.com/images/share-twitter.png", "https://web.archive.org/web/20220901154804im_/https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2022/08/1200/675/portman.jpg?ve=1&tl=1", "https://web.archive.org/web/20220901154804im_/https://www.newslocker.com/images/newslocker-logo.png", "https://web.archive.org/web/20220901154804im_/https://www.newslocker.com/images/newslocker-cube.png", "https://web.archive.org/web/20220901154804im_/https://www.newslocker.com/images/share-facebook.png", "https://web.archive.org/web/20220901154804im_/http://akns-images.eonline.com/eol_images/Entire_Site/2017324/rs_600x600-170424165859-600.Vin-Diesel-F8.ms.042417.jpg?downsize=450:*&crop=450:350;left,top", "https://web.archive.org/web/20220901154804im_/https://www.newslocker.com/images/rss.png"], "top_img": "https://web.archive.org/web/20220901154804im_/http://akns-images.eonline.com/eol_images/Entire_Site/2017324/rs_600x600-170424165859-600.Vin-Diesel-F8.ms.042417.jpg?downsize=450:*&crop=450:350;left,top", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20220901154804/https://www.newslocker.com/en-us/news/celebrity/vin-diesel-takes-the-eq-in-42-further-proves-hes-the-cuddliest-action-star-ever/", "title": "Vin Diesel Takes the E!Q in 42, Further Proves He's the Cuddliest Action Star Ever", "meta_data": {"description": "We all know Vin Diesel eats bad guys for breakfast, but that's not all.He eats oatmeal with a banana, too!The star of the global blockbuster The Fate of the Furious and...", "og": {"title": "Vin Diesel Takes the E!Q in 42, Further Proves He's the Cuddliest Action Star Ever - Celebrity news - NewsLocker", "description": "We all know Vin Diesel eats bad guys for breakfast, but that's not all.He eats oatmeal with a banana, too!The star of the global blockbuster The Fate of the Furious and...", "type": "website", "url": "https://web.archive.org/web/20220901154804/https://www.newslocker.com/en-us/news/celebrity/vin-diesel-takes-the-eq-in-42-further-proves-hes-the-cuddliest-action-star-ever/", "image": "https://web.archive.org/web/20220901154804im_/http://akns-images.eonline.com/eol_images/Entire_Site/2017324/rs_600x600-170424165859-600.Vin-Diesel-F8.ms.042417.jpg?downsize=450:*&crop=450:350;left,top", "site_name": "Newslocker"}, "fb": {"admins": 1335791813}, "robots": "index", "google-site-verification": "wAInSoPxz3OEgOXCHtETx-x7ukmlX40FRoiPZpO7ww4", "msvalidate.01": "2F0DB39856FAA0E47C70E9E1FF8653AA"}, "movies": [], "publish_date": 1493125200.0, "source": "https://web.archive.org", "summary": ""}