{"url": "https://web.archive.org/web/20180208005818/https://www.haaretz.com/us-news/how-donald-trump-lost-the-war-on-christmas-1.5629520", "text": "U.S. President Donald Trump has long positioned himself as a front-line soldier in the so-called War on Christmas, which made non-Christians justifiably nervous as they anticipated his administrations first holiday season as a religiously charged, exclusionary and divisive affair.\n\nTo really understand Trump and the Middle East - subscribe to Haaretz\n\nskip - Thank You, President Trump\n\nIndeed, days before the holiday, a pro-Trump video featuring a little blonde girl lisping Thank you, President Trump, for letting us say Merry Christmas again, as if the words had somehow been previously banned or outlawed.\n\nskip - christmas proud\n\nPeople are proud to be saying Merry Christmas again. I am proud to have led the charge against the assault of our cherished and beautiful phrase. MERRY CHRISTMAS!!!!! — Donald J. Trump (@realDonaldTrump) December 25, 2017\n\n>>Netanyahu enlists in Trump's army: \"Israel is a country that says 'Merry Christmas'\"\n\nAnd then on Christmas Eve, Trump tweeted that he was \"proud\" to have beaten back what he called an \"assault\" on the holiday.\n\nKeep updated: Sign up to our newsletter Email * Please enter a valid email address Sign up Please wait… Thank you for signing up. We've got more newsletters we think you'll find interesting. Click here Oops. Something went wrong. Please try again later. Try again Thank you, The email address you have provided is already registered. Close\n\nThe War on Christmas catchphrase was coined by former Fox News host Bill OReilly, who claimed in 2004 that Christmas was under siege by secular progressives. It was triggered when the department store Macys decided not to greet customers with Merry Christmas but to wish them Happy Holidays instead.\n\nOReilly seized on that as an example of an organized effort to eliminate Christian religious symbols in American public life. He and other right-wing commentators were following in the footsteps of a tradition dating back to the 1950s and the far-right John Birch Society, which claimed a communist conspiracy was hell-bent on taking the Christ out of Christmas, also blaming \"fantatics\" at the UN for trying to \"poison the 1959 Christmas season with their high-pressure propaganda.\"\n\n>>Ex-Marine who plotted San Francisco Christmas attack claims he was angry about Trump 'giving Jerusalem to the Jews'\n\nskip - Trump Christmas tweet\n\nThis is your land, this is your home, and it's your voice that matters the most. So speak up, be heard, and fight, fight, fight for the change you've been waiting for your entire life!\n\n\n\nMERRY CHRISTMAS and THANK YOU Pensacola, Florida! pic.twitter.com/geWGzpzRp6 — Donald J. Trump (@realDonaldTrump) December 9, 2017\n\nEven before entering politics, Trump declared that so-called political correctness in the name of inclusivity and separation of church and state had gone too far. In 2011, Trump went as far as to falsely accuse then-President Barack Obama of failing to send Christmas greetings, while remembering to mark the African festival of Kwanzaa.\n\nIn part of his effort to rally evangelical Christians to his camp, Trump made the issue a running theme during his 2016 presidential election campaign, repeatedly promising at his rallies that he would bring back the phrase Merry Christmas.\n\nskip - Sarah Huckabee Sanders\n\n>>The Palestinians just gave Netanyahu what he always wanted for Christmas | Analysis\n\nskip - Sanders reaction 1\n\nNo one else find it oddly concerning at WH press conference today Sarah Sanders started with bringing up Christmas as “ birth of our savior “.....not all Americans would agree that this was appropriate place to discuss her religion — Karen Delaney (@KarenDelaney9) December 7, 2017\n\nskip - Sanders reaction 2\n\n@PressSec The stories of giving & of stepping up were inspirational, as you intended. I was, however, taken aback by your giving testimony about your savior being born, as part of your government role. Thank you for listening to my comment. https://t.co/1iVESWTuiZ — JewishConnectivity (@JewishConnectiv) December 7, 2017\n\nIn November 2015, Trump made headlines by proposing a boycott of Starbucks as punishment for manufacturing a red and white holiday cup that wasnt explicitly Christmassy enough, promising a booing audience: If I become president, were all going to be saying Merry Christmas again. That I can tell you.\n\nIn his 2016 post-election victory lap around the country, his travels were officially dubbed the Merry Christmas USA 2016 Victory Tour. A year later, at a rally in Pensacola, Florida, Merry Christmas was front and center once again.\n\nskip - Daniel Shapiro tweet\n\nLove that Trump’s proclamation on Jerusalem is dated 2017 “in the year of our Lord”. I worked hard (with mixed success) to get that standard formulation out of White House proclamations aimed at the Jewish community when I worked there. pic.twitter.com/GKZ2s82kKT — Dan Shapiro (@DanielBShapiro) December 7, 2017\n\nBut despite all the hoopla, there has been little explicitly Christian content crossing the church-state line in the Trump era that could truly upset non-Christians.\n\nThere were a few warning signs earlier this month, though. White House Press Secretary Sarah Huckabee Sanders, the daughter of evangelical leader and former Gov. Mike Huckabee, invoked Christian belief during her briefing on December 7, with a tale designed to shine a spotlight on seasonal generosity. She related the story of St. Matthews Episcopal Church in Wheeling, West Virginia, which follows a century-old tradition of helping families who cant afford Christmas toys for their children. While Sanders story itself did not contain religious content or exclude non-Christians, the message she attached to it was undeniably sectarian. She said that such stories are important because they remind us what this season is all about and thats the greatest gift of all, that a savior was born.\n\nSanders message raised eyebrows and comment on social media.\n\nskip - Ivanka Trump tweet\n\nAnother small but significant sign of change was spotted by former White House aide and former ambassador to Israel Daniel B. Shapiro, who pointed out that the proclamation declaring Jerusalem to be Israels capital signed by Trump had been worded to state that the event was taking place on this sixth day of December, in the year of our Lord two thousand seventeen.\n\nskip - Ivanka's defiance\n\nTRUMP’s DAUGHTER IS AGAINST CHRISTMAS!!! WHAT WILL FOX NEWS DO?“Happy Holidays!” Ivanka Trump, White House adviser, tweeted earlier this month, adding a kissy-face emoji. She dared do this in a tweet that included a photo of her posing in front of Christmas trees. — Joan Strong (@TruthInJeopardy) December 23, 2017\n\nShapiro noted on Twitter that during his years in the Obama White House, he had worked hard (with mixed success) to get that standard formulation out of White House proclamations aimed at the Jewish community. He was referring to the standard language for presidential proclamations, which explicitly state the number of years since the birth of Jesus Christ, marking the start of the Gregorian calendar.\n\nskip - Eric Trump tweet\n\nBut as the weeks passed and Christmas neared, there wasnt much to justify concerns that the Trump White House would be transformed into an overtly Christian observance, excluding other religious traditions.\n\nTrue, the Trump Hanukkah party was smaller, more low-key and more partisan than past celebrations in the Bush and Obama White Houses. But the tradition of holding a Hanukkah celebration only began during the second Bush administration, so Trump presumably could have gotten away with eliminating it – though that might not have sat well with daughter Ivanka and son-in-law Jared Kushner.\n\nIndeed, Ivanka Trumps Twitter feed was one of the clearest indicators that the return to Merry Christmas message had not penetrated the culture very deeply.\n\nShe seemed to quite deliberately choose to wish her five million Twitter followers Happy Holidays! with no mention of the C-word, in what some viewed as outright defiance of her fathers War on Christmas rhetoric.\n\nFor those who would chalk up Ivankas Christmas-less greeting to the fact she is Jewish, there was further evidence of the cultural zeitgeist with the fact her younger brother Eric also stayed ecumenical in wishing the best from Trump Winery.\n\nEven Melania Trumps much publicized – and much maligned – choices for decorating the White House felt more pagan than overtly Christian, with many white branches and relatively few representations of the Virgin Mary and baby Jesus. Yes, there was a crche display in the White House, but there had been one throughout the Obama administration, despite false rumors to the contrary.\n\nAll of this demonstrates the fact that while Trumps enthusiastic crusade against what he characterizes as a nefarious anti-Merry Christmas and pro-Happy Holidays conspiracy may play well with his base, his obsession with the issue isnt at all reflective of mainstream America.\n\nThat feeling is born out with a newly released Pew Research Center survey, which found that far fewer Americans care about being explicitly wished a Merry Christmas than they had in the past.\n\nThe Pew poll reported: A rising share of Americans say they do not have a preference about how they are greeted in stores during the holiday season, while a declining percentage prefer to have stores greet them with Merry Christmas.\n\nskip - Politicization of Christmas\n\nI now no longer know if people wishing me a Merry Christmas want me to have a merry Christmas or fashion themselves aggressive foot soldiers in what they perceive to be the War on Christmas. — Keith Phipps (@kphipps3000) December 23, 2017\n\nAccording to the survey, Americans were previously split down the middle when it came to expressing a preference for Merry Christmas over an alternative greeting when they were asked about it more than a decade ago and again in 2012.\n\nskip - Feraz Ozel tweet\n\n‘My Muslim family has been happy to say Merry Christmas’ — Comedian Feraz Ozel is proving once and for all that the ‘War on Christmas’ doesn’t actually exist pic.twitter.com/Se6dEVvQxJ — NowThis (@nowthisnews) December 22, 2017\n\nThis year, more than half of the U.S. public surveyed, 52 percent, told pollsters that a business choice of holiday greeting did not matter to them, while just a third – 32 percent – said they preferred that stores and businesses greet customers with Merry Christmas during the holidays.\n\nOverall, the Pew survey pointed to the fact that Trumps election does not reflect a surge in Christian religiosity in America. In fact, it found the religious aspects of Christmas were markedly declining.\n\nThe number of Americans who believe that the biblical account of the birth of Jesus depicts actual events is shrinking, it said, and a declining majority says religious displays such as nativity scenes should be allowed on government property.\n\nIts nothing new for Trump to appeal to his core base, and presumably his War on Christmas obsession shores up his status with evangelicals – even as it flies in the face of the sentiments of the majority of Americans, who seem happy to celebrate any holiday and dont care much how its expressed. For many, the politicization of what is supposed to be a greeting of seasonal cheer is simply confusing.\n\nIn a blow to the War on Christmas theory from one of Trumps least favorite religious minorities, comedian Feraz Ozel compiled video of Muslim-American families wishing their countrymen a Merry Christmas in order to demonstrate that non-Christians were just fine with the phrase.\n\nPlenty of Muslims and brown folks from different religions are still happy to wish you a Merry Christmas if the time is right, Ozel said. Just because some people say Happy Holidays to people who dont celebrate it doesnt mean that were not happy to wish you a very Merry Christmas also.", "images": ["https://web.archive.org/web/20180208005818im_/https://www.facebook.com/tr?id=801998859871552&ev=NoScript", "https://web.archive.org/web/20180208005818im_/https://images.haarets.co.il/image/upload/w_339,h_191,q_auto,c_fill,f_auto/fl_any_format.preserve_transparency.progressive:none/v1510666500/1.4604084.3694361761.png", "https://web.archive.org/web/20180208005818im_/https://images.haarets.co.il/image/upload/w_1883,h_1413,x_88,y_0,c_crop,g_north_west/w_168,h_126,q_auto,c_fill,f_auto/fl_any_format.preserve_transparency.progressive:none/v1517741930/1.5787894.3636750239.jpg", "https://web.archive.org/web/20180208005818im_/https://images.haarets.co.il/image/upload/w_1958,h_1468,x_0,y_0,c_crop,g_north_west/w_168,h_126,q_auto,c_fill,f_auto/fl_any_format.preserve_transparency.progressive:none/v1517142943/1.5768707.2864711429.jpg", "https://web.archive.org/web/20180208005818im_/https://images.haarets.co.il/image/upload/w_1370,h_1027,x_190,y_12,c_crop,g_north_west/w_168,h_126,q_auto,c_fill,f_auto/fl_any_format.preserve_transparency.progressive:none/v1517990703/1.5799665.3370957073.jpg", "https://web.archive.org/web/20180208005818im_/https://images.haarets.co.il/image/upload/w_2195,h_1646,x_5,y_141,c_crop,g_north_west/w_168,h_126,q_auto,c_fill,f_auto/fl_any_format.preserve_transparency.progressive:none/v1517761634/1.5788494.4294100170.jpg", "https://web.archive.org/web/20180208005818im_/https://t.co/i/adsct?txn_id=l6ar9&p_id=Twitter&tw_sale_amount=0&tw_order_quantity=0", "https://web.archive.org/web/20180208005818im_/https://images.haarets.co.il/image/upload/w_1381,h_1035,x_82,y_6,c_crop,g_north_west/w_168,h_126,q_auto,c_fill,f_auto/fl_any_format.preserve_transparency.progressive:none/v1516281615/1.5746051.100674980.jpg", "https://web.archive.org/web/20180208005818im_/https://images.haarets.co.il/image/upload/w_1994,h_1497,x_117,y_0,c_crop,g_north_west/w_168,h_126,q_auto,c_fill,f_auto/fl_any_format.preserve_transparency.progressive:none/v1516189819/1.5743798.1571389507.jpg", "https://web.archive.org/web/20180208005818im_/https://www.haaretz.com/polopoly_fs/1.5671057.1515419455!/image/1018316866.jpg_gen/derivatives/headline_1200x630/1018316866.jpg", "https://web.archive.org/web/20180208005818im_/https://images.haarets.co.il/image/upload/w_168,h_126,q_auto,c_fill,f_auto/fl_any_format.preserve_transparency.progressive:none/v1510666500/1.4604084.3694361761.png", "https://web.archive.org/web/20180208005818im_/https://images.haarets.co.il/image/upload/w_1957,h_1468,x_64,y_0,c_crop,g_north_west/w_168,h_126,q_auto,c_fill,f_auto/fl_any_format.preserve_transparency.progressive:none/v1517293135/1.5771337.2482074518.jpg", "https://web.archive.org/web/20180208005818im_/https://images.haarets.co.il/image/upload/w_168,h_126,q_auto,c_fill,f_auto/fl_any_format.preserve_transparency.progressive:none/v1516718317/1.5762408.700799912.jpg", "https://web.archive.org/web/20180208005818im_/https://images.haarets.co.il/image/upload/w_168,h_126,q_auto,c_fill,f_auto/fl_any_format.preserve_transparency.progressive:none/v1517819080/1.5789496.1018316866.jpg", "https://web.archive.org/web/20180208005818im_/https://images.haarets.co.il/image/upload/w_1589,h_1192,x_88,y_437,c_crop,g_north_west/w_168,h_126,q_auto,c_fill,f_auto/fl_any_format.preserve_transparency.progressive:none/v1516376072/1.5747132.471600040.jpg", "https://web.archive.org/web/20180208005818im_/https://images.haarets.co.il/image/upload/w_2101,h_1576,x_99,y_13,c_crop,g_north_west/w_168,h_126,q_auto,c_fill,f_auto/fl_any_format.preserve_transparency.progressive:none/v1517222616/1.5770003.2531135330.jpg", "https://web.archive.org/web/20180208005818im_/https://images.haarets.co.il/image/fetch/w_2150,h_1244,x_50,y_71,c_crop,g_north_west/w_609,h_343,q_auto,c_fill,f_auto/fl_any_format.preserve_transparency.progressive:none/https://www.haaretz.com/polopoly_fs/1.5671057.1515419455!/image/1018316866.jpg", "https://web.archive.org/web/20180208005818im_/https://images.haarets.co.il/image/upload/w_847,h_635,x_46,y_0,c_crop,g_north_west/w_168,h_126,q_auto,c_fill,f_auto/fl_any_format.preserve_transparency.progressive:none/v1516177040/1.5743235.2402827789.jpg", "https://web.archive.org/web/20180208005818im_/https://images.haarets.co.il/image/upload/w_1451,h_1089,x_80,y_0,c_crop,g_north_west/w_168,h_126,q_auto,c_fill,f_auto/fl_any_format.preserve_transparency.progressive:none/v1516797783/1.5764271.2856581463.jpg", "https://web.archive.org/web/20180208005818im_/https://images.haarets.co.il/image/fetch/w_1212,h_1209,x_186,y_270,c_crop,g_north_west/w_84,h_84,q_auto,c_fill,f_auto/fl_any_format.preserve_transparency.progressive:none/https://www.haaretz.com/polopoly_fs/1.5584582.1514908040!/image/1018316866.jpg", "https://web.archive.org/web/20180208005818im_/https://images.haarets.co.il/image/upload/w_1958,h_1468,x_111,y_0,c_crop,g_north_west/w_168,h_126,q_auto,c_fill,f_auto/fl_any_format.preserve_transparency.progressive:none/v1516098450/1.5730544.1018316866.jpg", "https://web.archive.org/web/20180208005818im_/https://images.haarets.co.il/image/upload/w_914,h_686,x_496,y_766,c_crop,g_north_west/w_168,h_126,q_auto,c_fill,f_auto/fl_any_format.preserve_transparency.progressive:none/v1516870033/1.5765668.1018316866.jpg", "https://web.archive.org/web/20180208005818im_/https://images.haarets.co.il/image/upload/w_895,h_674,x_476,y_56,c_crop,g_north_west/w_168,h_126,q_auto,c_fill,f_auto/fl_any_format.preserve_transparency.progressive:none/v1517304006/1.5771695.1162716328.jpg", "https://web.archive.org/web/20180208005818im_/https://images.haarets.co.il/image/upload/w_1934,h_1448,x_175,y_20,c_crop,g_north_west/w_168,h_126,q_auto,c_fill,f_auto/fl_any_format.preserve_transparency.progressive:none/v1516319294/1.5746719.2626406522.jpg", "https://web.archive.org/web/20180208005818im_/https://images.haarets.co.il/image/upload/w_1239,h_928,x_389,y_0,c_crop,g_north_west/w_168,h_126,q_auto,c_fill,f_auto/fl_any_format.preserve_transparency.progressive:none/v1516213237/1.5744627.638814605.jpg", "https://web.archive.org/web/20180208005818im_/https://googleads.g.doubleclick.net/pagead/viewthroughconversion/967463147/?value=1.000000&label=pW5UCI3fzgkQ66GpzQM&guid=ON&script=0", "https://web.archive.org/web/20180208005818im_/https://analytics.twitter.com/i/adsct?txn_id=l6ar9&p_id=Twitter&tw_sale_amount=0&tw_order_quantity=0", "https://web.archive.org/web/20180208005818im_/https://images.haarets.co.il/image/upload/w_471,h_353,x_6,y_14,c_crop,g_north_west/w_168,h_126,q_auto,c_fill,f_auto/fl_any_format.preserve_transparency.progressive:none/v1516098436/1.5730572.1018316866.jpg", "https://web.archive.org/web/20180208005818im_/https://images.haarets.co.il/image/upload/w_2127,h_1593,x_73,y_0,c_crop,g_north_west/w_168,h_126,q_auto,c_fill,f_auto/fl_any_format.preserve_transparency.progressive:none/v1516601297/1.5750081.1180903307.jpg", "https://web.archive.org/web/20180208005818im_/https://googleads.g.doubleclick.net/pagead/viewthroughconversion/1006436517/?value=0&label=BrteCMu9_AIQpYH03wM&guid=ON&script=0"], "top_img": "https://web.archive.org/web/20180208005818im_/https://www.haaretz.com/polopoly_fs/1.5671057.1515419455!/image/1018316866.jpg_gen/derivatives/headline_1200x630/1018316866.jpg", "keywords": [], "authors": ["Allison Kaplan Sommer", "Required Field"], "canonical_link": "https://web.archive.org/web/20180208005818/https://www.haaretz.com/us-news/how-donald-trump-lost-the-war-on-christmas-1.5629520", "title": "How Donald Trump Lost the 'War on Christmas'", "meta_data": {"description": "During his presidential election campaign, Trump repeatedly vowed to Make Christmas Merry Again. But the reality has proved different to all his Yuletide rhetoric", "keywords": "Christmas,  Christianity,  Donald Trump,", "news_keywords": "Christmas,  Christianity,  Donald Trump,", "viewport": "width=device-width, initial-scale=1, minimum-scale=1", "fb": {"app_id": 287530407927859, "pages": 64588666340}, "og": {"title": "How Donald Trump lost the 'War on Christmas'", "description": "***", "type": "article", "url": "https://web.archive.org/web/20180208005818/https://www.haaretz.com/us-news/how-donald-trump-lost-the-war-on-christmas-1.5629520", "image": {"identifier": "https://web.archive.org/web/20180208005818im_/https://www.haaretz.com/polopoly_fs/1.5671057.1515419455!/image/1018316866.jpg_gen/derivatives/headline_1200x630/1018316866.jpg", "width": 1200, "height": 630}, "site_name": "haaretz.com"}, "article": {"published": "2017-12-26T09:04:45+0200", "modified": "2018-01-16T10:24:00+0200", "publisher": "https://www.facebook.com/haaretzcom"}, "twitter": {"card": "summary_large_image", "site": "@haaretzcom", "title": "How Donald Trump lost the 'War on Christmas'", "image": "https://web.archive.org/web/20180208005818im_/https://www.haaretz.com/polopoly_fs/1.5671057.1515419455!/image/1018316866.jpg_gen/derivatives/headline_1200x630/1018316866.jpg"}, "apple-mobile-web-app-title": "Haaretz", "application-name": "Haaretz", "msapplication-TileColor": "#006381", "msapplication-TileImage": "https://www.haaretz.com/hdc/web/images/mstile-144x144.png", "msapplication-config": "https://www.haaretz.com/hdc/web/images/browserconfig.xml", "theme-color": "#ffffff", "format-detection": "telephone=no", "apple-itunes-app": "app-id=504537897"}, "movies": ["//web.archive.org/web/20180208005818if_/https://www.youtube.com/embed/Rv8r0h4tNaU", "//web.archive.org/web/20180208005818if_/https://www.youtube.com/embed/u40dAiBiM6w"], "publish_date": null, "source": "https://web.archive.org", "summary": ""}