{"url": "https://www.visitdeepcreek.com/pages/MemberNews1", "text": "Posted 4/28/23\n\nApril 28, 2023, Oakland, MD –The Board of Garrett County Commissioners has proposed an update to the county-wide off-road vehicle ordinance that was adopted in 2017.\n\nThe state legislature has the power to establish laws that apply statewide, while counties are typically given authority to regulate matters at the local level within certain limits set by state law.\n\nLast year, the Maryland General Assembly updated the state-wide transportation article relating to the use of off-road vehicles operating on Garrett County roads. The change at the state level allows permitted vehicles, defined as snowmobiles, all-terrain vehicles, and off-road motorcycles, to operate up to five miles on a designated county road to access approved roads or trails.\n\nThus, to sync with Maryland State laws on the topic, the Commissioners are proposing an amendment to allow permitted vehicles to travel on designated Garrett County roads for a distance up to 5 miles and to include off-the-road motorcycles in the ordinance.\n\nA hearing on this update will be held on May 1, 2023 at 4:00 PM and comments will be accepted until May 15, 2023. The Board of Garrett County Commissioners anticipate adopting the ordinance on May 16, 2023.\n\nThe complete ordinance is below with the highlighted sections denoting changes or updates:\n\nSECTION 70.10: OPERATION OF ALL-TERRAIN VEHICLES, SNOWMOBILES OR OFF-ROAD MOTORCYCLES ON HIGHWAY.\n\n(A) A person may operate an all-terrain vehicle, snowmobile or off-the-road motorcycle (collectively “Off Road Vehicles”) on not more than 5 miles of a highway designated by the Board on not more than 5 miles at a speed of not more than 25 miles per hour for the sole purpose of gaining access to trails on which the operation of an Off Road Vehicle is authorized, or to a field, or to another area where the operation of an Off Road Vehicle is authorized, to cross a highway on an Off Road Vehicle at a right angle at a speed of not more than 25 miles per hour.\n\n(B) The authorizations granted by this section shall be subject to the following specific terms and conditions:\n\n(1) All applicable speed limits. Operators are put on notice that they are responsible for abiding by 25 miles per hour speed limits even if their vehicle is not equipped with an operable speedometer.\n\n(2) Off Road Vehicles may be operated on a Garrett County roadway for a distance not to exceed 5 miles.\n\n(3) The Board of County Commissioners may, by resolution, close or restrict any specific road to Off Road Vehicle use.\n\n(4) Subject to the regulations contained in this section, only Off-Road Vehicles, as defined by the Transportation Article of the Annotated Code of Maryland, are hereby allowed on roads in the Garrett County Roadway Inventory (\"Garrett County roadways”), excluding municipal roads and state highways, subject to the conditions set forth in this section.\n\n(5) Off Road Vehicles must be registered every year and pay a registration fee as set by the Garrett County Commissioners to operate on Garrett County roadways. The registration sticker must be displayed prominently on rear of the vehicle. The registration sticker from Allegany County Maryland for Off Road Vehicles will be recognized in Garrett County.\n\n(6) All operators of Off-Road Vehicles must have proof of valid liability insurance covering his or her vehicle.\n\n(7) All operators of Off-Road Vehicles on Garrett County roadways must possess a valid driver's license or be eligible for a driver's license.\n\n(8) Helmets are required.\n\n(a) Unless the ATV or UTV is equipped with a factory R.O.P.S. (Roll Over Protection System), the operator or passenger of the ATV or UTV will not operate on any portion of the roadway unless the operators and passengers are wearing protective headgear that meets the standards established by the Administration as defined in TA 21-1306.\n\n(b) In such cases where the ATV or UTV is equipped with a factory R.O.P.S. (Roll Over Protection System), the operator and passengers will utilize the factory seat belts when operating the ATV or UTV on any portion of the roadway.\n\n(9) No passengers are permitted on single seat Off Road Vehicles; passengers on all other Off-Road Vehicles are limited to the number of manufactured installed passenger seats on the vehicle.\n\n(10) Off Road Vehicles must have at least an operating brake light and headlight when in operation on Garrett County roadways.\n\n(11) Off Road Vehicles must travel single file on the right-hand shoulder or the extreme right-hand side of a road and left-hand turns may be made from any part of the road if it is safe to do so under the prevailing conditions.\n\n(C) Failure to abide by any of the above conditions when an Off-Road Vehicle is in use on Garrett County roadways shall constitute a violation of this section.\n\n(D) Fines and penalties for violations of this section:\n\n(1) First violation - $100;\n\n(2) Second violation - $250 and a 60-day suspension from using Off Road Vehicle on Garrett County roadways;\n\n(3) Third and subsequent violations - $500 and a lifetime suspension from using Off Road Vehicles on Garrett County roadways;\n\n(E) Enforcement of this section shall be a municipal infraction.\n\n(F) If any provision of this section is found to conflict with Maryland state law or with federal law, all other portions shall remain in full force and effect.\n\n(Res. 2017-6, passed 9-19-2017)", "images": ["https://growthzonesitesprod.azureedge.net/wp-content/uploads/sites/2994/2021/12/cropped-SLA_sm-2-32x32.png", "https://growthzonesitesprod.azureedge.net/wp-content/uploads/sites/2994/2021/12/SLA_sm-2.png", "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAALkAAABkAQAAAADydqwAAAAAAnRSTlMAAHaTzTgAAAAZSURBVEjH7cEBDQAAAMKg909tDjegAAB4MwnEAAEAx8GgAAAAAElFTkSuQmCC", "https://growthzonesitesprod.azureedge.net/wp-content/uploads/sites/2994/2018/07/248.jpg", "https://www.facebook.com/tr?id=2253073318299933&ev=PageView&noscript=1", "https://growthzonesitesprod.azureedge.net/wp-content/uploads/sites/2994/2018/07/Maryland-Tourism-Logo_URL_4C_website2.jpg", "https://growthzonesitesprod.azureedge.net/wp-content/uploads/sites/2994/2018/07/Annual_AGF_Logo.jpg", "https://growthzonesitesprod.azureedge.net/wp-content/uploads/sites/2994/2018/07/gcchamber_stackedlogo_20210916.jpg", "https://growthzonesitesprod.azureedge.net/wp-content/uploads/sites/2994/2018/07/MountainMarylandLogo_NEWwebsite-3.jpg"], "top_img": "https://growthzonesitesprod.azureedge.net/wp-content/uploads/sites/2994/2021/12/cropped-SLA_sm-2-32x32.png", "keywords": [], "authors": [], "canonical_link": "https://www.visitdeepcreek.com/member-news/", "title": "Member News", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Member News", "description": "Garrett County Community Action Committee Unveils 2023-2028 Strategic Plan, Focusing on Empowering the Community Posted 10/11/23 GARRETT COUNTY, Md.-October 10, 2023-Garrett County Community Action Committee, Inc. (GCCAC) announces the introduction of its forward-thinking 2023-2028 Strategic Plan. The five-year plan underscores the organization’s commitment to empowering individuals and families while addressing the unique needs of the…", "url": "https://www.visitdeepcreek.com/member-news/", "site_name": "Garrett County Chamber of Commerce"}, "article": {"modified_time": "2023-10-11T16:12:49+00:00"}, "twitter": {"card": "summary"}, "generator": "WordPress 6.1.1", "msapplication-TileImage": "https://growthzonesitesprod.azureedge.net/wp-content/uploads/sites/2994/2021/12/cropped-SLA_sm-2-270x270.png", "google-site-verification": "0ybERtUepYNzK3mfAaYBnaB8PEQIF0svZs4YjZzsDPs"}, "movies": [], "publish_date": null, "source": "https://www.visitdeepcreek.com", "summary": ""}