{"url": "https://web.archive.org/web/20180717140727/https://www.gq.com/story/kylie-travis-cover-2018", "text": "Best of GQ Kylie Jenner and Travis Scott on Love, Making It Work, and the Kardashian Curse She's a billionaire business mogul. He's the most electric rapper in the game. How did they come together? How do they make it work? And can they survive the Kardashian Curse? Mark Anthony Green sits down with the world's most powerhouse power couple.\n\nIt's Kylie, from the jump, who controls the tempo. The youngest Jenner and her well-oiled glam squad bounce around Milk Studios, in Hollywood, with supreme purpose. Her half-male, half-female contingent is like Ocean's Eleven, except with more crop tops and lip fillers. And instead of a case full of phony casino chips, there's just a roller bag full of luscious hair extensions that need meticulous untangling. Midway through the shoot, the photographer and stylists start praising a particular photo on the monitor, but King Kylie shuts it down. “People are going to turn it into a meme,” she says, like some kind of social-media medium. “Let's move to something else.” She later tells me that Kim and Kanye are the ones who taught her to be more assertive on creative things. “I just want the best cover photos for me and for you guys.”\n\nJoining her in the studio is her 27-year-old partner, Travis Scott. They've been together for about a year, but this is their first photo shoot together. What's the binding force between a rage-thirsty rock star from Missouri City, Texas, and a beauty mogul of Calabasas royalty? Other than their newborn baby girl, Stormi? What's that shared frequency that's responsible for the most dynamic celebrity couple of modern times? We'll get to that, but what I can report is that it's not a mutual admiration for posing in front of a seamless. Taking pictures is a lucrative sport for one and medieval torture for the other.\n\nTravis has a much smaller team with him. Just his manager—who works from a laptop the entire shoot—and a bag of what smells like some of California's loudest weed. Between shots, he just kind of paces around, with his head down and his lanky limbs covered in expensive clothes. A wall or photo light would stop him and send him in a different direction. He looks like one of those Microsoft screen savers from the '90s, careening off the edges of the monitor. “He was whispering to me the whole time,” Kylie tells me afterward, smirking. “He just doesn't like taking the photos.” Travis hates anything that slows him down. (He even hates restaurants; the man despises wasting time in restaurants.) And he admits that he's “impatient as a motherfucker” during photo shoots, despite really liking the end result. But it isn't simply young angst that makes hurry-up-and-wait painful for Travis. It's “la flame”—the internal fire, the rage, “the piss,” as he calls it, aggression in its funnest form. It's why Travis, a decade into a notoriously energetic career, has made his case for having the best live show in hip-hop history.\n\nA few years ago, at a nightclub, I saw Travis swing from a chandelier while performing. One of the gold baroque leaves he held on to for dear life cut his hand, and he was beginning to bleed pretty badly. He paused for a second. Smiled. Then pressed his bloody palm against the ceiling, leaving a red handprint, and kept rapping. That energy, that commitment—that's why there's an entire generation of young tattooed daredevil rappers coming up behind him who look to Travis as the source, and who've taken his lead.\n\nThat may be the thing between the two of them, the binding force: influence. Not in some Adweek marketing sense—in direct-contact-with-the-people kind of way. When they say jump, kids will do it…off a balcony. (That actually happened to Travis.) These two make the mosh pits, memes, and moments that trend and move the needle. They forge 2017's most overused four-letter word—vibe—and they're masters at 2018's: wave. You can't pause when catching a wave. And that's their art. Their common thread. Which helps explain how their relationship went from zero to Stormi in just a few months.\n\n“We don't go on dates,” Kylie tells me. In fact, their first date wasn't really a date. They were at Coachella—neither can remember where, exactly, they first met—and the whole thing just turned into a hang that went well. While she tells me about it, she begins to giggle about the story she told Travis that got his attention that night. The story wasn't anything special, but that's what made it real. How'd you meet your significant other? It starts normal, right?\n\nBut then their second date, by all definitions, was anything but normal. They caught the wave. Kylie Jenner—and nearly 100 million followers of hers—just abandoned her life in California and took off on tour with Travis Scott.\n\n“Coachella was one of the stops on his tour,” she explains. “So he said, ‘I'm going back on tour—what do we want to do about this?’ Because we obviously liked each other.”\n\nWhat do we want to do about this? That's an early-2000s Matthew McConaughey big-screen-heartthrob line. Holy shit. “And I was like, ‘I guess I'm going with you,’ ” she said, to complete the scene.\n\nSo you just went on tour with him?\n\nSo I just went on tour.\n\nThat's kind of crazy romantic.\n\nYeah?\n\nI think so.\n\nYeah, I think it is, too.\n\nYou really just jumped on tour?\n\nI really jumped on the bus. And then we rode off into the sunset. I did the whole tour with him.\n\nWhat did your mom and family say?\n\nShe knows I beat to my own drum. My whole family knows that I do whatever I'm going to do. I've been that way my whole life. I don't really answer to anybody. I live on my own, and so I just rode off into the sunset. We had a lot of downtime. It was organic. And we would just go to these random cities. We got to not be who we really were. Like, if we were in L.A., I feel like it would've been way different. Everything happened for a reason. We weren't going out as “Kylie and Trav.” We would just be in Cleveland, walking the street for hours. We would go on walks, and no one would bother us.\n\nA few weeks after the shoot, while in New York to headline Governors Ball, Travis says he wants to play basketball. He puts together a crew of cool kids and gets Nike to let them take over its new Midtown indoor court. How fun, people say to me. But I know better. I know Travis's intensity isn't voluntary. It can't be tempered or diluted simply because a reporter is in the room. He's like parkour personified—on bath salts. It's what makes the music so charged and his shows so unpredictable. But basketball? I'm out of shape and, compared with Travis and the kids running in the game, old. Besides, throwing a celebrity in the mix during a basketball game does one of two things in my limited experience: Either it makes things super competitive or it makes things super chill. And if there's one thing Travis Scott doesn't do, it's super chill.\n\nOh! One final complication that arises before the game starts: A beautiful woman shows up. Kendall Jenner, to be precise about it. It's unclear if she's there because she's an amateur-pickup-basketball enthusiast or if she's there to see one of Travis's friends. But regardless, the fact of her being on the sideline is disastrous. I've seen a beautiful woman walk into a gym while a bunch of suburban dads were playing pickup ball and change the whole dynamic of the game. Suddenly everyone's throwing elbows and hustling for loose balls in a way they haven't in years. And now the highest-paid model of 2017, according to Forbes, is sitting courtside while a very active Travis Scott is warming up.\n\nThe game is exactly as physical as I expect. Travis's intensity makes Russell Westbrook seem lackadaisical. There's a moment when someone on the other team calls a time-out, stopping Travis's and my team from hitting the game-winning shot, and Travis goes berserk. It looks like the veins in his throat are going to snap the chains around his neck. (He plays in over $200K worth of diamonds and jewelry.) My saving grace is that no one else out there is actually that good. Travis especially. The second game we play may break the record for longest game to 16 points in history. It's all hustle plays, hard defense, and three-pointers damned by fatigue. So much hand-checking and jersey snatching that Charles Oakley would be proud. Illegal picks galore. As I write this story, almost a week after we played, I can still physically feel every one of those 16 points.\n\nAfterward, Travis politely watches me down my fourth Gatorade. “I love basketball,” he says. “It's so intense.”\n\nBehind the zero-percent-body-fat frame and tats, though, is a carefree kid. “People always think I'm dark or some shit,” he says. Which is a fair but inaccurate assumption. When you go around leaving bloody handprints on ceilings for a living, people assume you're a bit conflicted. But Trav is lighthearted. Truly. Like when I ask him to tell me the biggest mistake of his career. “Nothing” is his knee-jerk reaction. Followed by “What the fuck is a mistake?” That's the rock-star reaction. But I keep poking and prying. I know there's something deeper inside of him. Eating him up at night. Travis finally opens up with this raw confession: “I wouldn't have worn snapbacks.”\n\nYou wouldn't have worn snapbacks?\n\n“And also I would've definitely hid—hard—until my hair grew out, bro. I hate when people randomly take pictures of me. I'd look crazy as fuck in them. No lineup, no nothing.”\n\nHe's laughing. But he's also serious. If a genie offered Travis one wish, and he couldn't wish for more wishes, smart money says Travis is scrubbing the Internet of all photos before the braids.\n\nWe're laughing about his rough-hair period when Kanye and Kid Cudi—in L.A. working on their joint album, Kids See Ghosts—FaceTime Travis. Kanye brought Travis into the G.O.O.D. family years ago, and they are practically in-laws now. Kid Cudi's Man on the Moon II is Travis's favorite album of all time. (Travis tells me he regards Kid Cudi and Michael Jackson as musical equals.) Ye and Cudi are calling about Travis's feature for their album; they needed it ASAP, before the record's deadline. Travis is excited but not ecstatic. He sends the verse but he's not preoccupied by it. I want to be clear, and so does he: Travis wants to be on the album. But his musical preoccupations are firmly fixed on his next solo album: Astroworld, rumored to drop later this year. “I'm just anxious to drop my baby.” (The verse does not end up on the album.)\n\nWatch\n\nHow Well Does Travis Scott Know Kylie Jenner?\n\nTravis is currently positioned to make the best album of his career. As this generation's most electric hip-hop headliner, he'll be able to sell out a tour and incite riots across the world for the foreseeable future. But this will be the homecoming album the kids and critics have been waiting for. It's the perfect storm of material: dating one of the most famous human beings on the planet, new fatherhood, and, finally, his ode to Houston—a city with a rich and oddly too-infrequently-tapped relationship with hip-hop. In the way Lil Wayne combined New Orleans sensibilities and with his own “Martian” creativity, Travis could do that for his city—make a Deep South rage masterpiece. Slow and thick and aggressive and something that only he could make. The album is named Astroworld, after the now closed Six Flags amusement park he went to growing up. And though I'm sure having a child with someone as well known as Kylie comes with challenges, this next chapter will also come with a shitload of new listeners looking to catch a vibe and ride the wave.\n\nMost importantly, though, Travis said, “It touches home base.” His friends in the room, most from Houston, give him an “Amen.”\n\nKylie Jenner is a mogul. People love to hyperbolically praise Kardashians in the name of highbrow counter-intuitiveness. This isn't that. According to Women's Wear Daily, Kylie's cosmetics line did nearly half a billion in sales in its first 18 months. Think about that. There's no way to make definitive comparative statements about the relative wealth of the Kardashian clan (at least not without stealing Kris's ledger), but it means there's a chance Kylie—the littlest sister—is now richer than her bigs, richer than her momager™, and richer than her brother-in-law, who made My Beautiful Dark Twisted Fantasy and who's sold almost as many Yeezy sneakers as McDonald's has cheeseburgers. Kylie Cosmetics has turned out to be one of the most unequivocally lucrative ways to translate the power of the Kardashian-Jenner family. And it was all her idea. “The reason I got into makeup is it's all about making yourself feel better,” she tells me in a house in Calabasas (not her own) that she's asked me not to describe in greater detail for security reasons. She walks me through plans to open up brick-and-mortar stores for Kylie Cosmetics worldwide: “I really want to create an experience.” The way she describes it is very coy but extremely fleshed out. I wouldn't be surprised if she broke ground months ago and was just waiting for the perfect time to announce their opening.\n\nYou might be unimpressed by her success. And think, Of course she's rich…she was born rich. But consider this: If a wealthy banker's son out-earned his father and entire family by over a hundred million dollars before the age of 21, we'd consider him a wunderkind, even with the head start he got in life. And it's important to remember that Kylie's cosmetics business was built by grinding. It started with her consistent assault on social media. She saw opportunities—early—that only someone from her generation could really intuit. Like the true power of Snapchat. She built up such a big following that when she professed her dislike for the Snapchat redesign and stopped using it earlier this year, she helped kill the app. “I didn't know I had that power,” she says. And though I believe her when she says she didn't intentionally try to destroy Snapchat, I call b.s. on her not knowing she had the power to. You could see it in her eyes. She knew. She knew she had the power then, and she knows it's only grown.\n\nThere's an episode of Keeping Up with the Kardashians in which Scott Disick hires a spiritual medium to help purge him of the “Kardashian Curse.” This is the belief that all the men who go through the Kardashian orbit end up flaming out. In the 2016 episode, Kim gets “offended” by the notion of it when mentioned. Kourtney's reaction is so perplexed by this new concept it's as if Lord Disick were trying to explain Bitcoin to his 8-year-old. The episode concludes with Scott, on the advice of his new spiritual medium, purchasing a rooster to set free in a ritual, hopefully resulting in him breaking the curse. He's advised to wear all white and to transfer his energy to the rooster. He makes sure no one else touches it. “It can only have my energy,” he warns.\n\nThe Internet is much more familiar with this concept than the family apparently is. A barrage of Why him? tweets quickly follow after every Jenner-Kardashian dating announcement. And when Travis and Kylie confirmed they were dating, there was the fair share of fan worry. Is Travis concerned?\n\nAre you worried at all about falling victim to the Kardashian Curse?\n\nI don't even be looking at motherfuckers. I don't be looking at shit. Kylie actually likes me for me.\n\nWere you nervous at all about that?\n\nMan, hell nah. Nervous for what? I'm on my own island. So hey, come over there to Astroworld. I'm not into all the other shit. I don't get involved. I'm over here. Kylie is different.\n\nYou seem to be impervious to a lot of things. When was the last time you cried?\n\nWhen my daughter was born. As soon as I heard her crying...\n\nWere you in the room the entire time?\n\n[He snaps to.] Hell yeah! It was crazy. I was there through the hell...the epidural and shit. Crazy.\n\nI later ask Kylie about my theory on the curse. It isn't a surprise to her.\n\nPeople say you and your sisters destroy the men in your lives. But my theory is, maybe it's just extremely difficult to fly this close to the sun. You were built for this level of celebrity—Travis and the other men weren't.\n\nThat's exactly what it is. They come and can't handle it.\n\nHow do you make sure that Travis doesn't burn out?\n\nWell, for all the news stories, it's how I get over them so fast. Trav, for example, he's like, ‘Wait...but how do you just get over this?’ He gets more angry about things. It's not just him. It's Jordyn [Kylie's best friend] who I've seen affected. It's everyone around us that aren't used to it. And we're just like, “Oh, that'll go away in a day.” I know these stories aren't going to matter, so don't even let them affect you, you know? I think you're correct. But it's not just men—it's friends, it's people who come and just don't know how to handle it. It's the negative. There's a lot of people who love us, but there's also a huge handful of people who don't like us.\n\nSo is he adapting to it all?\n\nI don't think he's really cool with it, but he deals with it, because we love each other and we have a family. For sure, I know he doesn't like the attention. That's why we just go the extra mile to keep our relationship super private, or like, if he has events or something, I won't come. Because I want him to do his own thing. I want him to be him. I don't want it to be Kylie and Trav. If people don't ever see us together, that's okay with me, because we just do our thing.\n\nWhen was the last time you cried?\n\nYesterday.\n\nWhat happened?\n\nMe and Travis got in a little fight. Which is normal. So I was just crying because I was just overwhelmed. It wasn't even about anything really specific. I was just overwhelmed. And then we made up an hour later. I just flew to Houston to see him for a few hours.\n\nThat's where you were yesterday! [Kylie and I were supposed to have our sit-down the day before, when she “got on a plane” for a “family matter.”] That's sweet! Yeah. 'Cause we were fighting, and I was like, I just need to go. I didn't tell anyone where or why.\n\nWow.\n\nJust because we're a family now. When we fight, it's usually just because we've been away from each other for too long and we didn't see each other for like two weeks. And we have Stormi now, and I can't travel with her. She's too young. So it's harder to see each other, but I was like, I just need to go and fix this and go back.\n\nTravis told me that he's a romantic. When I asked him what's the most romantic thing he's ever done for you, he played it cool. What would you say?\n\nSo! When I landed in Houston to make up, he—I always kept saying I really want a Stormi chain, so when I landed, he had one made for me. But probably the most romantic thing he's done for me is, on my birthday, he woke me up out of bed at like six in the morning. He was like, “We gotta go,” and I'm just like half asleep, like, “What do you mean? What do you mean?” And he just starts pulling me, and the sun was just coming up, and he had flowers all the way down his house and violin players everywhere.\n\nThe rager!?\n\n[laughs] The rager can have a sweet side.\n\nMark Anthony Green is GQ's style editor.\n\nThis story originally appeared in the August 2018 issue with the title \"Modern Family.\"\n\nWatch", "images": ["https://web.archive.org/web/20180717140727im_/https://media.gq.com/photos/57b71807c4fb86bf3ac6f35d/3:4/w_102,c_limit/magazineasset.jpg", "https://web.archive.org/web/20180717140727im_/https://media.gq.com/photos/5b43918ab8d0e16cfcf6727e/16:9/pass/kylie%20jenner%20and%20travis%20scott-modern-family-gq-august-2018-07.jpg"], "top_img": "https://web.archive.org/web/20180717140727im_/https://media.gq.com/photos/5b43918ab8d0e16cfcf6727e/16:9/pass/kylie%20jenner%20and%20travis%20scott-modern-family-gq-august-2018-07.jpg", "keywords": [], "authors": ["Mark Anthony Green Paola Kudacki", "Mark Anthony Green", "Paola Kudacki"], "canonical_link": "https://web.archive.org/web/20180717140727/https://www.gq.com/story/kylie-travis-cover-2018", "title": "Kylie Jenner and Travis Scott on Love, Making It Work, and the Kardashian Curse", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=no, width=device-width, initial-scale=1, maximum-scale=1", "author": "Mark Anthony Green,Paola Kudacki", "copyright": "Copyright © Condé Nast 2018", "description": "She's a billionaire business mogul. He's the most electric rapper in the game. Mark Anthony Green sits down with the world's most powerhouse power couple.", "keywords": "Best of GQ,GQ Cover Story,Profiles", "news_keywords": "Best of GQ,GQ Cover Story,Profiles", "fb": {"app_id": 606963029328755, "admins": 108943, "pages": 7962048097}, "og": {"site_name": "GQ", "title": "Kylie Jenner and Travis Scott on Love, Making It Work, and the Kardashian Curse", "url": "https://web.archive.org/web/20180717140727/https://www.gq.com/story/kylie-travis-cover-2018", "description": "She's a billionaire business mogul. He's the most electric rapper in the game. Mark Anthony Green sits down with the world's most powerhouse power couple.", "image": "https://web.archive.org/web/20180717140727im_/https://media.gq.com/photos/5b43918ab8d0e16cfcf6727e/16:9/pass/kylie%20jenner%20and%20travis%20scott-modern-family-gq-august-2018-07.jpg", "type": "article"}, "article": {"section": "culture", "published_time": "2018-07-17T12:00:00.000Z", "modified_time": "2018-07-17T12:58:27.819Z"}, "parsely-title": "Kylie Jenner and Travis Scott on Love, Making It Work, and the Kardashian Curse", "parsely-link": "https://www.gq.com/story/kylie-travis-cover-2018", "parsely-type": "post", "parsely-image-url": "https://media.gq.com/photos/5b43918ab8d0e16cfcf6727e/16:9/pass/kylie%20jenner%20and%20travis%20scott-modern-family-gq-august-2018-07.jpg", "parsely-pub-date": "2018-07-17T12:00:00.000Z", "parsely-section": "culture", "parsely-author": "Mark Anthony Green,Paola Kudacki", "parsely-tags": "Best of GQ,GQ Cover Story,Profiles", "twitter": {"card": "summary_large_image", "site": "@gqmagazine", "title": "Kylie Jenner and Travis Scott on Love, Making It Work, and the Kardashian Curse", "description": "She's a billionaire business mogul. He's the most electric rapper in the game. Mark Anthony Green sits down with the world's most powerhouse power couple.", "image": "https://web.archive.org/web/20180717140727im_/https://media.gq.com/photos/5b43918ab8d0e16cfcf6727e/16:9/pass/kylie%20jenner%20and%20travis%20scott-modern-family-gq-august-2018-07.jpg"}}, "movies": [], "publish_date": 1531828800.0, "source": "https://web.archive.org", "summary": ""}