{"url": "http://www.mtv.co.uk/celebrities/news/9-of-the-most-shocking-celebrity-love-squares-ever", "text": "Hollywood is actually a small place tbh and since celebs love to date each other it is no wonder you get the odd over lap or ten. Everyone is aware of the love triangles that plague the famous folk of the world but do you even realise the amount of quadrangles?\n\nWell, here they are…\n\nCHECK OUT THE CELEBS WHO DATED THEIR BFF'S EX BELOW...\n\n1. Kylie Jenner/ Tyga/ Black Chyna/ Rob Kardashian\n\nThis may the most confusing square of all time. Chyna accused Tyga of leaving her for Kylie who was 17 at the time. She also claimed that in the early days of the pair dating, Tyga was still seeing Chyna. Not long after, it emerged that she had started dating Kylie’s brother Rob and a few months later the pair were engaged and expecting a baby. After the birth of their daughter Dream they split up amid a lot of drama and not long after that, Kylie and Tyga went their separate ways.\n\n2. Justin Bieber/Selena Gomez/Orlando Bloom/Miranda Kerr\n\nDuring the eternal on/off of Jelena, it was rumoured that 29-yearold Miranda had hooked up with 18-yearold Justin, after the 2012 Victoria’s Secret Fashion Show. In 2014, Biebs' ex Selena was spotted getting well cosy with Miranda’s ex-husband Orlando at WeDay in California. After the picture surfaced of the pair hanging out, Justin and Orlando came face to face in Ibiza and onlookers claim JB tried to shake his hand. Orlando rejected him and a furious Justin ‘mumbled something about Miranda’ leading Orlando to try and punch him. Woah.\n\n3. Lillie Lexie Gregg/ Gaz Beadle/ Chrysten Zenoni/ Stephen Bear\n\nAfter Gaz and Lillie had split, they both appeared on Ex On The Beach where it came out that Gaz had cheated on her with Chrysten when he was in Australia. Lillie had started seeing Bear at this point in the series so Bear, of course, decided to cheat on her with the SAME GIRL, Chrysten. This was legit painful to watch.\n\n4. Jessica Biel/Justin Timberlake/ Scarlett Johansson/Ryan Reynolds\n\nSo to get this straight, thisall happened March to May of 2007. Okay so here goes: after Justin broke up with Cameron Diaz in 2007 he started seeing Scar Jo but was also spotted canoodling with Jessica Biel. This was all going onaround April but just the month before Jessica had been getting cosy with her Blade Runner co-star Ryan. Fast forward to May, he’s then spotted holding hands with Scarlett. After much confusion, Jessica and Justin ended up together and Scarlett and Ryan before they got divorced. Our head 'actually' hurts.\n\n5. Drake/Rihanna/Chris Brown/Karrueche Tran\n\nThis actually seems like more of a love trianglewith poor Karrueche popping up trying to be noticed. Rihanna and Drake have been on/off ever since her split from Chris and the two rappers have had a huge feudfor years. But the entire time Chris has been dating Karrueche, who has stuck by him as he’s fought in clubs with Drake over Ri-Ri. Ouch.\n\n6. Marnie Simpson/Lewis Bloor/Aaron Chalmers/Lauren Pope\n\nAfter meeting on Celebrity Big Brother in 2016, Marnie and Lewis struck up a romance. Sure two reality stars falling in love – nothing odd there. But what was baffling is when Marnie’s ex Aaron started dating Lewis’ ex Lauren with Marnie branding the whole thing ‘weird’. Awkward.\n\n7. Lucy Mecklenburgh/ Mario Falcone/ Lauren Goodger/ Mark Wright\n\nBack in the OG days of TOWIE which saw Lauren and Mark’s disaster-filled romance in our lives, Mark cheated on her with Lucy. Lucy’s boyfriend Mario got wind of the whole thing and broke up with her before they got back together once more. Even messier still, Lucy had got Mark’s sister, and her neighbour, Jess to lie to Mario about where she was the night she stayed with Mark. God, we miss those days.\n\n8. Niall Horan/Selena Gomez/ Justin Bieber/ Barbara Palvin\n\nAfter Niall Horan and VS model Barbara Palvin stopped seeing each other and the whole Jelena saga had died down, they pulled the ol’ switcheroo on us and started dating each other’s exes. In the same week in 2014, Niall was spotted taking Selena to a Katy Perry concert in London, whilst in Cannes, Justin was seen getting cosy with Barbara Palvin on top of Roberto Cavalli’s yacht. As you do.\n\n9. MARK WRIGHT, MICHELLE KEEGAN, MAX GEORGE and LUCY MECKLENBURGH\n\nAfter the whole Mark and Lucy debacle was over (see number seven on this list babes) he met Michelle Keegan while on holiday in Dubai. The following year his ex Lucy moved onto dating Michelle’s ex The Wanted’s (RIP) Max and claimed: “Max is the best- looking guy I’ve ever been with. I would never date someone from Essex again.” Although that was a slice of shade from Lucy, when Mark and Michelle got engaged Max publicly congratulated the couple: “Yeah, absolutely. I'm actually really happy for her, she's a wonderful girl. I've met Mark and he seems like a really nice bloke so yeah - I wish them all the luck in the world.’ No drams here.", "images": ["https://images.paramount.tech/uri/mgid:arc:imageassetref:mtv.co.uk:bf5efffc-9e7e-11ed-84c2-164563049251?quality=0.7&gen=ntrn&legacyStatusCode=true&format=jpg&width=1200&height=630&crop=true", "https://images.paramount.tech/uri/mgid:arc:imageassetref:mtv.co.uk:bf5efffc-9e7e-11ed-84c2-164563049251?quality=0.7&gen=ntrn&legacyStatusCode=true&format=webp&height=180&width=320&crop=true"], "top_img": "https://images.paramount.tech/uri/mgid:arc:imageassetref:mtv.co.uk:bf5efffc-9e7e-11ed-84c2-164563049251?quality=0.7&gen=ntrn&legacyStatusCode=true&format=jpg&width=1200&height=630&crop=true", "keywords": [], "authors": [], "canonical_link": "https://www.mtv.co.uk/news/ffh9s8/9-of-the-most-shocking-celebrity-love-squares-ever", "title": "9 Of The Most Shocking Celebrity Love Squares EVER", "meta_data": {"app_version": "d5e4a81f0-2833-2023-10-17", "robots": "noydir,noodp, max-image-preview:large", "viewport": "width=device-width, initial-scale=1, user-scalable=1, maximum-scale=2", "theme-color": "#87b6c0", "msapplication-config": "/browserconfig.xml", "description": "Love triangles are so 2016...", "original-source": "https://www.mtv.co.uk/news/ffh9s8/9-of-the-most-shocking-celebrity-love-squares-ever", "search": {"title": "9 Of The Most Shocking Celebrity Love Squares EVER", "description": "Love triangles are so 2016...", "imageUrl": "https://images.paramount.tech/uri/mgid:arc:imageassetref:mtv.co.uk:bf5efffc-9e7e-11ed-84c2-164563049251?quality=0.7&gen=ntrn&legacyStatusCode=true", "imageHeight": 540, "imageWidth": 960, "url": "/news/ffh9s8/9-of-the-most-shocking-celebrity-love-squares-ever", "contentType": "Article", "bucketName": "Article", "labelName": "News", "contentDate": "2017-10-25T15:20:46.000Z"}, "og": {"site_name": "MTV", "image": {"identifier": "https://images.paramount.tech/uri/mgid:arc:imageassetref:mtv.co.uk:bf5efffc-9e7e-11ed-84c2-164563049251?quality=0.7&gen=ntrn&legacyStatusCode=true&format=jpg&width=1200&height=630&crop=true", "width": 1200, "height": 630}, "title": "9 Of The Most Shocking Celebrity Love Squares EVER", "description": "Love triangles are so 2016...", "url": "https://www.mtv.co.uk/news/ffh9s8/9-of-the-most-shocking-celebrity-love-squares-ever", "type": "article"}, "twitter": {"card": "summary_large_image", "description": "Love triangles are so 2016...", "title": "9 Of The Most Shocking Celebrity Love Squares EVER", "image": "https://images.paramount.tech/uri/mgid:arc:imageassetref:mtv.co.uk:bf5efffc-9e7e-11ed-84c2-164563049251?quality=0.7&gen=ntrn&legacyStatusCode=true&format=jpg&width=1200&height=630&crop=true"}}, "movies": [], "publish_date": null, "source": "http://www.mtv.co.uk", "summary": ""}