{"url": "https://web.archive.org/web/20171003042024/http://www.cnn.com/2017/10/03/entertainment/tom-petty-obit/index.html", "text": "(CNN) Rocker Tom Petty died Monday after being rushed to a Los Angeles hospital, according to Tony Dimitriades, longtime manager of Tom Petty & The Heartbreakers. Dimitriades confirmed Petty's death on behalf of the performer's family.\n\nHe was 66.\n\nThe singer was found unconscious in his Malibu home on Sunday night, authorities said.\n\nPetty was transported to UCLA Santa Monica Hospital where he was reportedly placed on life support.\n\nWith his nasally voice and chiming guitar, Petty and his longtime band, the Heartbreakers, churned out an instantly recognizable brand of sturdy, heartland rock that made them a classic-radio staple for decades. Petty, along with the band, was inducted into the Rock and Roll Hall of Fame in 2002\n\nThe group finished a summer tour with three performances at the Hollywood Bowl last week.\n\nPetty and the Heartbreakers first came to fame in the 1970s. It was both with that group and as a solo artist that Petty had a string of hits across the decades, including \"Free Falin',\" \"American Girl\" and \"I Won't Back Down.\"\n\nTheir 1976 debut contained a minor hit, \"Breakdown,\" but it wasn't until Petty's third album, \"Damn the Torpedoes,\" that he and the band broke through to the mainstream.\n\nThat 1980 album won critical raves, went platinum and spawned the hits \"Don't Do Me Like That\" and \"Refugee.\"\n\nPetty sang with Stevie Nicks that same year on her smash hit, \"Stop Draggin' My Heart Around.\" The duet kicked off a long and fruitful period of collaboration between Petty and other artists.\n\nHe recorded \"Don't Come Around Here No More\" -- memorable for its trippy, Mad Hatter-themed music video -- with the Eurythmics' Dave Stewart in 1985. Petty joined Bob Dylan on tour the next year, which also included dates with the Grateful Dead.\n\nHe joined fellow music legends Dylan, George Harrison, Jeff Lynne, and Roy Orbison in 1988 to form The Traveling Wilburys. They released two studio albums.\n\nIt was a rich career for Petty, who was born in Gainesville, Florida and became hooked on rock and roll when -- at the age of 11 -- he met superstar Elvis Presley on a movie set.\n\nPetty joined his first band, The Sundowners, in high school at the age of 14.\n\nAfter getting into an argument with the band's drummer, Petty quit and moved on to join a group called The Epics, which included Tom Leadon, a brother of Eagles guitarist Bernie Leadon.\n\n\"We realized Tom was the real musician of the band,\" their fellow band member Rick Rucker told the Orlando Sentinel in 2006.\n\nThe Epics later changed their name to Mudcrutch, and Petty traveled to Los Angeles in search of a record deal for the rock quintet.\n\nDespite landing a deal, the group soon disbanded.\n\nA new group that included Petty and two former Mudcrutch members formed in 1975, eventually becoming known as Tom Petty and the Heartbreakers.\n\nAfter pioneering the heartland rock sound, Petty went solo in 1989 before regrouping with the Heartbreakers three years later.\n\nHe also found fame as an actor. His flair for drama was on display in his music videos for songs like \"Mary Jane's Last Dance.\"\n\nPetty starred with Kevin Costner in the 1997 film, \"The Postman.\" He also had a recurring role as the voice of Elroy \"Lucky\" Kleinschmidt in the animated comedy series, \"King of the Hill.\"\n\nA 2015 biography on Petty documented a dark turn for the singer and his struggle with heroin addiction in 1997, following the collapse of his 20-year marriage and a failed album.\n\n\"Tried to go cold turkey, and that wouldn't work,\" Petty said in the book. \"It's an ugly f***ing thing.\"\n\nPetty told CNN in a 2007 interview that he loved music as much as it loved him.\n\n\"Music, as far as I have seen in the world so far, is the only real magic that I know,\" he said. \"There is something really honest and clean and pure and it touches you in your heart.\"", "images": ["https://web.archive.org/web/20171003042024im_/http://i2.cdn.cnn.com/cnnnext/dam/assets/171002123949-tom-petty-august-2017-large-169.jpg", "https://web.archive.org/web/20171003042024im_/http://i2.cdn.cnn.com/cnnnext/dam/assets/171002123949-tom-petty-august-2017-super-tease.jpg", "data:image/gif;base64,R0lGODlhEAAJAJEAAAAAAP///////wAAACH5BAEAAAIALAAAAAAQAAkAAAIKlI+py+0Po5yUFQA7"], "top_img": "https://web.archive.org/web/20171003042024im_/http://i2.cdn.cnn.com/cnnnext/dam/assets/171002123949-tom-petty-august-2017-super-tease.jpg", "keywords": [], "authors": ["Lisa Respers France", "Brandon Griggs"], "canonical_link": "https://web.archive.org/web/20171003042024/http://www.cnn.com/2017/10/03/entertainment/tom-petty-obit/index.html", "title": "Music legend Tom Petty dies", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0", "section": "entertainment", "og": {"pubdate": "2017-10-03T04:05:45Z", "url": "https://web.archive.org/web/20171003042024/http://www.cnn.com/2017/10/03/entertainment/tom-petty-obit/index.html", "title": "Music legend Tom Petty dies", "description": "Rocker Tom Petty died Monday after being rushed to a Los Angeles hospital, Petty's manager Tony Dimitriades confirmed to CNN.", "site_name": "CNN", "type": "article", "image": {"identifier": "https://web.archive.org/web/20171003042024im_/http://i2.cdn.cnn.com/cnnnext/dam/assets/171002123949-tom-petty-august-2017-super-tease.jpg", "width": 1100, "height": 619}}, "pubdate": "2017-10-03T04:05:45Z", "lastmod": "2017-10-03T04:18:58Z", "author": "Lisa Respers France and Brandon Griggs, CNN", "article": {"author": "https://www.facebook.com/lisarespers"}, "twitter": {"title": "Music legend Tom Petty dies", "description": "Rocker Tom Petty died Monday after being rushed to a Los Angeles hospital, Petty's manager Tony Dimitriades confirmed to CNN.", "card": "summary_large_image", "image": "https://web.archive.org/web/20171003042024im_/http://i2.cdn.cnn.com/cnnnext/dam/assets/171002123949-tom-petty-august-2017-super-tease.jpg"}, "description": "Rocker Tom Petty died Monday after being rushed to a Los Angeles hospital, Petty's manager Tony Dimitriades confirmed to CNN.", "keywords": "entertainment, Music legend Tom Petty dies - CNN", "thumbnail": "http://i2.cdn.cnn.com/cnnnext/dam/assets/171002123949-tom-petty-august-2017-super-tease.jpg", "vr": {"canonical": "http://www.cnn.com/2017/10/03/entertainment/tom-petty-obit/index.html"}, "fb": {"app_id": 80401312489, "pages": "5550296508,18793419640"}, "template-top": "entertainment,art-img"}, "movies": [], "publish_date": 1506960000.0, "source": "https://web.archive.org", "summary": ""}