{"url": "http://www.newslocker.com/en-us/news/celebrity/vin-diesel-my-kids-had-a-blast-on-the-guardians-of-the-galaxy-vol-2-set/", "text": "The Best Roku Channels You Haven't Found Yet - Access Codes Revealed! Roku has been gaining a lot of popularity lately!\n\nThe streaming platform offers access to a wide variety of channels and content, but did you know there are actually secret, hidden channels?\n\nWhile many of the channels are well-known and easily accessible, the hidden channels aren’t advertised, and you won’t find them by searching through the Roku channel lineup, either.\n\nHowever, there’s a trick to getting them, and giving you the code!\n\nClick through to see how to access the ch Read more\n\nMaren Morris & Ryan Hurd Split After 5 Years of Marriage Maren Morris and Ryan Hurd are going their separate ways.\n\nThe 33-year-old “The Middle” superstar and the 36-year-old singer-songwriter have decided to end their marriage after five years together, Us Weekly confirmed.\n\nKeep reading to find out the reason…\n\nMaren filed for divorce on October 2, citing “irreconcilable differences” as the reason for the couple’s split in docs obtained by the outlet.\n\nTheir date of separation matches the date of filing. They also h Read more\n\nBritney Spears Dating History - Full List of Rumored & Confirmed Ex-Boyfriends Revealed Britney Spears appears to be loving the single life, following her split from husband Sam Asghari, which continues to make headlines.However, this isn’t her only breakup that’s gotten people’s attention.From actors, to co-stars on stage, to men who prefer to stay out of the spotlight, Britney has been through her share of good and bad relationships, some more scandalous than others.So, just who has Britney dated over the years, and who are her rumored hookups?Here’s Brit Read more\n\nWho Is Halle Bailey's Boyfriend? She's Been Dating Rapper DDG Since Early 2022! Halle Bailey is still going strong with her boyfriend DDG, nearly two years into their relationship!\n\nThe 23-year-old The Little Mermaid actress and the 26-year-old rapper first sparked dating rumors back in January 2022 when they were spotted attending Usher‘s residency in Las Vegas together.The couple then went public with their relationship when Halle turned 22 in March 2022 and he posted a birthday message for her on Instagram. They later made their red carpet debut at the BET Awards i Read more\n\nEverything Taylor Swift & Travis Kelce Insiders Have Said About Their Relationship After the PDA-Filled NYC Weekend So, what’s going on between Taylor Swift and Travis Kelce?\n\nThe new couple went very public with their romance this past weekend when they were spotted holding hands on multiple occasions during date nights in New York City.\n\nTaylor and Travis were first linked in early September, a couple months after he attended her Eras Tour show in Kansas City and tried to give her a friendship bracelet with his phone number on it.In the past month, Taylor has attended three of Travis‘ football ga Read more\n\nAlicia Keys Deletes & Apologizes for Instagram Post About Paragliding Amid Israel-Gaza Conflict Alicia Keys picked an unfortunate time to tell fans about her interest in paragliding.\n\nThe Grammy-winning singer, who lives in an area of California where paragliding is a very popular sport, took to Instagram to talk about her interest in picking up the new hobby.\n\n“What would you do if u weren’t afraid of anything??? Tell me your truth… I’ve had my eyes on paragliding…👀👀,” she said in the original post, which has since been deleted.\n\nUnfortu Read more\n\nKevin Spacey Begins Week with Multiple Headlines, for Canceled Premiere & Monologue on Cancel Culture Kevin Spacey is in the headlines for multiple reasons right now.\n\nJust weeks after the controversial actor was rushed to the hospital for a potential heart attack, he’s back in the public eye.\n\nKevin made a surprise appearance at the University of Oxford’s Sheldonian Theatre during British author Douglas Murray‘s discussion on cancel culture. He was asked to perform a monologue from the Shakespeare play Timon of Athens, which touches on the subject.\n\nKeep reading to find out more Read more\n\nAriana Grande Supports Brother Frankie at Opening Night of 'Rocky Horror Show' in Pennsylvania Ariana Grande was a supportive sister over the weekend, driving out to Pennsylvania to watch her older brother perform!\n\nFrankie Grande is currently playing Dr. Frank ‘N’ Furter in the Bucks County Playhouse production of The Rocky Horror Show and Ariana was in attendance at opening night on Friday (October 13) in New Hope, Penn.\n\nAriana, mom Joan Grande, and some more friends met up with Frankie backstage after the show to celebrate his performance.\n\n“Serving opening night LEWKS Read more\n\nOprah Winfrey's Rep Denies Claims She Asked to Join Mitt Romney on a 'Unity Ticket' Oprah Winfrey‘s team is speaking out amid a claim made about her in a new Mitt Romney biography.\n\nIt’s claimed in political journalist McKay Coppins‘ new book that Oprah called up Mitt and told him that they should form a unity ticket to “save the country.”\n\nOprah is a well-known Democrat while Mitt is a Republican.In a statement to the media, Oprah‘s rep confirms that she did talk to Mitt on the phone, but denies that she was ever requesting to be on his presi Read more\n\nTravis Kelce Joins Brother Jason to Cheer on Phillies at Baseball Game Travis Kelce is now in Philly!\n\nThe 34-year-old Kansas City Chiefs football player joined his older brother Jason to cheer on the Philadelphia Phillies during game one of the Championship Series against the Arizona Diamondbacks on Monday (October 16) at Citizens Bank Park in Philadelphia, Penn.\n\nFor those who don’t know, Jason plays for the Philadelphia Eagles, so he’s definitely a hometown hero for Phillies fans.Travis brought along his best friends Aric Jones and Ross Travis for the Read more\n\nAngelina Jolie's Sons Maddox & Pax Join Her for Another Day of Work on 'Maria' Movie Angelina Jolie has two of her kids by her side on the set of her upcoming movie Maria!\n\nThe Oscar-winning actress was joined by her sons Maddox, 22, and Pax, 19, while heading to work on another day of filming on Sunday (October 15) in Peloponnese, Greece.\n\nAngelina was first seen on set last week, almost exactly one year after the project was first announced. She is starring in the upcoming film about the late opera singer Maria Callas, which is director Pablo Larrain‘s third biopic about Read more\n\nIsraeli Government Addresses Gigi Hadid After She Issues Statement on Crisis in Israel & Palestine The Israeli government is speaking directly to Gigi Hadid after she weighed in on the developing crisis in Israel and Palestine.The 28-year-old model, who is half Palestinian, took to social media last week to issue a response after the militant group Hamas infiltrated Israel and attacked citizens. The death toll now totals more than 1,400, according to CNN.\n\nIsrael responded and launched a counter-attack on Gaza, where Palestinians are dying.“My thoughts are with all those affected by thi Read more\n\n'Deadpool 3' Director Addresses Movie's Release Date & Taylor Swift Casting Rumors Amid SAG-AFTRA Strike Deadpool 3 director Shawn Levy is opening up about the upcoming blockbuster.The Night at the Museum director was working on the movie, which features the return of the iconic character Wolverine, with Ryan Reynolds and Hugh Jackman until the SAG-AFTRA strike put the production on pause.In a new interview, Shawn weighed in on if the movie was still on track for its May 3 release date. He also addressed whispers that Taylor Swift was set to join the cast in an exciting role.Keep reading to find o Read more\n\nOlivia Wilde Responds to Backlash Over Her Joke About Taylor Swift & Travis Kelce's Relationship Olivia Wilde is aware of the backlash that she incited by joking about Taylor Swift and Travis Kelce.The 39-year-old Don’t Worry Darling director incited backlash after re-sharing a tweet joking about the 33-year-old pop titan’s love life on her Instagram story.The tweet read, “I wish Taylor Swift was in love with a climate scientist,” seemingly implying that fans would be more interested in the risks of climate change like her current relationship has led to increased i Read more\n\nBarry Manilow, Jenny McCarthy honor Suzanne Somers as Hollywood mourns loss of 'Three's Company' star Barry Manilow, Fran Drescher, Jenny McCarthy and Melissa Joan Hart were some of the many A-list stars mourning the loss of Suzanne Somers following her death Sunday. She was 76. \"Suzanne and I were friends for decades. She was the sister I never had and my close confidant forever,\" Manilow wrote on social media. \"We shared triumphs and heartaches. Her fame in so many fields overshadowed her real talent as one of our greatest comedic actors, a loving mother, an amazing homemaker, and one of the w Read more\n\nAre Stacy & Izzy From 'Love Is Blind' Together? Reunion Confirms Their Relationship Status Stacy Snyder and Izzy Zapata made it to their wedding on Love Is Blind season five.\n\nHowever, while Izzy did say “I do,” Stacy was unable to as she felt they needed more time to build their relationship.\n\nIn the finale, Stacy seemed open to staying together, while Izzy was still very upset about his fiancée saying no at the altar.\n\nIzzy was seen in recent weeks out with another woman, but some Instagram story posts in the past week leading up to the finale hinted that he was sti Read more", "images": ["https://img4.newslocker.com/2023/10/17/305632949_725.jpg", "https://img4.newslocker.com/2023/10/17/305632939_350.jpg", "https://img4.newslocker.com/2023/10/17/305632962_725.jpg", "https://img4.newslocker.com/2023/10/17/305632957_725.jpg", "http://www.newslocker.com/images/rss.png", "https://img4.newslocker.com/2023/10/17/305632954_725.jpg", "https://img4.newslocker.com/2023/10/17/305632941_350.jpg", "https://img4.newslocker.com/2023/10/17/305632953_725.jpg", "https://img4.newslocker.com/2023/10/16/305488289_725.jpg", "https://img4.newslocker.com/2023/10/17/305632960_725.jpg", "https://img4.newslocker.com/2023/10/17/305632952_725.jpg", "https://img4.newslocker.com/2023/10/17/305632951_725.jpg", "http://akns-images.eonline.com/eol_images/Entire_Site/2015920/rs_300x300-151020072337-600.Vin-Diesel-Witch-Hunter.jl.101915.jpg?downsize=600:*&crop=600:315;left,top", "https://img4.newslocker.com/2023/10/16/305488290_725.jpg", "https://img4.newslocker.com/2023/10/17/305632963_725.jpg", "https://static.addtoany.com/buttons/share_save_120_16.gif", "https://img4.newslocker.com/2023/10/17/305632955_725.jpg", "https://img4.newslocker.com/2023/10/17/305632947_725.jpg", "https://img4.newslocker.com/2023/10/17/305632961_725.jpg", "https://img4.newslocker.com/2023/10/17/305632940_725.jpg", "https://img4.newslocker.com/2023/10/17/305632945_725.jpg", "https://img4.newslocker.com/2023/10/17/305632959_725.jpg", "http://www.newslocker.com/images/share-twitter.png", "https://img4.newslocker.com/2023/10/17/305632950_725.jpg", "https://img4.newslocker.com/2023/10/17/305632956_725.jpg", "https://img4.newslocker.com/2023/10/17/305632944_725.jpg", "https://img4.newslocker.com/2023/10/17/305632948_725.jpg", "https://img4.newslocker.com/2023/10/17/305632946_725.jpg", "http://www.newslocker.com/images/newslocker-cube.png", "https://img4.newslocker.com/2023/10/17/305632958_725.jpg", "http://www.newslocker.com/images/newslocker-logo.png", "http://www.newslocker.com/images/share-linkedin.png", "http://www.newslocker.com/images/share-facebook.png", "https://img4.newslocker.com/2023/10/17/305632943_350.jpg", "https://img4.newslocker.com/2023/10/17/305632942_725.jpg", "https://img4.newslocker.com/2023/10/16/305500678_725.jpg", "https://img4.newslocker.com/2023/10/16/305488291_725.jpg"], "top_img": "http://akns-images.eonline.com/eol_images/Entire_Site/2015920/rs_300x300-151020072337-600.Vin-Diesel-Witch-Hunter.jl.101915.jpg?downsize=600:*&crop=600:315;left,top", "keywords": [], "authors": [], "canonical_link": "https://www.newslocker.com/en-us/news/celebrity/vin-diesel-my-kids-had-a-blast-on-the-guardians-of-the-galaxy-vol-2-set/", "title": "Vin Diesel: My Kids Had a Blast on the Guardians of the Galaxy Vol. 2 Set", "meta_data": {"description": "Having Vin Diesel as your dad sure has its perks.The actor revealed to E! News' Will Marfuggi that his children got to hang out on the set of Guardians of the Galaxy Vol. 2--even...", "og": {"title": "Vin Diesel: My Kids Had a Blast on the Guardians of the Galaxy Vol. 2 Set - Celebrity news - NewsLocker", "description": "Having Vin Diesel as your dad sure has its perks.The actor revealed to E! News' Will Marfuggi that his children got to hang out on the set of Guardians of the Galaxy Vol. 2--even...", "type": "website", "url": "https://www.newslocker.com/en-us/news/celebrity/vin-diesel-my-kids-had-a-blast-on-the-guardians-of-the-galaxy-vol-2-set/", "image": "http://akns-images.eonline.com/eol_images/Entire_Site/2015920/rs_300x300-151020072337-600.Vin-Diesel-Witch-Hunter.jl.101915.jpg?downsize=600:*&crop=600:315;left,top", "site_name": "Newslocker"}, "fb": {"admins": 1335791813}, "robots": "index", "google-site-verification": "wAInSoPxz3OEgOXCHtETx-x7ukmlX40FRoiPZpO7ww4", "msvalidate.01": "2F0DB39856FAA0E47C70E9E1FF8653AA"}, "movies": [], "publish_date": 1492631220.0, "source": "http://www.newslocker.com", "summary": ""}