{"url": "https://web.archive.org/web/20130813144353/http://www.primermagazine.com:80/2013/spend/pants-rise-explained-and-why-low-rise-isnt-always-your-best-choice", "text": "One of the most important dimensions for fitting pants isn’t on the label.\n\nWhen it comes to clothing, men have a fairly simple sizing system. Take pants, for example: We get to choose inseam length and waist size. Many women, whose logic-defying sizing system goes all the way down to size 0, would consider us lucky.\n\nThe problem is, like women, men’s bodies come in all shapes and sizes, and our trusty length/waist measurements aren’t always the best way to determine if something fits properly.\n\nFor pants, one of the most important aspects of fit is rise. This article explains what rise is, how it’s measured and why it shouldn’t be overlooked. I’ll also discuss why low rise pants, though popular, are often inappropriate.\n\nWhat is rise?\n\nRise is the distance from the middle of the crotch seam (right between your legs) to the top of the waistband. It usually ranges from 7 inches to 12 inches.\n\nPant rise is important because it determines where your pants sit on your body, which in turn creates your perceived waistline.\n\nRise can work for you or against you. On one hand, you can use rise to your advantage by changing your perceived dimensions. On the other hand, choosing the wrong type of rise will make you look disproportional.\n\nFor example, look at Michael Phelps. Built like a dolphin at 6’4”, he has a surprisingly short 30” inseam. Because of his peculiar torso-to-leg ratio, low rise pants (worn at the hips) make him look unnaturally top heavy:\n\nOn the other hand, he can wear normal rise pants higher up on his waist, near his navel, to visually lengthen his legs for a much more balanced look:\n\nWomen use this little trick all the time, and it works like a charm. Look how Zooey Deschanel and Olivia Wilde – two women with very short legs – visually shorten their torso, creating the waist-to-hip ratio that we men have evolved to love:\n\n(Olivia and Zooey: If you’re reading this, please know that I think you’re both beautiful just the way you are.)\n\nTypes of Rise\n\nRegular Rise\n\nAlso called mid rise or normal rise, regular rise is anywhere from 9 to 11 inches and is meant to be worn at your natural waist. Most pants, especially khakis and trousers, have a regular rise.\n\nLow Rise\n\nWorn at your hips, low rise pants are meant to sit well below your natural waist. They became popular during the 60s and 70s (think bell bottoms) and have made a huge comeback over the past few years. Unlike short and mid rise pants, low rise pants are not meant to conform to your natural waist.\n\nShort Rise\n\nThese range from 7 to 9 inches and are meant to be worn on your natural waist. Short rise pants are not easy to find, but they are a blessing for men with short legs (which happens to be most guys who are below average height).\n\nUnlike low rise pants, which are meant to be worn at the hip, short rise pants are meant to be worn at the natural waist. They have a shorter rise, which means they won’t have a bunch of extra material in the crotch area, and they will be comfortable on shorter bodies.\n\nImportant: Low rise and short rise pants may have the same measurements (e.g., 8” rise) but they will fit differently.\n\nThe best place to find short rise jeans and chinos is Peter Manning NYC. Many men under 5’9” have said that their favorite pair of jeans are from Peter Manning.\n\nOther retailers who carry short rise pants include:\n\nJimmy Au (famous Hollywood suit maker for short men)\n\nJos a Bank (short rise available in select sizes)\n\nHigh Rise\n\nTypically defined as longer than 10 inches, high rise pants are a good option for men who stand over 6’ tall and who want to wear their pants at their waist, rather than at their hips (which is a good decision, especially for formal wear).\n\nHigh rise pants can be found at any “big and tall” store or department. Be sure that you have enough rise for a comfortable fit because it’s impossible to lengthen.\n\nTakeaways\n\n1. Low rise isn’t always your best bet\n\nIf you are below average height, don’t buy low rise pants and wear them as short rise pants by pulling them up to your natural waist. The proportions will be off, and this won’t be comfortable (not to mention, bad for fertility, if you know what I mean). Instead, look for short rise pants, or buy regular rise and have them tailored.\n\nIn general, low rise pants are best for casual looks (think jeans), and they’re not for everyone. If you have short legs and a long torso, stay away from low rise pants. Unless your legs are much longer than your torso, you should stick with regular rise pants for business casual and formal wear.\n\nPlus, compared to low rise pants, regular or even high rise pants contribute to a more sophisticated, mature look. In my opinion, us guys in our 20s and early 30s should be aiming to achieve this look. I don’t know about you, but I’m going for “Gatsby” not “Beiber”.\n\n2. When shopping…\n\nOften times men pay attention to the wrong things when trying on clothes. Truth is, the length of most pants can be altered by a novice tailor for $10-20, and the waist can usually be adjusted by 1-3 inches*. But rise can’t be increased, even by a master tailor, and shortening rise is a difficult and expensive alteration.\n\n*Tip: To be sure the waist can be taken in, look for an extra strip of material at the seam of the seat and waist band.\n\nSo, when you’re in the store trying on pants, try not to be blinded too much on the length and waist. Focus instead on how they feel in the crotch and thighs, which is largely determined by rise.", "images": ["https://web.archive.org/web/20130813144353im_/http://www.primermagazine.com/wp-content/uploads/2012/03/PantsFit/PantsFit_Thumb.jpg", "https://web.archive.org/web/20130813144353im_/http://www.primermagazine.com/wp-content/uploads/2013/07/PantRise/PantsRise_Header.jpg", "https://web.archive.org/web/20130813144353im_/http://www.primermagazine.com/wp-content/uploads/2009/07/Swim/Swim_Thumb.jpg", "https://web.archive.org/web/20130813144353im_/http://www.primermagazine.com/wp-content/uploads/2013/07/PantRise/image04.png", "https://web.archive.org/web/20130813144353im_/http://www.primermagazine.com/wp-content/themes/primer-magazine-5_3/images/authors/Brock McGoff.jpg", "https://web.archive.org/web/20130813144353im_/http://www.primermagazine.com/wp-content/uploads/2013/07/PantRise/PantsRise_Rise.jpg", "https://web.archive.org/web/20130813144353im_/http://www.primermagazine.com/wp-content/uploads/2011/03/StyleQA_Socks/StyleQA_3_Thumb.jpg", "https://web.archive.org/web/20130813144353im_/http://www.primermagazine.com/wp-content/uploads/2013/07/PantRise/image00.png", "https://web.archive.org/web/20130813144353im_/http://www.primermagazine.com/wp-content/uploads/2013/07/PantRise/image01.png", "https://web.archive.org/web/20130813144353im_/http://www.primermagazine.com/wp-content/uploads/2013/07/PantRise/image03.png", "https://web.archive.org/web/20130813144353im_/http://www.primermagazine.com/wp-content/uploads/2013/07/PantRise/Pants_Strip.jpg", "https://web.archive.org/web/20130813144353im_/http://www.primermagazine.com/wp-content/uploads/2013/07/PantRise/PantsRise_Thumb.jpg", "https://web.archive.org/web/20130813144353im_/http://www.primermagazine.com/wp-content/uploads/2011/01/StyleQ%26A_110210/Style_Q%26A_Thumb.jpg", "https://web.archive.org/web/20130813144353im_/http://www.primermagazine.com/wp-content/uploads/2013/07/PantRise/image02.png"], "top_img": "https://web.archive.org/web/20130813144353im_/http://www.primermagazine.com/wp-content/uploads/2013/07/PantRise/PantsRise_Thumb.jpg", "keywords": [], "authors": ["Brock Mcgoff", "G. Maximus", "Chris Jones"], "canonical_link": "https://web.archive.org/web/20130813144353/http://www.primermagazine.com/2013/spend/pants-rise-explained-and-why-low-rise-isnt-always-your-best-choice", "title": "Pants Rise Explained (and Why Low Rise Isn’t Always Your Best Choice)", "meta_data": {"generator": "WordPress 3.5.1", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black", "og": {"title": "Pants Rise Explained (and Why Low Rise Isn’t Always Your Best Choice)", "description": "One of the most important dimensions for fitting pants isn't on the label.", "type": "article", "image": "https://web.archive.org/web/20130813144353im_/http://www.primermagazine.com/wp-content/uploads/2013/07/PantRise/PantsRise_Thumb.jpg"}, "description": "One of the most important dimensions for fitting pants isn't on the label.", "shareaholic": {"site_name": "Primer", "image": "http://www.primermagazine.com/wp-content/uploads/2013/07/PantRise/image02.png"}}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}